[
  {
    "chunk_file": "data/chunks/286_chunk99.txt",
    "text": "6th ed2001, New York: McGraw-Hill. [10] D.B. Camarillo, J.K."
  },
  {
    "chunk_file": "data/chunks/1-s2.0-S1350453324001371-main_chunk136.txt",
    "text": "Compared to an encoder operating at a nominal 60 rpm, this represents a 125 % increase in linear position error. Although the per  centage is large, the absolute value of the error is minimal. It is on the Fig."
  },
  {
    "chunk_file": "data/chunks/1-s2.0-S1350453324001371-main_chunk122.txt",
    "text": "To control the motor s speed, pulse width modulation was used. The results for three different motor speeds are shown in Fig. 12."
  },
  {
    "chunk_file": "data/chunks/JMRR-D-20-00004_R2_chunk28.txt",
    "text": "Space frames   (A) pyramidal/tetrahedral, (B) tetrahedral/octahedral arrangements, (C) Space frame node with rigid joint Surgical robot platform with a novel concentric joint for minimal invasive procedures 3 dimensions, means loads imposed upon the structure are resisted almost wholly via tension forces (FT) or compression forces (FC) along the axes of the struts forming the frame, with little or no shear or bending forces acting upon the struts [14]."
  },
  {
    "chunk_file": "data/chunks/286_chunk66.txt",
    "text": "14. Logic flow chart of the simulation (left) and the resultant simulation of the platform (right). The simulation structure consists of three main subsections: the model construct, the graphical user interface (GUI) initialization, and the draw function."
  },
  {
    "chunk_file": "data/chunks/JMRR-D-20-00004_R2_chunk14.txt",
    "text": "The design of a flexible surgical tool, capable of going around the spinal column for removal of tissue on both the anterior and posterior sides of the spinal column is briefly presented in [3] [4], and is intended to be introduced in detail in a separate paper. 1.2."
  },
  {
    "chunk_file": "data/chunks/286_chunk72.txt",
    "text": "A surgical environment was replicated, representing a typical surgical procedure on the lower lumbar section of the body (Fig. 16), with the aim of removing tissue in a controlled manner from a lamb femur. The water jet system was connected to the functional head."
  },
  {
    "chunk_file": "data/chunks/JMRR-D-20-00004_R2_chunk125.txt",
    "text": "Modified connector joint To connect the linear actuators/legs to the stationary/fixed top and lower mobile base, near-concentric connector cord joints (Figure 14-A, B), were developed and manufactured for the prototype, based on the principles described in section 3."
  },
  {
    "chunk_file": "data/chunks/JMRR-D-20-00004_R2_chunk131.txt",
    "text": "The pre-tensioning of the cord pulls the ends of the nylon barrels together, thus allowing free rotational movement, but resisting the primarily tensile and compressive forces imposed by the legs. 5.4. Other design considerations Switches (S) were incorporated into the design of the linear actuators (Fig."
  },
  {
    "chunk_file": "data/chunks/pone.0047133_chunk63.txt",
    "text": "5(d)). Future studies may incorporate solid modelling of the urethral tissues to understand the temporal dynamics of meatal dilation during voiding and hence the effect on the flow pattern."
  },
  {
    "chunk_file": "data/chunks/JMRR-D-20-00004_R2_chunk119.txt",
    "text": "The  nuts  of the leadscrew mechanism were originally fabricated in stainless steel, but these had a tendency to jam the leadscrew mechanism, due to even quite minor manufacturing misalignments."
  },
  {
    "chunk_file": "data/chunks/1-s2.0-S1350453324001371-main_chunk4.txt",
    "text": "Introduction 1.1. Surgical robotics In recent years, there has been a significant increase in interest in the field of robotic surgery, both in terms of financial investment and research."
  },
  {
    "chunk_file": "data/chunks/pone.0047133_chunk77.txt",
    "text": "doi:10.1371/journal.pone.0047133.g004 The Biophysics of the Urine Stream PLOS ONE | www.plosone.org 4 October 2012 | Volume 7 | Issue 10 | e47133 Accurate estimation of an individual s peak urine flow rate based on measurements of maximum wavelength can be performed if an individual s meatal dilation is calibrated for."
  },
  {
    "chunk_file": "data/chunks/1-s2.0-S1350453324001371-main_chunk16.txt",
    "text": "Published by Elsevier Ltd on behalf of IPEM. This is an open access article under the CC BY license ( http://creativecommons.org/licenses/by/4.0/ ). into an experimental robotic minimally invasive surgical system, these time delays are reduced [6]."
  },
  {
    "chunk_file": "data/chunks/pone.0047133_chunk88.txt",
    "text": "For the group of healthy volunteers the statistically significant (pv0:05) positive correlation gave the following relationship between Qmax and Lmax Qmax~kLmax  10  where k is found to be 0:5mLs{1mm{1. The accuracy of this estimate of Qmax is +20% (2 standard deviations)."
  },
  {
    "chunk_file": "data/chunks/Concentric joint connectors for form-changing space frames AM_chunk31.txt",
    "text": "Ball and socket joints - aligned Figure 8 shows the same joint arrangement, but with forces of compression (FC) acting upon the struts (S). The central connection (CC) component has been made to rotate due to the loads from the struts acting as moment forces (FM) upon it. The lines of force (LF) now do not pass through the con- vergence point (CP)."
  },
  {
    "chunk_file": "data/chunks/Concentric joint connectors for form-changing space frames AM_chunk25.txt",
    "text": "3 JOINT SOLUTIONS 3.1 Initial ideas When first considering the design of the joints for a form-changing space frame, several solutions ap- peared to be suitable."
  },
  {
    "chunk_file": "data/chunks/CASE15_0460_MS_chunk49.txt",
    "text": "Performance modelling The water jet system was set up in the exact configuration as shown in Fig. 3. Quantifiable parameters of the actual system are obtained so that appropriate calculations can be carried out."
  },
  {
    "chunk_file": "data/chunks/CASE15_0460_MS_chunk61.txt",
    "text": "The last test was conducted to explore the effect of the nozzle s orifice diameter and time of cut on the depth of water jet (Fig. 13). Two sizes of orifice diameters were used (0.6 mm and 0.84 mm); the water jet applied for a period of 5s intervals (5- 50 s) with a nozzle stand-off distance of 3.9 mm and 20 bars of applied f low pressure."
  },
  {
    "chunk_file": "data/chunks/Concentric joint connectors for form-changing space frames AM_chunk19.txt",
    "text": "Figure 5 shows a working proto- type of a form-changing octahedral structure devel- oped by the author. Figure 4. Form-changing space frame structures with optional skin Figure 5."
  },
  {
    "chunk_file": "data/chunks/CASE15_0460_MS_chunk75.txt",
    "text": "The parameters, including water pressure, orifice diameter, stand- off distance of the nozzle, and time of cut, were all measured in relationship to each other using two different nozzle sizes. The experimental result shows that the depth of the water jet cut is significantly dependent on the various parameters."
  },
  {
    "chunk_file": "data/chunks/Concentric joint connectors for form-changing space frames AM_chunk18.txt",
    "text": "2.2 Potential applications Although largely theoretical at present, these form-changing structures, optionally clad with a flexible skin (Figure 4) have many potential applica- tions, such as adaptive airline seating, morphing car exteriors and interiors, emergency structural support structures, variable-shape moulds/jigs for forming other materials etc."
  },
  {
    "chunk_file": "data/chunks/CASE15_0460_MS_chunk74.txt",
    "text": "DISCUSSION A significant experimental testing was conducted to measure and control the depth of water jet cutting. In this test, the most important parameters that are involved in the pure water jet cutting process have been tested."
  },
  {
    "chunk_file": "data/chunks/CASE15_0460_MS_chunk60.txt",
    "text": "Flow simulation analysis shows the pressure and velocity distribution for  0.6 mm diameter nozzle (a, b respectively). Preprint submitted to 2015 IEEE International Conference on Automation Science and Engineering. Received March 20, 2015."
  },
  {
    "chunk_file": "data/chunks/Concentric joint connectors for form-changing space frames AM_chunk24.txt",
    "text": "Joints that enable this for 3 or more convergent struts are not thought to exist in nature, at least not with a close degree of concentricity of the pivot points, so inspiration can- not be sought from there. Neither do they appear to have been developed beyond the prototype stage in the field of mechanical engineering."
  },
  {
    "chunk_file": "data/chunks/CASE15_0460_MS_chunk48.txt",
    "text": "Received March 20, 2015. IV. WATER JET SYSTEM: MODELLING AND TESTING A."
  },
  {
    "chunk_file": "data/chunks/Concentric joint connectors for form-changing space frames AM_chunk30.txt",
    "text": "The forces of compression (FC) and tension (FT) acting along the axes of the struts are shown as lines of force (LF). With the angles of separation (AS) be- tween the struts as shown, the lines of force intersect at a convergence point (CP) of the central connec- tion (CC), and the struts are not subject to shear or moment forces. Figure 7."
  },
  {
    "chunk_file": "data/chunks/pone.0047133_chunk89.txt",
    "text": "However this can be greatly improved by precalibrating for an individual s meatal geometry. This could simply be achieved by requesting the patient to void into a standard urine flow meter to obtain the relationship between Lmax and Qmax. This approach would also provide a non-invasive measurement of an individual s meatal dilation during voiding."
  },
  {
    "chunk_file": "data/chunks/1-s2.0-S1350453324001371-main_chunk17.txt",
    "text": "The particular instance of laser microsurgery assisted by a robot is examined by Olivieri et al. [7]. Here, stereoscopic visualisation and 3D reconstruction are used to create a fictional force feedback that enables the surgeon to manipulate a non-contact surgical laser while haptically sensing the operative area."
  },
  {
    "chunk_file": "data/chunks/pone.0047133_chunk76.txt",
    "text": "(b) The dilation parameter, L=Q, is dependent on the cross sectional area and the aspect ratio (Dmax=Dmin) and therefore may be used to describe urethral/meatal opening. Comparisons between the CFD and experimental data for a range of orifice shapes show an excellent agreement in the values of L=Q."
  },
  {
    "chunk_file": "data/chunks/1-s2.0-S1350453324001371-main_chunk5.txt",
    "text": "Robots have been created for a variety of surgical procedures, and they are more accurate overall than traditional techniques because of their various sizes and cutting abilities [1]."
  },
  {
    "chunk_file": "data/chunks/pone.0047133_chunk62.txt",
    "text": "5(c)). However towards the end of the voiding the pressure drops gradually and the meatus slowly returns to its closed form due to the viscoelastic nature of the urethral tissue. This explains the difference between the descending and ascending curves in (Fig."
  },
  {
    "chunk_file": "data/chunks/JMRR-D-20-00004_R2_chunk118.txt",
    "text": "Collars that act as interfaces/bearing between the brass portions, and revolute bearings were fabricated in stainless steel (SAE grade 304), due to it being a reasonably hardwearing material and having good bearing properties."
  },
  {
    "chunk_file": "data/chunks/JMRR-D-20-00004_R2_chunk130.txt",
    "text": "The tips of the sub- assemblies are hollow barrel forms (HB), through which the cord passes, and the ends of the cords are tightly intertwined with each other."
  },
  {
    "chunk_file": "data/chunks/JMRR-D-20-00004_R2_chunk124.txt",
    "text": "This permits the actuator portions to move relative to each other along their shared principal axis, but not rotate around it, in other words, it acts as a  prismatic  bearing or joint. Figure 13 shows an expanded engineering drawing of a complete  leg  with all sub-components. 5.3."
  },
  {
    "chunk_file": "data/chunks/JMRR-D-20-00004_R2_chunk15.txt",
    "text": "Parallel robots and spinal surgeries Surgery is one of the many fields of human endeavor where robots have been introduced due to their accuracy of Revised Manuscript-2 Samir Morad, Christian Ulbricht, Paul Harkin, Justin Chan, Kim Parker, Ravi Vaidyanathan 2 positioning, which exceed natural human capabilities."
  },
  {
    "chunk_file": "data/chunks/286_chunk73.txt",
    "text": "The aim of the test was to assess the effectiveness and performance of the robot in controlling the movement of the surgical tool."
  },
  {
    "chunk_file": "data/chunks/286_chunk67.txt",
    "text": "The draw function runs in an infinite loop so as to continuously update the figure of the platform in real time until the simulation is closed. The end product is a simulation of the parallel platform in 6DOF controlled by user input from the Novint Falcon."
  },
  {
    "chunk_file": "data/chunks/JMRR-D-20-00004_R2_chunk29.txt",
    "text": "Thus, the struts only have to resist elongation from tension, or buckling due to compression. This leads to a very efficient structure for a given quantity of material, i.e. they have excellent strength-to- weight ratios."
  },
  {
    "chunk_file": "data/chunks/1-s2.0-S1350453324001371-main_chunk123.txt",
    "text": "The error increases by approximately 0.1 % when the speed is increased from 60 rpm to more than three times its nominal speed, 200 rpm. Due to the encoder running at more than three times its rated speed, there is a large increase in error. At 400 rpm, the increase is slightly smaller, about 0.03 %."
  },
  {
    "chunk_file": "data/chunks/1-s2.0-S1350453324001371-main_chunk137.txt",
    "text": "10. Motor-encoder test cell. (For interpretation of the references to color in this figure legend, the reader is referred to the web version of this article.)"
  },
  {
    "chunk_file": "data/chunks/286_chunk98.txt",
    "text": "[9] J.E. Shigley, and C.R. Mischke, Mechanical Engineering Desgin."
  },
  {
    "chunk_file": "data/chunks/1-s2.0-S1350453324001371-main_chunk109.txt",
    "text": "S. Morad et al. Medical Engineering and Physics 132 (2024) 104236 7 has 3 actuators which work together to exert a push/pull force in 3D space. In essence the 3 curved arms of NF have tendons connecting them to 3 motors (1 each)."
  },
  {
    "chunk_file": "data/chunks/pone.0047133_chunk9.txt",
    "text": "This has led to the development of a variety of uroflowmetry techniques including gravimetric methods, orifice outflow devices such as the Uflow and more sophisticated rotating disc flow meters [4 8]."
  },
  {
    "chunk_file": "data/chunks/1-s2.0-S1350453324001371-main_chunk121.txt",
    "text": "11) clearly show the effectiveness of the filter circuit; the resulting errors with the filters are reduced by over 90 %. 4.2. Effects of increasing motor speed The encoder errors were also tested as a function of motor speed measured in revolutions per second (rpm)."
  },
  {
    "chunk_file": "data/chunks/1-s2.0-S1350453324001371-main_chunk135.txt",
    "text": "The motor should run at as high a speed as possible. With a higher motor speed, the leg would reach a target extension or retraction in less time, thus decreasing the system s response time. The error introduced by a DC motor speeding at 400 rpm is 0.45 % per leg span (185 mm) or 0.832 mm."
  },
  {
    "chunk_file": "data/chunks/286_chunk59.txt",
    "text": "12. The complete platform model. The reference trajectory is specified in six degree pose space, and an inverse kinematics module converts it into one through six degree leg position space."
  },
  {
    "chunk_file": "data/chunks/286_chunk71.txt",
    "text": "However, as the bend angle of the flexible tip became more pronounced, a slight increase in the temperature of the flexible shaft was noticed, which could affect its mechanical properties over time. Fig.15. Side view of the flexible drill from insertion (a) to full bending (f)."
  },
  {
    "chunk_file": "data/chunks/JMRR-D-20-00004_R2_chunk17.txt",
    "text": "The configuration of most existing robotic surgery devices is based on the  serial manipulator  configuration [3] [4], loosely analogous to the human arm a series of struts (arms) with a hinged joint (elbow), along with pivots (wrist)."
  },
  {
    "chunk_file": "data/chunks/286_chunk65.txt",
    "text": "The desired position (x, y and z) and orientation ( ,   and  ) of the end- effector was specified and inverse kinematic equations were used to calculate the nominal leg lengths of each of the six platform legs. The leg lengths were plotted real-time on a 3D model figure as can be seen in Fig 14. Fig."
  },
  {
    "chunk_file": "data/chunks/pone.0047133_chunk48.txt",
    "text": "L~V=f  8  Equation 8 follows from Equation 7, where the unsteady development of a two-dimensional droplet describes the three- dimensional shape of the jet, and thus the wavelength L scales directly with the flow velocity V. This can also be expressed in terms of flow rate Q, and orifice cross sectional area A, as in Equation 9."
  },
  {
    "chunk_file": "data/chunks/JMRR-D-20-00004_R2_chunk132.txt",
    "text": "12), which act as motor cut-out devices at the point of maximum extension or retraction, primarily to prevent the drive mechanism from breaking components when the mechanical limits of the actuator stroke are reached."
  },
  {
    "chunk_file": "data/chunks/JMRR-D-20-00004_R2_chunk126.txt",
    "text": "These were originally developed for use in variable-geometry space frames (Figure 14-C, D). Fig. 13."
  },
  {
    "chunk_file": "data/chunks/1-s2.0-S1350453324001371-main_chunk7.txt",
    "text": "Surgical robots are designed to improve surgical success by increasing fidelity and thus minimizing patient trauma, but a lack of power and tactile feedback appears to limit clinical success [2]."
  },
  {
    "chunk_file": "data/chunks/pone.0047133_chunk74.txt",
    "text": "(a) For any given orifice, there was a perfect linear correlation between flow rate, Q and wavelength, L, with excellent agreement between the experimental and CFD analysis as shown for an orifice with cross sectional area and Dmax=Dmin of 13mm2 and 6 respectively."
  },
  {
    "chunk_file": "data/chunks/pone.0047133_chunk60.txt",
    "text": "The L=Q parameter reflects the orifice dilation, as quantified through the modelling Fig. 5(c), and thus the non-linearity indicates changes in the meatal dilation during the void. Indeed this was confirmed by measuring from the video images, the meatal opening in terms of the minimum diameter of the urine stream at the meatus (Fig."
  },
  {
    "chunk_file": "data/chunks/1-s2.0-S1350453324001371-main_chunk15.txt",
    "text": "Contents lists available at ScienceDirect Medical Engineering and Physics journal homepage: www.elsevier.com/locate/medengphy https://doi.org/10.1016/j.medengphy.2024.104236 Received 29 December 2023; Received in revised form 28 August 2024; Accepted 2 September 2024 Medical Engineering and Physics 132 (2024) 104236 Available online 2 September 2024 1350-4533/  2024 The Author(s)."
  },
  {
    "chunk_file": "data/chunks/1-s2.0-S1350453324001371-main_chunk29.txt",
    "text": "Online soft tissue parameter identification is created using the extended Kalman filter (EKF). It based on the nonlinear Hunt-Crossley (H C) contact model being dynamically linearized with respect to the system state [17,18]."
  },
  {
    "chunk_file": "data/chunks/Concentric joint connectors for form-changing space frames AM_chunk26.txt",
    "text": "Initially, crude prototypes were made using flexible rubber tubing, with the ends of the tubes cut with a scalpel to match the form of the adjoining section, with the sections glued to each other, and then assembled with the struts as part of a frame (Figure 6)."
  },
  {
    "chunk_file": "data/chunks/Concentric joint connectors for form-changing space frames AM_chunk32.txt",
    "text": "At the ball-and-socket joint JBS1 the strut (S1) connected to the ball is now in contact with the socket edge of the socket at point P1. Thus a load resulting in a compression force (FC) upon strut S1 would impose a bending moment at this point of contact (P1) upon the end of strut S1 as it induces further rotation of the central connection."
  },
  {
    "chunk_file": "data/chunks/CASE15_0460_MS_chunk76.txt",
    "text": "The depth of cut is directly related to the source pressure, time of cut, and nozzle diameter. The depth of cut is inversely related to the stand-off distance."
  },
  {
    "chunk_file": "data/chunks/CASE15_0460_MS_chunk62.txt",
    "text": "C. Mock Surgery A surgical environment was replicated to represent a typical surgical procedure of a surgery on the lower lumbar section of the body (Fig.14). The water jet system was connected to the functional head and the aim of the test was to assess the effectiveness and performance of the robot in the conducting surgical procedure."
  },
  {
    "chunk_file": "data/chunks/CASE15_0460_MS_chunk89.txt",
    "text": "Cancer Chemother Pharmacol 1989. 23(S74-S77). [7] H.U."
  },
  {
    "chunk_file": "data/chunks/CASE15_0460_MS_chunk88.txt",
    "text": "Surg Gynecol Obstet, 1989. 168: p. 267-268. [6] Y. Une, J.Uchino, T. Horie, Y. Sato, K. Ogasawara, A. Kakita, F. Sano Liver resection using a water jet."
  },
  {
    "chunk_file": "data/chunks/CASE15_0460_MS_chunk63.txt",
    "text": "Overall, the meat was successfully dissected and the robot functioned well in carrying out the procedure. The overall operation time taken was 5 minutes and 20 seconds from start to finish and this time is likely to improve with practice and improvements to the platform hardware."
  },
  {
    "chunk_file": "data/chunks/CASE15_0460_MS_chunk77.txt",
    "text": "As a result of carrying out the previous experimental tests and outcomes, we are now able to define the depth of water jet cut, or the jet effective length in which it starts to cut the tissue, for certain known parameters this include orifice diameter, stand-off distance, source pressure, and time."
  },
  {
    "chunk_file": "data/chunks/Concentric joint connectors for form-changing space frames AM_chunk33.txt",
    "text": "The intrinsic structural efficiency of the space frame structure is compromised, as its struts now have to resist shear and bending forces, rather than simply resisting tension (FT) and compression (FC) loads along their primary axes. Figure 8."
  },
  {
    "chunk_file": "data/chunks/Concentric joint connectors for form-changing space frames AM_chunk27.txt",
    "text": "Whilst this was acceptable for the purposes of an initial proof-of- concept prototype, failure of the joints was common, often due to the de-bonding of the glued sections. Figure 6."
  },
  {
    "chunk_file": "data/chunks/1-s2.0-S1350453324001371-main_chunk28.txt",
    "text": "In robotic-assisted MIS, real-time identification of soft tissues is important to provide accurate force feedback during robot s surgical activities. In their study, Zhu et al. introduces an online approach for soft tissue characterisation."
  },
  {
    "chunk_file": "data/chunks/1-s2.0-S1350453324001371-main_chunk14.txt",
    "text": "E-mail addresses: s.morad@uel.ac.uk (S. Morad), Christian.Ulbricht@imperial.nhs.uk (C. Ulbricht), paul.harkin@formchangingstructures.com (P. Harkin), justin_ chy@hotmail.com (J. Chan), k.parker@imperial.ac.uk (K. Parker), r.vaidyanathan@imperial.ac.uk (R. Vaidyanathan)."
  },
  {
    "chunk_file": "data/chunks/pone.0047133_chunk61.txt",
    "text": "5(c)). Thus during voiding the meatus opens under the flow pressure so that the aspect ratio reduces and cross sectional area increases, thereby influencing the wavelength (L) with an associated reduction in the dilation parameter (L=Q). At the onset of voiding the pressure is sufficient to cause the meatus to rapidly open (Fig."
  },
  {
    "chunk_file": "data/chunks/pone.0047133_chunk75.txt",
    "text": "The relationship between flow rate and wavelength was also estimated using the method of Rayleigh which assumes small amplitude perturbations from a cylindrical jet in contrast to the current CFD analysis. For large amplitude oscillations which occur when aspect ratios Dmax=Dminw1:5, the Rayleigh method significantly under estimated the wavelength."
  },
  {
    "chunk_file": "data/chunks/1-s2.0-S1350453324001371-main_chunk6.txt",
    "text": "Robotic surgery promises greater dexterity and greater accuracy by minimizing human error and incorporating myriad other surgical methods that can be performed with the help of a computer."
  },
  {
    "chunk_file": "data/chunks/JMRR-D-20-00004_R2_chunk127.txt",
    "text": "An isometric view of an expanded plot of the linear actuator: (G) gear, (M) motor, (B) barrel, (S) switches, (R) rod, and (SA) sub- assemblies. Fig. 14."
  },
  {
    "chunk_file": "data/chunks/pone.0047133_chunk49.txt",
    "text": "L~Q=Af  9  Since, for a given liquid density, the oscillation frequency is solely a function of droplet shape, it follows that the ratio of wavelength to flow-rate (L=Q) is purely dependent on the orifice area and aspect ratio (Dmax=Dmin) (the action of viscosity was found to be small in this case and does not influence the oscillation frequency)."
  },
  {
    "chunk_file": "data/chunks/JMRR-D-20-00004_R2_chunk133.txt",
    "text": "Rotary encoders are installed on the motor/gearbox shaft, as a means of measuring the revolutions of the motor, and hence calculate the extension/retraction of each actuator."
  },
  {
    "chunk_file": "data/chunks/286_chunk64.txt",
    "text": "B. Simulation Using Graphical User Interface (GUI) In order to validate the inverse kinematics formulated in section III-B, a simulation of the HexaSlide Manipulator type designed by Merlet and Gosselin [14] was created in MATLAB that simulated the movement of a 6DoF model receiving inputs from the Novint Falcon."
  },
  {
    "chunk_file": "data/chunks/286_chunk70.txt",
    "text": "A human femur model was used to test the ability of the flexible surgical drill system. The speed range of the drill used in this test was 25,000 - 30,000 rpm. The experimental result showed that the prototype was able to drill a hole of  3mm and 10mm depth rapidly and smoothly, whilst the Flexion system forms a  J -shape."
  },
  {
    "chunk_file": "data/chunks/JMRR-D-20-00004_R2_chunk16.txt",
    "text": "The evolution of surgical robots was achieved through a number of consecutive generations where many issues were improved from one generation to the next."
  },
  {
    "chunk_file": "data/chunks/286_chunk58.txt",
    "text": "Fig. 12 shows the full block diagram of the platform. Fig."
  },
  {
    "chunk_file": "data/chunks/1-s2.0-S1350453324001371-main_chunk134.txt",
    "text": "For this study, this is an acceptable level of accuracy with a very small error. The observed rotation values were always less than or equal to the expected values. In this case, noise is the main cause of the error."
  },
  {
    "chunk_file": "data/chunks/pone.0047133_chunk8.txt",
    "text": "* E-mail: a.wheeler@soton.ac.uk Introduction The analysis of urine flow rate is important in the diagnosis of urinary conditions ranging from neuromuscular pathologies to bladder outlet obstruction [1 3]."
  },
  {
    "chunk_file": "data/chunks/1-s2.0-S1350453324001371-main_chunk120.txt",
    "text": "The response variable in this experi  ment is the speed of the DC motor. The motor speed was held constant at 60 rpm, which is the rated speed of the quadrature encoder. The results (Fig."
  },
  {
    "chunk_file": "data/chunks/1-s2.0-S1350453324001371-main_chunk108.txt",
    "text": "MATLAB demonstration of various geometrical constraints. (A) point, (B) circle, (C) box, and (D) sphere. (For interpretation of the references to color in this figure legend, the reader is referred to the web version of this article.)"
  },
  {
    "chunk_file": "data/chunks/1-s2.0-S1350453324001371-main_chunk124.txt",
    "text": "Accordingly, the errors caused by the encoder running above its nominal speed are relatively constant at higher speeds. 5. Discussion For minimally invasive procedures, a surgical robotic platform with a novel concentric joint had previously been introduced."
  },
  {
    "chunk_file": "data/chunks/1-s2.0-S1350453324001371-main_chunk130.txt",
    "text": "Any level of control accuracy can be achieved by adjusting this scaling factor. Scaling control improves the surgeon s dexterity to pre  viously unattainable levels of precision. The NF can only input 3DOF."
  },
  {
    "chunk_file": "data/chunks/1-s2.0-S1350453324001371-main_chunk118.txt",
    "text": "There are, in total, six motor- encoder functional cells incorporated in the robot. Fig. 10 shows the test cell setup, which consists of a DC motor, rotary encoder, and adapter."
  },
  {
    "chunk_file": "data/chunks/JMRR-D-20-00004_R2_chunk12.txt",
    "text": "(A) (B) Fig. 1. Non-reachable cancerous tissue (red) on the anterior side of the spinal column (A) [2], and photographs of the actual surgery taken as a part of this study (B)."
  },
  {
    "chunk_file": "data/chunks/286_chunk74.txt",
    "text": "It did this by entering the body, navigating the probe tip to the target surgical site, conducting a dissection of tissue, controlling the orientation and curvature of the probe tip, and exiting the body cavity, whilst always avoiding contact with any internal organs."
  },
  {
    "chunk_file": "data/chunks/286_chunk60.txt",
    "text": "A generic Proportional-Integrator-Derivative (PID) controller attempts to drive the manipulator along the desired trajectory. The output data of the behavior of the surgical platform system is obtained via a position sensor block. Fig."
  },
  {
    "chunk_file": "data/chunks/286_chunk48.txt",
    "text": "The tips of the sub- assemblies are hollow barrel forms (HB), through which the cord passes, and the ends of the cords are tightly intertwined with each other."
  },
  {
    "chunk_file": "data/chunks/1-s2.0-S1350453324001371-main_chunk2.txt",
    "text": "Previously, we introduced the surgical robotic platform (SRP) with a novel concentric connector joint (CCJ). This study aims to develop a haptic control system that integrates an active constraint controller into a surgical robot platform."
  },
  {
    "chunk_file": "data/chunks/pone.0047133_chunk71.txt",
    "text": "Thus an alternative explanation is that the chronic low flow rates in these patients may lead to urethra atrophy or constriction and that this persists even after the prostatic urethral obstruction causing the low flow rate is reduced."
  },
  {
    "chunk_file": "data/chunks/pone.0047133_chunk65.txt",
    "text": "In addition, the same procedure was performed with a sample of 60 healthy male volunteers with no history of urinary flow problems. All participants from both groups reported the same characteristic urine flow pattern which evolved over the course of a single void in line with the flow rate, as shown in Fig. 5(b) & (c)."
  },
  {
    "chunk_file": "data/chunks/JMRR-D-20-00004_R2_chunk137.txt",
    "text": "There is a total of six pairs of concentric spherical joints; three on the top B1=B6, B2=B3, and B4=B5 and three on the end effector P1=P2, P3=P4 and P5=P6."
  },
  {
    "chunk_file": "data/chunks/pone.0047133_chunk59.txt",
    "text": "5(d). The relationship is not purely linear, as illustrated by the change in L=Q values during the course of the void (Fig. 5(c))."
  },
  {
    "chunk_file": "data/chunks/JMRR-D-20-00004_R2_chunk123.txt",
    "text": "Otherwise, there might be tendency for the rotation of the lead screw to simply rotate the portion intended to be extended/retracted, due to friction between the lead screw and the internal thread. This can be avoided by using a  key  in either the barrel or piston, which engage/slides within a  keyway  or slot within the other portion."
  },
  {
    "chunk_file": "data/chunks/1-s2.0-S1350453324001371-main_chunk38.txt",
    "text": "The power of the motors is turned on when entering transition zone II and moving towards the cutting boundary. The stationary position command is set in the direction of the boundary in accordance with the active constraint. The cutter is prevented from entering the forbidden zone III by using this control concept."
  },
  {
    "chunk_file": "data/chunks/1-s2.0-S1350453324001371-main_chunk10.txt",
    "text": "The biggest obstacle to the widespread use of the surgical robot is the inability of the surgeon to feel the surgical environment through the use of robots. Haptic technology aims to solve this problem by providing cutaneous (tactile) and kinesthetic (force) feedback to the user."
  },
  {
    "chunk_file": "data/chunks/CASE15_0460_MS_chunk73.txt",
    "text": "Knowing the value of one element of the group of elements that influence the depth of water jet cut, which includes: flow pressure, nozzle diameter, nozzle stand-off distance, and time of cut, would be sufficient to determine the other figures VI."
  },
  {
    "chunk_file": "data/chunks/CASE15_0460_MS_chunk67.txt",
    "text": "The depth of the water jet cut as a function of nozzle stand-off distance with 0.84 mm orifice diameter, applying various set of pressures over 5s. Fig. 13."
  },
  {
    "chunk_file": "data/chunks/Concentric joint connectors for form-changing space frames AM_chunk23.txt",
    "text": "In both nature and man-made ob- jects, there are countless joint mechanisms that con- nect together 2 elements that can pivot around a point with 3 DOF, e.g. the ball-and socket joint found in the human shoulder."
  },
  {
    "chunk_file": "data/chunks/Concentric joint connectors for form-changing space frames AM_chunk37.txt",
    "text": "Concentric joints by Bosscher/Ebert-Uphoff (left) and Hamlin (right) When attempting to design such a concentric 3 DoF joint for 3 or more convergent struts, it turns out to be a deceptively difficult task. Instinctively, the designer may wish to locate rigid material pre- cisely at the pivot point (i.e."
  },
  {
    "chunk_file": "data/chunks/CASE15_0460_MS_chunk98.txt",
    "text": "Flexible Robotic Device for Spinal Surgery. in Proceedings of the 2014 IEEE International Conference on Robotics and Biomimetics. 2014."
  },
  {
    "chunk_file": "data/chunks/CASE15_0460_MS_chunk99.txt",
    "text": "Bali, Indonesia: IEEE. [15] A. Kapoor, M.Li, R.H. Taylor. Constrained Control for Surgical Assistant Robots."
  },
  {
    "chunk_file": "data/chunks/Concentric joint connectors for form-changing space frames AM_chunk36.txt",
    "text": "3.3 Mechanisms for concentric joints As part of the growing interest in variable geome- try truss structures within the robotic community since the 1990s, several research groups have been developing novel designs for truly concentric free- rotation joints (Fig. 9), such as those by Bosscher/Ebert-Uphoff (2003) and Hamlin (1994). Figure 9."
  },
  {
    "chunk_file": "data/chunks/Concentric joint connectors for form-changing space frames AM_chunk22.txt",
    "text": "The pivot point needs to be at the node point of the space frame to ensure the struts form the triangles that are key to the frames stability and structural efficiency (i.e. the pivot points must be concentric)."
  },
  {
    "chunk_file": "data/chunks/CASE15_0460_MS_chunk66.txt",
    "text": "14: experimental mock surgery setup with the flexion probe equipped with water jet nozzle. Fig. 12."
  },
  {
    "chunk_file": "data/chunks/CASE15_0460_MS_chunk72.txt",
    "text": "This can be done by using the stand-off distance as a reference and then adjusting the amount of pressure and applied time."
  },
  {
    "chunk_file": "data/chunks/1-s2.0-S1350453324001371-main_chunk11.txt",
    "text": "Using kinesthetic haptics, a robot simulates touch interaction with a patient and transmits important information about the operating envi  ronment to the surgeon. As a result, kinesthetic haptic positional feed  back control is used to assist the user in safely and successfully performing certain operations using a robotic manipulator."
  },
  {
    "chunk_file": "data/chunks/1-s2.0-S1350453324001371-main_chunk39.txt",
    "text": "An illustrative example of constrained control is provided [23]. Staying on a point, avoiding plane penetration, moving along a line and rotating around a line are some of the geometric constraints that are relevant to surgical robots. M. Scheint et al."
  },
  {
    "chunk_file": "data/chunks/pone.0047133_chunk58.txt",
    "text": "This corresponds with a change in the wavelength which reaches a maximum of approximately 80mm coinciding with the peak urine flow rate (Fig. 5(b)). There is a clear positive correlation between wavelength (L) and flow rate (Q) as predicted Fig."
  },
  {
    "chunk_file": "data/chunks/JMRR-D-20-00004_R2_chunk122.txt",
    "text": "Prismatic bearings For mechanisms where a lead screw is used, it is necessary to incorporate measures to prevent rotation of the various portions of the actuator relative to each other along the axis of the lead screw."
  },
  {
    "chunk_file": "data/chunks/JMRR-D-20-00004_R2_chunk136.txt",
    "text": "What follows will be a brief description of the Euler s equations used to solve this system. For convenience, the important notations used here are presented in Table 1. The configuration of a 3-3 robot platform can be seen in Figure 16."
  },
  {
    "chunk_file": "data/chunks/pone.0047133_chunk64.txt",
    "text": "We then enlisted a group of 60 male patients who had been referred to a urologist due to low urine flow rate and suspected bladder outlet obstruction associated with prostatic enlargement. The patients were asked to record the maximum wavelength whilst voiding into a clinical urine flow meter. The flow meter used was a Smartflow (Albyn Medical)."
  },
  {
    "chunk_file": "data/chunks/pone.0047133_chunk70.txt",
    "text": "It is possible that the reduced urethral opening reflects the greater average age of the patient cohort and associated age-related urethral stiffening [14]. However there was no correlation between age and dilation parameter with younger patients also showing high values."
  },
  {
    "chunk_file": "data/chunks/1-s2.0-S1350453324001371-main_chunk3.txt",
    "text": "We have successfully established haptic feedback control for the sur  gical robot using constraint control and inverse kinematic relationships integrated into the overall positioning structure. A preliminary feasibility study, modelling, and simulation were presented. 1."
  },
  {
    "chunk_file": "data/chunks/286_chunk49.txt",
    "text": "The pre-tensioning of the cord pulls the ends of the nylon barrels together, thus allowing free rotational movement, but resisting the primarily tensile and compressive forces imposed by the legs. Fig. 9."
  },
  {
    "chunk_file": "data/chunks/286_chunk61.txt",
    "text": "13c shows the x, y, and z values of the position of the body block, representing the end effector moving over time as the model simulates. Fig. 13a represents the 2D form and Fig."
  },
  {
    "chunk_file": "data/chunks/JMRR-D-20-00004_R2_chunk13.txt",
    "text": "This paper explores the mechanical design of a robotic framework, developed for use in this surgical procedure, as the guide and moving mount for an innovative surgical tool. The framework is a parallel manipulator, and uses novel concentric joints to simplify both the mechanical design of the framework and the kinematics."
  },
  {
    "chunk_file": "data/chunks/286_chunk75.txt",
    "text": "Overall, the tissue was successfully dissected and the robot functioned well in carrying out the procedure in 5 minutes and 20 seconds; this time is likely to improve with practice and following improvements to the platform hardware. Fig. 16."
  },
  {
    "chunk_file": "data/chunks/1-s2.0-S1350453324001371-main_chunk119.txt",
    "text": "From the encoder datasheet, one revolution of the encoder produces 96 pulses. 4.1. Motor-Encoder cell accuracy with filter circuit To test the accuracy of the function cell, a series of target encoder pulses were sent to the DC motor."
  },
  {
    "chunk_file": "data/chunks/1-s2.0-S1350453324001371-main_chunk131.txt",
    "text": "This does not provide a complete definition of the robot s end effector orientation. A MATLAB GUI was created in this study to specify the remaining 3DOF, partially resolving the problem. Future versions of this device should use a 6DOF haptic input device, such as Phantom Omni, to replace the NF and GUI."
  },
  {
    "chunk_file": "data/chunks/1-s2.0-S1350453324001371-main_chunk125.txt",
    "text": "The purpose of this study was to develop and test a working position control structure for a surgical robot that incorporates haptic technology. The inverse kinematic equations were validated using a computer simulation model developed in MATLAB."
  },
  {
    "chunk_file": "data/chunks/1-s2.0-S1350453324001371-main_chunk133.txt",
    "text": "It would take 59.68 turns (5730 encoder pulses) to span the entire leg range since the leg range is (Lmax  Lmin = 491  306 = 185 mm). As a result of the filter circuit, a percentage error of approximately 0.2 % is expected. The pulses correspond to 11.46 rev  olutions, or 0.37 mm, or 0.11937 pulses."
  },
  {
    "chunk_file": "data/chunks/1-s2.0-S1350453324001371-main_chunk127.txt",
    "text": "During the robot test, it was found that the probe s end effector was very sensitive to the movements of the input device, the NF. This problem could be solved by introducing a scaling system into the control scheme [31]."
  },
  {
    "chunk_file": "data/chunks/286_chunk88.txt",
    "text": "[2] M. Shoham, L. Joskowicz, E. Batkilin, and Y. Kunicher, Bone- Mounted Miniature Robot for Surgical Procedures: Concept and Clinical Applications. IEEE Transactions On Robotics And Automation, 2003. 19(5): p. 9."
  },
  {
    "chunk_file": "data/chunks/286_chunk63.txt",
    "text": "Output data representation, working envelope in (a) two and (b) three dimensions; (c) x y and z position of the end effector."
  },
  {
    "chunk_file": "data/chunks/286_chunk77.txt",
    "text": "By varying the jet pressure, a degree of control can be given over its effective cutting depth. This could be calibrated by measuring the cutting depth at various pressures via experiment. The distance moved by the nozzle could be measured by fixing a distance measuring sensor on the nozzle and another on the incision access."
  },
  {
    "chunk_file": "data/chunks/JMRR-D-20-00004_R2_chunk11.txt",
    "text": "One of the most challenging procedures targets the removal of cancerous tumors sitting on top of and around the lumber vertebrae. At present, the surgeon approaches the patient from the back of the body, and the tumor is removed only from the posterior side of the spinal column using the available rigid tools, which are typically hand-held."
  },
  {
    "chunk_file": "data/chunks/JMRR-D-20-00004_R2_chunk39.txt",
    "text": "Joints that enable this for 3 or more convergent struts are not thought to exist in nature, at least not with a close degree of concentricity of the pivot points, so inspiration cannot be sought from there. Neither do they appear to have been developed beyond the prototype stage in the field of mechanical engineering. 2.2."
  },
  {
    "chunk_file": "data/chunks/pone.0047133_chunk66.txt",
    "text": "For the group of healthy volunteers there was a statistically significant (pv0:05) positive correlation (correlation coefficient R2~0:51) between peak flow rate (Qmax) and maximum wavelength (Lmax)(Fig. 6(a))."
  },
  {
    "chunk_file": "data/chunks/1-s2.0-S1350453324001371-main_chunk1.txt",
    "text": "Haptic feedback is integrated into robotic surgical systems to restore the surgeon s perception of forces in response to interaction with objects in the surgical environment. The ideal exact emulation of the robot s interaction with its physical environment in free space is a very challenging problem to solve completely."
  },
  {
    "chunk_file": "data/chunks/pone.0047133_chunk72.txt",
    "text": "Although it is unclear for how long such an effect might persist, our data is supported by clinical experience which suggests that certain patients may benefit from surgical dilation of the urethra in order to regain a normal flow rate [15]. Thus, our data and the resulting nomogram shown in Fig."
  },
  {
    "chunk_file": "data/chunks/JMRR-D-20-00004_R2_chunk108.txt",
    "text": "Linear actuator For the variable-length linear actuators, or legs, a relatively simple single-portion extension configuration was used. This configuration was preferred over multiple-portion extension devices; these are normally used when the retraction/extension ratio needs to be greater than 1:1.7."
  },
  {
    "chunk_file": "data/chunks/JMRR-D-20-00004_R2_chunk120.txt",
    "text": "They were therefore refabricated in nylon 6 (Polycaprolactam), a material commonly used in mechanical bearing applications, which overcame the jamming problem."
  },
  {
    "chunk_file": "data/chunks/JMRR-D-20-00004_R2_chunk134.txt",
    "text": "The form of the platform s lower plate (LP) has been determined by the need to make it as rigid as possible, whilst at the same time minimizing the visual obstruction it creates for the operator/surgeon (Fig. 14). 6."
  },
  {
    "chunk_file": "data/chunks/pone.0047133_chunk99.txt",
    "text": "Imaging of the Male Urine Stream Imaging of complete voiding events was conducted for a health male volunteer. A scale rule was held alongside and parallel to the urine stream to enable the instantaneous wavelength to be measured from the video images. The temporally varying flow rate was measured using a clinical gravimetric urine flow meter."
  },
  {
    "chunk_file": "data/chunks/1-s2.0-S1350453324001371-main_chunk13.txt",
    "text": "By inte  grating an environment estimation and force prediction methodology Place of work: The Department of Mechanical Engineering, Imperial College London, South Kensington Campus, London SW7 2BX, United Kingdom. * Corresponding author at: The Department of Engineering, The University of East London, University Way, London, E16 2RD, UK."
  },
  {
    "chunk_file": "data/chunks/CASE15_0460_MS_chunk64.txt",
    "text": "V. HAPTIC CONTROL OF THE DEPTH OF THE WATER JET CUT The active regional constraint would restrict the movement of the tip from entering a predefined geometric region. This method can be used in the controlling the depth of water jet cut by applying the outcomes obtained from the experimental testing of the water jet cutting animal tissue."
  },
  {
    "chunk_file": "data/chunks/CASE15_0460_MS_chunk70.txt",
    "text": "If we position the water jet nozzle on the boundary of the forbidden region, then we know exactly the nozzle stand-off distance, which is the distance between the nozzle and target tissue/ cancerous tumor."
  },
  {
    "chunk_file": "data/chunks/Concentric joint connectors for form-changing space frames AM_chunk34.txt",
    "text": "Ball and socket joints - misaligned Should the loads on the struts (S) change to result in tension forces (FT), the central connection will ro- tate back in the opposite direction, as the struts exert a pulling force upon it via the ball/socket joints. This rotation could be sudden, and difficult for any con- trol system to predict."
  },
  {
    "chunk_file": "data/chunks/CASE15_0460_MS_chunk58.txt",
    "text": "11. The depth of the water jet cut as a function of pressure with 3.9 mm nozzle stand-off distance and 0.84 mm orifice diameter over 5s Fig. 8."
  },
  {
    "chunk_file": "data/chunks/Concentric joint connectors for form-changing space frames AM_chunk20.txt",
    "text": "Prototype octahedral form-changing space frame 2.3 Requirements for the joints In a form-changing space frame, the struts can change length independently of one another."
  },
  {
    "chunk_file": "data/chunks/Concentric joint connectors for form-changing space frames AM_chunk21.txt",
    "text": "There- fore, at each node point, a joint is required where at least 3 struts need to pivot with 3 degrees of freedom (DOF) around the nodes where the ends of the struts are connected."
  },
  {
    "chunk_file": "data/chunks/Concentric joint connectors for form-changing space frames AM_chunk35.txt",
    "text": "This rotation amounts to lo- calised instability of the joint assembly. For the overall framework, the accumulation of these local- ised instabilities would lead to wider patterns of more pronounced and uncontrolled instability."
  },
  {
    "chunk_file": "data/chunks/CASE15_0460_MS_chunk59.txt",
    "text": "Plot shows the relationship between flow pressure and flow rate of the water jet unit. Fig. 9."
  },
  {
    "chunk_file": "data/chunks/CASE15_0460_MS_chunk71.txt",
    "text": "Based on the experimental data analysis and using the relationship between the depth of cut as a function of flow pressure and the stand-off distance of the nozzle (Fig. 13), we can specify the depth of water jet cut as a function of flow pressure and time of the cut."
  },
  {
    "chunk_file": "data/chunks/CASE15_0460_MS_chunk65.txt",
    "text": "With reference to Fig. 15, assuming that a known size of cancerous tissue (red sphere) is centred inside a predefined cube. The cube represented a regional constraint that Fig."
  },
  {
    "chunk_file": "data/chunks/1-s2.0-S1350453324001371-main_chunk12.txt",
    "text": "The integration of haptic feedback into teleoperated robotic surgical systems poses a notable difficulty since system communication time delays induce a trade-off between transparency and stability."
  },
  {
    "chunk_file": "data/chunks/pone.0047133_chunk98.txt",
    "text": "The nozzles were designed to have a length of 50 mm section to ensure a straight walled channel of fixed cross-sectional shape prior to the exit orifice, thus ensuring minimal expansion or contraction of the jet at the nozzle exit. Liquid water was supplied at mains pressure (0:4MPa) and preset physiological flow rates of 5 to 50 mL:s{1."
  },
  {
    "chunk_file": "data/chunks/JMRR-D-20-00004_R2_chunk135.txt",
    "text": "Kinematics of the Robot Platform It is necessary to calculate the required leg lengths of each of the six platform legs in order for the robot platform to control the desired orientation of its end-effector as specified by the user. Based on [20, 21], the inverse kinematic was formulated for the 3-3 parallel octahedral platform."
  },
  {
    "chunk_file": "data/chunks/JMRR-D-20-00004_R2_chunk121.txt",
    "text": "For other, non-moving components, such as various brackets and the main mounting block, which connects the motor/gearbox assembly to the brass actuator portions, aluminum was chosen for its easy machining properties and low relative weight. 5.2."
  },
  {
    "chunk_file": "data/chunks/pone.0047133_chunk73.txt",
    "text": "6(a), helps to identify this subset of patients as those for whom Lmax=Qmax is greater than the 95% confidence limit of 3:52, determined for healthy volunteers [16]. Figure 4. Experimental and computational models show the influence of flow rate and orifice size and geometry on the shape of the jet flow."
  },
  {
    "chunk_file": "data/chunks/1-s2.0-S1350453324001371-main_chunk0.txt",
    "text": "Paper Active constraint control for the surgical robotic platform with concentric connector joints Samir Morad a,*, Christian Ulbricht b, Paul Harkin c, Justin Chan c, Kim Parker c, Ravi Vaidyanathan c a The University of East London, University Way, London, E16 2RD, UK b Charing Cross Hospital, London, W6 8RF, UK c Imperial College London, London SW7 2BX, UK A R T I C L E I N F O Keywords: Surgical robots Haptic feedback Active constraint Control system A B S T R A C T Robotic minimally invasive surgery (MIS) has changed numerous surgical techniques in the past few years and enhanced their results."
  },
  {
    "chunk_file": "data/chunks/JMRR-D-20-00004_R2_chunk109.txt",
    "text": "Typical applications for multiple-portion extension devices are for long-span crane booms that must be relatively compact when transported, or retractable radio aerials. For any given method of powered extension/retraction, their design tends to be more complex than for single-portion actuators. With reference to Fig."
  },
  {
    "chunk_file": "data/chunks/pone.0047133_chunk67.txt",
    "text": "The patient group showed no statistically significant correlation between Lmax and Qmax in contrast to the positive correlation for healthy volunteers (Fig. 6(a)). For the patient group, the dilation parameter (Lmax=Qmax) was statistically different (pv0:001) and exhibited greater variability than that for healthy men (Fig."
  },
  {
    "chunk_file": "data/chunks/JMRR-D-20-00004_R2_chunk38.txt",
    "text": "In both nature and man- made objects, there are countless joint mechanisms that connect together 2 elements that can pivot around a point with 3DoF, e.g. the ball-and-socket joint found in the human shoulder."
  },
  {
    "chunk_file": "data/chunks/286_chunk76.txt",
    "text": "Mock surgical setup   flexible tip/probe equipped with water jet tool. VI. DISCUSSION Despite the advantages of implementing a water jet system to cut tissues in a surgical environment, there is a risk of the jet cutting through the target tissue, and then going on to hit the underlying tissues and damaging them."
  },
  {
    "chunk_file": "data/chunks/JMRR-D-20-00004_R2_chunk10.txt",
    "text": "Currently, spinal surgical tools are reliant on drills and cutting tools which vary in their principles of operation. However, these tools cannot navigate around small corners present in the complex bones of the spinal column (Fig. 1-A)."
  },
  {
    "chunk_file": "data/chunks/286_chunk62.txt",
    "text": "13b the 3D working envelope of the end effector. Fig. 13."
  },
  {
    "chunk_file": "data/chunks/286_chunk89.txt",
    "text": "[3] C.M. Vollmer, A. Sahajpal, M.S. Cattral, D.R."
  },
  {
    "chunk_file": "data/chunks/1-s2.0-S1350453324001371-main_chunk126.txt",
    "text": "A position control code with haptic rendering and trajectory monitoring was successfully implemented using the required hardware, software, and electronics. Tests were conducted to determine the accuracy and robustness of the system."
  },
  {
    "chunk_file": "data/chunks/1-s2.0-S1350453324001371-main_chunk132.txt",
    "text": "As a result, controlling the robot becomes more intuitive and reduces cognitive load for the surgeon. It was determined that a single motor revolution corresponds to a 3.1 mm change in leg length based on the dimensions of the gears in the robot s leg."
  },
  {
    "chunk_file": "data/chunks/1-s2.0-S1350453324001371-main_chunk169.txt",
    "text": "Extended Kalman filter for online soft tissue characterization based on Hunt-Crossley contact model. J Mech Behav Biomed Mater 2021;123:104667. [18] Zhu X, Li J, Zhong Y, Choi KS, Shirinzadeh B, Smith J, Gu C. Iterative Kalman filter for biological tissue identification."
  },
  {
    "chunk_file": "data/chunks/JMRR-D-20-00004_R2_chunk88.txt",
    "text": "It is also proportionally low relative to the overall length of the telescopic struts of the prototypes (which vary in length from 450mm to 270mm); the displacement of concentricity is between 0.9% and 1.5% of the strut length. 4. Analysis of the Design of the Surgical Robot Platform 4.1."
  },
  {
    "chunk_file": "data/chunks/1-s2.0-S1350453324001371-main_chunk155.txt",
    "text": "Laparoscopic surgery for rectal cancer: approaches, challenges and outcome. editor. In: Ho Y-H, editor."
  },
  {
    "chunk_file": "data/chunks/1-s2.0-S1350453324001371-main_chunk141.txt",
    "text": "Fig. 13. Scaling controller logic flow chart."
  },
  {
    "chunk_file": "data/chunks/286_chunk39.txt",
    "text": "1 it will be seen that the tumors that are the device s target are typically less than approximately 100mm in length along the axis of the spinal column. Therefore it was decided that the surgical cutting tool (T) need access a section of the vertebral cavity only approximately 120mm in length, rather than the full 700mm or so."
  },
  {
    "chunk_file": "data/chunks/JMRR-D-20-00004_R2_chunk63.txt",
    "text": "However, for the many potential applications where a form- changing space frame structure might be used, both tension and compression forces occur within the struts. Hence both types of loads must be resolved by the nodal connections. 3.2."
  },
  {
    "chunk_file": "data/chunks/286_chunk11.txt",
    "text": "1. non-reachable cancerous tissue (red) on the anterior side of the spinal column (left) [1], and photographs of the actual surgery taken as a part of this study. through the mouth or front part of the neck; however this entails additional (typically unacceptable) risk for the patient and is extremely challenging for the surgeon."
  },
  {
    "chunk_file": "data/chunks/1-s2.0-S1350453324001371-main_chunk182.txt",
    "text": "[31] Bethea BT, Okamura AM, Kitagawa M, Fitton TP, Cattaneo SM, Gott VL, Baumgartner WA, Yuh DD. Application of haptic feedback to robotic surgery. J Laparoendosc Adv Surg Tech A 2004;14:191 5. https://doi.org/10.1089/ 1092642041255441."
  },
  {
    "chunk_file": "data/chunks/JMRR-D-20-00004_R2_chunk77.txt",
    "text": "Nylon 66 (a type of polyamide) was chosen in prototypes due to its balance between reasonable resistance to bending forces, low friction properties and good resistance to impact loading; it was accepted that relatively minor deformations of the nylon tips would add to the joint s overall robustness, with only a negligible effect on the joint s overall concentricity within the frame."
  },
  {
    "chunk_file": "data/chunks/JMRR-D-20-00004_R2_chunk146.txt",
    "text": "This block contains sensors that sense the position of the X, Y, and Z coordinates of the end effector. Fig.16: The configuration of a 3-3 robot platform. (A) Isometric view and (B) plan view show the attachment points of the six links to the fixed top (B) and to the moving platform (P)."
  },
  {
    "chunk_file": "data/chunks/pone.0047133_chunk28.txt",
    "text": "The streamwise flow velocity in the jet is typically around 1ms{1, which gives a skin friction coefficient due to the action of aerodynamic drag on the fluid stream of around 0.012 (assuming a laminar air boundary-layer at a Reynolds number based on L of 3000)."
  },
  {
    "chunk_file": "data/chunks/JMRR-D-20-00004_R2_chunk152.txt",
    "text": "The high accuracy and stability of a parallel robot performing in a small workspace led to it being designed, manufactured, and integrated into our flexible surgical device, as it is the most suitable robot for our surgical application."
  },
  {
    "chunk_file": "data/chunks/pone.0047133_chunk14.txt",
    "text": "In the present study we develop computational fluid dynamics modelling to explain for the first time, the characteristic wavelike shape of the urine stream and its relationship to flow rate and the size and shape of the urethral meatus."
  },
  {
    "chunk_file": "data/chunks/JMRR-D-20-00004_R2_chunk185.txt",
    "text": "[15] P. Harkin, R. Vaidyanathan, S. Morad, Concentric Joint Connectors for Form-Changing Space Frames, in Proc. 7th Int. Conf."
  },
  {
    "chunk_file": "data/chunks/1-s2.0-S1350453324001371-main_chunk75.txt",
    "text": "In addition, it computes feedback force whose magnitude is proportional to the severity of the constraint exceeded."
  },
  {
    "chunk_file": "data/chunks/CASE15_0460_MS_chunk7.txt",
    "text": "However, there is a risk of the jet cutting through the target tissue and then going on to hit the underlying tissues and damaging them. The initially use of water jet technology was in the mid- 1880s with hydraulic mining in which the collection of water from a stream was used to carry the coal out of the working surface of mine [1]."
  },
  {
    "chunk_file": "data/chunks/1-s2.0-S1350453324001371-main_chunk61.txt",
    "text": "2.3. Inverse kinematics The input controller specifies the position of the end-effector in the positional control loop. In this scenario, the user specifies the orientation and position of the flexible probe in 6DOF."
  },
  {
    "chunk_file": "data/chunks/JMRR-D-20-00004_R2_chunk191.txt",
    "text": "in Proc. IEEE Int. Conf."
  },
  {
    "chunk_file": "data/chunks/pone.0047133_chunk132.txt",
    "text": "Neurourology and Urodynamics 25: 632 633. 23. Boci R, Fall M, Walden M, Knutson T, Dahlstrand C (1999) Home uroflowmetry: improved accuracy in outflow assessment."
  },
  {
    "chunk_file": "data/chunks/1-s2.0-S1350453324001371-main_chunk49.txt",
    "text": "In this study, six extensible legs were controlled by direct current (DC) motors to move an articulating surgical probe in 6DOF: three linear movements (latitude, longitudinal and vertical) and three rotations (pitch  , roll   and yaw  )."
  },
  {
    "chunk_file": "data/chunks/pone.0047133_chunk126.txt",
    "text": "Wiygul J, Babayan RK (2009) Watchful waiting in benign prostatic hyperplasia. Current Opinion in Urology 19: 3 6. 18."
  },
  {
    "chunk_file": "data/chunks/Concentric joint connectors for form-changing space frames AM_chunk52.txt",
    "text": "Due to the ends of the struts not being joined rigidly to each other, but only pulled in- to contact with each other by the flexible cord, they can effectively pivot relative to each other, giving 3 DOF. Figure 10 shows a cross-section view through the joint configuration."
  },
  {
    "chunk_file": "data/chunks/Concentric joint connectors for form-changing space frames AM_chunk46.txt",
    "text": "For the example shown in Figure 2, the frame s struts join together at their ends via their connection to solid blocks, which are typically spherical in form."
  },
  {
    "chunk_file": "data/chunks/CASE15_0460_MS_chunk16.txt",
    "text": "This paper presents a working positional control that incorporates haptic technology structure that adopted for the first time in a flexible robotic device system for spinal surgery. The flexible robot system was developed by the authors[14] to be used in the removal of cancerous tumors surrounding the spinal column."
  },
  {
    "chunk_file": "data/chunks/286_chunk1.txt",
    "text": "This paper summarizes the development of a flexible robotic surgical system to be used in minimally invasive spinal surgery (MISS), targeting the removal of cancerous tissue. The cutting system consists of a flexible drill and a water-jet cutter which may be used interchangeably; each capable of bending around the spinal column for tissue removal."
  },
  {
    "chunk_file": "data/chunks/Concentric joint connectors for form-changing space frames AM_chunk85.txt",
    "text": "Boca Ra- ton: CRC Press LLC Morad, S. et al 2014. Flexible robotic device for spinal surgery In: IEEE International Conference on Robotics and Biomi- metics Bali, Indonesia: IEEE. View publication stats View publication stats"
  },
  {
    "chunk_file": "data/chunks/Concentric joint connectors for form-changing space frames AM_chunk84.txt",
    "text": "1999. Space Frame Structures. In Chen Wai-Fah (ed), Structural Engineering Handbook: 13.1.4."
  },
  {
    "chunk_file": "data/chunks/286_chunk0.txt",
    "text": "Abstract  The present generation of surgical tools is reliant on drills and cutting tools that cannot navigate through small corners present in complex bones such as the spinal column."
  },
  {
    "chunk_file": "data/chunks/CASE15_0460_MS_chunk17.txt",
    "text": "The flexible surgical tool is comprises of two units: a flexible probe and a water jet cutting device. These two integrated units is then mounted on a six degrees of freedom (6DoFs) parallel manipulator, designed by the authors [14] , completing the surgical robot system."
  },
  {
    "chunk_file": "data/chunks/Concentric joint connectors for form-changing space frames AM_chunk47.txt",
    "text": "For commercially-available rigid space frames, the spheres act as a convenient method of joining the struts together, thus extending the mate- rial structure of each strut towards the node point, where the tension/compression forces are transmit- ted to the conjoining struts."
  },
  {
    "chunk_file": "data/chunks/Concentric joint connectors for form-changing space frames AM_chunk53.txt",
    "text": "This shows the ends of the struts (S) as tubular forms, with collars (CL) inserted in their ends, which in turn have lengths of cords (C) passing through them. The cords are knotted at their ends (KN) to prevent them passing through the col- lars, and are entwined with other cords to retain the strut ends. Figure 10."
  },
  {
    "chunk_file": "data/chunks/pone.0047133_chunk127.txt",
    "text": "Neal DE (1997) Watchful waiting or drug therapy for benign prostatic hyperplasia? Lancet 350: 305 306. 19."
  },
  {
    "chunk_file": "data/chunks/pone.0047133_chunk133.txt",
    "text": "Neurourol Urodyn 18: 25 32. 24. Golomb J, Lindner A, Siegel Y, Korczak D (1992) Variability and circadian changes in home uroflowmetry in patients with benign prostatic hyperplasia compared to normal controls."
  },
  {
    "chunk_file": "data/chunks/1-s2.0-S1350453324001371-main_chunk48.txt",
    "text": "Medical Engineering and Physics 132 (2024) 104236 2 2. Control system 2.1. System definition The SRP has six prismatic actuators that actuate an end-effector independently and separately."
  },
  {
    "chunk_file": "data/chunks/1-s2.0-S1350453324001371-main_chunk60.txt",
    "text": "In Fig. 3, the electronics used as well as the associated software that implements full control of the position of the platform are shown. The figure clearly illustrates how the electronic components are connected, powered and controlled from the input side to the output side."
  },
  {
    "chunk_file": "data/chunks/CASE15_0460_MS_chunk6.txt",
    "text": "In general, Water-jet technology does not damage the surrounding tissues during the cut because it reaches only a low temperature; it enables high-precision cutting, leaves a clean cut as it instantly flushes out the debris, and decreases bleeding at surgery."
  },
  {
    "chunk_file": "data/chunks/JMRR-D-20-00004_R2_chunk190.txt",
    "text": "[18] P. Harkin, Adjustable Structures, W. PCT, Editor 2014: UK. p. 34. [19] S. Morad, C. Ulbricht, P. Harkin, J. Chan, K. Parker and R. Vaidyanathan, Modelling and control of a water jet cutting probe for flexible surgical robot."
  },
  {
    "chunk_file": "data/chunks/JMRR-D-20-00004_R2_chunk184.txt",
    "text": "[13] A. G. Bell, Tetrahedral Principle in Kite Structure, National Geographic Magazine. 14(6) 1903. [14] T. T. Lan, Space Frame Structures, In Structural Engineering Handbook (CRC, Boca Raton, 1999)."
  },
  {
    "chunk_file": "data/chunks/1-s2.0-S1350453324001371-main_chunk74.txt",
    "text": "Medical Engineering and Physics 132 (2024) 104236 4 (CC) monitors the state of the system and only activates when the system approaches the boundaries of a forbidden region. By modifying unom and generating a corrected control signal (ucor), the CC prevents the system from entering the forbidden area."
  },
  {
    "chunk_file": "data/chunks/pone.0047133_chunk15.txt",
    "text": "In so doing we identify two novel diagnostic parameters which can be derived from simple non- invasive visual inspection of the flow stream. These parameters are then examined with both healthy volunteers and a clinically relevant patient cohort."
  },
  {
    "chunk_file": "data/chunks/pone.0047133_chunk29.txt",
    "text": "This gives a surface shear of around 0:0072Pa, which can be compared to the pressure due to surface tension which will typically be around 100Pa. For this investigation the aerodynamic drag forces could reasonably be neglected as being several orders of magnitude less than the surface tension forces."
  },
  {
    "chunk_file": "data/chunks/JMRR-D-20-00004_R2_chunk153.txt",
    "text": "For the parallel robot mobile platform, aspects of the earlier configuration of a form-changing space frame were adapted and simplified, to create a parallel platform with a fixed top and mobile base, connected via six extendable legs."
  },
  {
    "chunk_file": "data/chunks/JMRR-D-20-00004_R2_chunk147.txt",
    "text": "(2) Samir Morad, Christian Ulbricht, Paul Harkin, Justin Chan, Kim Parker, Ravi Vaidyanathan 12 Figure 18-A shows the x, y, and z values of the position of the body block representing the end effector moving over time as the model simulates."
  },
  {
    "chunk_file": "data/chunks/286_chunk10.txt",
    "text": "K. Parker is with the Department of Bioengineering, Imperial College, London, south Kensington, (k.parker@imperial.ac.uk). P. Harkin is with Form Changing Structures, Lincolnshire, UK (paul.harkin@formchangingstructures.com). C. Ulbricht is with Charing Cross Hospital, London, UK (Christian.Ulbricht@imperial.nhs.uk) Fig."
  },
  {
    "chunk_file": "data/chunks/JMRR-D-20-00004_R2_chunk76.txt",
    "text": "As the tips of the struts are in moving contact with one another, the extremities of struts have been formed as relatively short tubular barrels of a low-friction bearing material (BN)."
  },
  {
    "chunk_file": "data/chunks/1-s2.0-S1350453324001371-main_chunk183.txt",
    "text": "S. Morad et al. Medical Engineering and Physics 132 (2024) 104236 10"
  },
  {
    "chunk_file": "data/chunks/JMRR-D-20-00004_R2_chunk62.txt",
    "text": "Tension structures For the resolution of purely tension loads, multi-link concentric joints that can resolve tension forces, but not compression, have been in common use for millennia one example being those within a structure woven from flexible fibers or cords, such as a fishing net."
  },
  {
    "chunk_file": "data/chunks/286_chunk38.txt",
    "text": "The Design of the Mechanical System With reference to Fig. 7, the vertebral cavity (VC) containing the spinal column of a typical prone adult patient (P) has a cross-sectional area of very approximately 60mm width and 80mm height, and an average length of approximately 700mm. However, with reference to Fig."
  },
  {
    "chunk_file": "data/chunks/1-s2.0-S1350453324001371-main_chunk140.txt",
    "text": "12. Graph of percentage error of rotation against encoder pulses for different motor speeds. (For interpretation of the references to color in this figure legend, the reader is referred to the web version of this article.)"
  },
  {
    "chunk_file": "data/chunks/1-s2.0-S1350453324001371-main_chunk154.txt",
    "text": "[3] Chand M, Bhoday J, Brown G, Moran B, Parvaiz A. Laparoscopic surgery for rectal cancer. J R Soc Med 2012;105:429 35. https://doi.org/10.1258/ jrsm.2012.120070. [4] Aly EH."
  },
  {
    "chunk_file": "data/chunks/JMRR-D-20-00004_R2_chunk89.txt",
    "text": "Overview According to the surgical requirements set by our collaborator surgeon, it is necessary that the surgical cutting tool (T) be positioned and moved around the dorsal parts (e.g. the vertebral cavity VC) of patient (P), who would be lying face-down during the surgical procedure (Fig. 9)."
  },
  {
    "chunk_file": "data/chunks/1-s2.0-S1350453324001371-main_chunk168.txt",
    "text": "[16] Morad S, Jaffer Z, Dogramadzi S. A novel mechanical design of a wearable fingertip haptic device for remote meniscus palpation. J Med Robot Res 2023;08:2350001. https://doi.org/10.1142/S2424905x23500010. [17] Zhu X, Gao B, Zhong Y, Gu C, Choi KS."
  },
  {
    "chunk_file": "data/chunks/1-s2.0-S1350453324001371-main_chunk142.txt",
    "text": "Position and orientation information from the user interface (P) will be scaled down by the scaling controller before entering the nominal controller. S. Morad et al. Medical Engineering and Physics 132 (2024) 104236 9 order of 10 4 m. It is therefore acceptable to run the motor at maximum speed."
  },
  {
    "chunk_file": "data/chunks/1-s2.0-S1350453324001371-main_chunk156.txt",
    "text": "Contemporary issues in colorectal surgical practice. Rijeka: InTech; 2012. p. 57 72. https://doi.org/10.5772/33501. [5] Hannaford B, Okamura AM."
  },
  {
    "chunk_file": "data/chunks/JMRR-D-20-00004_R2_chunk48.txt",
    "text": "Mechanisms for concentric joints Most hexapod robots are not truly octahedral in their form, due to the layout of the joints at their vertices. The connections between the struts and the rigid plates are via joints with 2DoF, in the form of revolute/hinge joints."
  },
  {
    "chunk_file": "data/chunks/1-s2.0-S1350453324001371-main_chunk181.txt",
    "text": "[30] Block DJ, Michelotti MB, Sreenivas RS. Application of the Novint Falcon haptic device as an actuator in real-time control. J Behav Robot 2013;4:182 93. https:// doi.org/10.2478/pjbr-2013-0017."
  },
  {
    "chunk_file": "data/chunks/JMRR-D-20-00004_R2_chunk74.txt",
    "text": "This shows the ends of the struts (S) as tubular forms, with collars (CL) inserted in their ends, which in turn have lengths of cords (C) passing through them. The cords are knotted at their ends (KN) to prevent them passing through the collars, and are entwined with other cords to retain the strut ends. 3.4."
  },
  {
    "chunk_file": "data/chunks/286_chunk12.txt",
    "text": "In this paper, a flexible surgical tool capable of going around the spinal column for removal of tissue on both the anterior and posterior sides of the spinal column is presented."
  },
  {
    "chunk_file": "data/chunks/JMRR-D-20-00004_R2_chunk60.txt",
    "text": "However, both examples in [16] and [17] use relatively bulky and complex mechanisms, with many moving parts. Instead, a concentric joint design was sought that was simple, compact, robust, and used few, if any, moving parts."
  },
  {
    "chunk_file": "data/chunks/JMRR-D-20-00004_R2_chunk151.txt",
    "text": "Hence, implementing a robot was vital to ensure the surgical task was performed safely by increasing the stability, and therefore the accuracy of the tool, especially as it was moving. Within the different robot structures, there are also advantages and disadvantages that determine the suitability of a certain robot structure for a particular task."
  },
  {
    "chunk_file": "data/chunks/JMRR-D-20-00004_R2_chunk145.txt",
    "text": "The preliminary validation of the design of the platform was performed by simulating the model system. The output data on the behaviour of the platform system was obtained graphically and numerically and displayed in the MATLAB workspace via a position sensor block."
  },
  {
    "chunk_file": "data/chunks/pone.0047133_chunk17.txt",
    "text": "Modelling non-axisymmetric jets When a liquid jet issues from a non-cylindrical aperture, the jet formed tends to undergo large deformations under the action of surface tension. For instance, for a jet issuing from an elliptic aperture, the flow pattern is similar to that shown in Fig. 1."
  },
  {
    "chunk_file": "data/chunks/1-s2.0-S1350453324001371-main_chunk89.txt",
    "text": "From this, the direction of the force vector depends on which of the four quadrants the robot is in, so as to act to force the user inwards towards the centre of the cylinder. By inverting the constraint set, the constraint controller will keep the robot outside the boundaries. 3.2."
  },
  {
    "chunk_file": "data/chunks/JMRR-D-20-00004_R2_chunk179.txt",
    "text": "Electron Devices. 11(1) (1967) 34 39. [9] S. Najarian, and E. Afshari, Evolutions and Future Directions of Surgical Robotics: A Review, Int."
  },
  {
    "chunk_file": "data/chunks/pone.0047133_chunk119.txt",
    "text": "Journal of Fluid Mechanics 262: 205 221. 11. Lin SP, Reitz RD (1998) Drop and spray formation from a liquid jet."
  },
  {
    "chunk_file": "data/chunks/JMRR-D-20-00004_R2_chunk192.txt",
    "text": "Automation Science and Engineering (Gothenburg, Sweden, 2015), pp. 1159- 1164. [20] Z. Shao, X. Tang, and L. Wang, Optimum Design of 3-3 Stewart Platform Considering Inertia Property."
  },
  {
    "chunk_file": "data/chunks/CASE15_0460_MS_chunk4.txt",
    "text": "Results show promise for implementation of water jet cutting for robot surgical spinal procedures. I. INTRODUCTION A."
  },
  {
    "chunk_file": "data/chunks/1-s2.0-S1350453324001371-main_chunk62.txt",
    "text": "To impose the desired end- effector orientation on the robot platform, each of the six legs of the platform needs to be calculated to be the required length. In their paper [28], the authors introduce the full details of the robot platform s ki  nematics, and they formulate the inverse kinematic relationships for a 3 3 surgical robot platform. 2.4."
  },
  {
    "chunk_file": "data/chunks/1-s2.0-S1350453324001371-main_chunk76.txt",
    "text": "In addition to determining the appropriate direction of force inser  tion, the CC also decides in which direction this force should be applied, which is in the opposite direction of the direction of error, normal to the boundary at which the constraint is applied."
  },
  {
    "chunk_file": "data/chunks/JMRR-D-20-00004_R2_chunk186.txt",
    "text": "Structural Engineering, Mechanics and Computation (Cape Town, South Africa, 2019) pp. 977-982. [16] P. Bosscher and I. Ebert-Uphoff, A Novel Mechanism for Implementing Multiple Collocated Spherical Joints, in Proc."
  },
  {
    "chunk_file": "data/chunks/pone.0047133_chunk125.txt",
    "text": "(2004) Repeat urethrotomy and dilation for the treatment of urethral stricture are neither clinically effective nor cost-effective. Journal of Urology 172: 275 277. 17."
  },
  {
    "chunk_file": "data/chunks/Concentric joint connectors for form-changing space frames AM_chunk9.txt",
    "text": "Several applications of form-changing structural frames are noted, to demon- strate the advantages of using such joint connectors in these frames; one is a variable-geometry mount for a surgical device, for Imperial College London."
  },
  {
    "chunk_file": "data/chunks/pone.0047133_chunk131.txt",
    "text": "22. Caffarel J, Robson W, Pickard R, Newton D, Griffiths C, et al. (2006) Home uroflow device: Basic but more accurate than standard in-clinic uroflowmetry?"
  },
  {
    "chunk_file": "data/chunks/Concentric joint connectors for form-changing space frames AM_chunk45.txt",
    "text": "The key insight was to re-examine the joints within rigid space frame structures, and understand how these resisted compressive forces, and then see if the principles could be combined with the efficiency and simplicity of the tension cords."
  },
  {
    "chunk_file": "data/chunks/CASE15_0460_MS_chunk29.txt",
    "text": "HAPTIC MODELLING In this section, two forms of haptic technology were explored, haptic rendering of rigid surfaces and trajectory supervision."
  },
  {
    "chunk_file": "data/chunks/Concentric joint connectors for form-changing space frames AM_chunk51.txt",
    "text": "A compressive load, pushing along the axis of the strut, would, as above, be in- duced to push the end of the strut through and then past the ends of the other struts, but the cord would prevent it from doing so. When the strut is subject to a tension force, the cord would resist this by itself going into tension."
  },
  {
    "chunk_file": "data/chunks/Concentric joint connectors for form-changing space frames AM_chunk79.txt",
    "text": "Figure 13. Tapering Cord Joints as part of a prototype octahe- dral-frame (left) and a prototype surgical platform (right) 6 REFERENCES Bell, A.G. 1903. Tetrahedral Principle in Kite Structure."
  },
  {
    "chunk_file": "data/chunks/CASE15_0460_MS_chunk15.txt",
    "text": "Active constraint is based on three zone constraints, save, transition, and forbidden zone. This method were first used for a prostatectomy resection and was first clinically applied in 1991 [13]. This  mechanical  constraint was further developed to provide accuracy and motion constraint for orthopedic knee replacement surgery."
  },
  {
    "chunk_file": "data/chunks/286_chunk2.txt",
    "text": "A robot platform has been designed and fabricated that acts as a mount for the cutting system, and produces the desired range of movements. A graphical user interface (GUI) has been created to analyze the working envelope of the platform and provide an interface for control by a surgeon."
  },
  {
    "chunk_file": "data/chunks/JMRR-D-20-00004_R2_chunk9.txt",
    "text": "In critical cases, the surgeon may attempt to remove additional tumor growth by entering through the mouth or front part of the neck; however, this involves additional risk for the patient and is extremely challenging for the surgeon."
  },
  {
    "chunk_file": "data/chunks/JMRR-D-20-00004_R2_chunk8.txt",
    "text": "Non-malignant spinal tumors can grow to a considerable size, causing damage by putting pressure on the tissue around them [2]. Surgical options for the treatment of spinal tumors vary from complete to partial removal. This may be done by a surgical approach from the front or back of the spine and may involve going through the neck, chest or abdomen."
  },
  {
    "chunk_file": "data/chunks/286_chunk3.txt",
    "text": "Experimental testing shows that prototypes of both the drill and water jet cutter are able to go around angles up to 120  and remove soft tissues off the bone. The developed systems could be used to remove cancerous tumors surrounding the spinal column in MISS procedures. I."
  },
  {
    "chunk_file": "data/chunks/Concentric joint connectors for form-changing space frames AM_chunk78.txt",
    "text": "It is hoped that they be developed further as key components of multi-strut form-changing space frame structures in the future. The Tapering Cord Joint design is the subject of a WIPO patent application (ref. WO2014006422)."
  },
  {
    "chunk_file": "data/chunks/CASE15_0460_MS_chunk14.txt",
    "text": "However, the absence of feedback eliminates tactile cues, masks force cues and, in some cases, leads to an increase in intra-operative injury [12]. Haptic feedback, which is generally defined as simulated touch interactions between robots, humans, real, remote, or simulated environments, seeks to eliminate this problem."
  },
  {
    "chunk_file": "data/chunks/Concentric joint connectors for form-changing space frames AM_chunk50.txt",
    "text": "4.3 Use of cords to tie struts together But what if the joining by bonding of the strut ends could be done via the flexible cords of the net structure, passing through the ends of the struts, and entwining with other cords from other struts, thus ty- ing the ends together?"
  },
  {
    "chunk_file": "data/chunks/Concentric joint connectors for form-changing space frames AM_chunk44.txt",
    "text": "4.2 Resolving tension and compression forces A way was sought to utilise the simplicity and ef- ficiency of a tension-based network comprised en- tirely of flexible cords, yet also have it resist com- pressive forces."
  },
  {
    "chunk_file": "data/chunks/CASE15_0460_MS_chunk28.txt",
    "text": "Details of the layout of the electronics used, along with the associated program code that implements full positional control of the platform, are presented in S. Morad et al. [14]. III."
  },
  {
    "chunk_file": "data/chunks/Concentric joint connectors for form-changing space frames AM_chunk8.txt",
    "text": "The design evolved from an analysis of simple, pure-tension net structures, combined with aspects of rigid space frame structures, to resist compressive forces. Existing joint configurations are analyzed and compared to the novel joint."
  },
  {
    "chunk_file": "data/chunks/pone.0047133_chunk130.txt",
    "text": "21. Reynard JM, Peters TJ, Lim C, Abrams P (1996) The value of multiple free-flow studies in men with lower urinary tract symptoms. British Journal of Urology 77: 813 818."
  },
  {
    "chunk_file": "data/chunks/pone.0047133_chunk124.txt",
    "text": "Journal of Urology 157: 98 101. 16. Greenwell TJ, Castle C, Andrich DE, MacDonald JT, Nicol DL, et al."
  },
  {
    "chunk_file": "data/chunks/1-s2.0-S1350453324001371-main_chunk77.txt",
    "text": "The force vector f is then sent to the haptic device to provide corrective kinaesthetic haptic feedback to the user. A closed-loop feedback control structure of the NC and CC monitors the real-time state of the system, in this case, the orientation of the robot platform. 3.1.2."
  },
  {
    "chunk_file": "data/chunks/JMRR-D-20-00004_R2_chunk187.txt",
    "text": "Int. Conf. Robotics and Automation (Taipei, Taiwan, 2003), pp."
  },
  {
    "chunk_file": "data/chunks/JMRR-D-20-00004_R2_chunk193.txt",
    "text": "Advances in Mechanical Engineering, 2013 (2013) 1-10. [21] Z. Bingul and O. Karahan, Dynamic Modeling and Simulation of Stewart Platform, in Serial and Parallel Robot Manipulators - Kinematics, Dynamics, Control and Optimization (InTech, Rijeka, 2012), pp. 19-42."
  },
  {
    "chunk_file": "data/chunks/pone.0047133_chunk118.txt",
    "text": "Reports on Progress in Physics 71: 1 79. 10. Eggers J, Dupont TF (1994) Drop formation in a one-dimensional approxima- tion of the navierstokes equation."
  },
  {
    "chunk_file": "data/chunks/1-s2.0-S1350453324001371-main_chunk63.txt",
    "text": "Simulation As a validation of the inverse kinematics derived in [28], a MATLAB simulation was created of a robot model receiving inputs from an NF to model the movement of a 6DOF model."
  },
  {
    "chunk_file": "data/chunks/CASE15_0460_MS_chunk5.txt",
    "text": "Water jet cutting systems High-pressure water jets are classified into two main types: pure water jets (PWJ) and abrasive water jets (AWJ). The basic difference between these two types is the addition of an abrasive medium in AWJ to increase the cutting ability of the water jet."
  },
  {
    "chunk_file": "data/chunks/1-s2.0-S1350453324001371-main_chunk88.txt",
    "text": "Medical Engineering and Physics 132 (2024) 104236 5 r =   x2 + y2   (3)   = tan 1(y x ) (4) Table 2 present the constraints of the cylinder, including LB and UB of the Cartesian coordinates (x, y and z)."
  },
  {
    "chunk_file": "data/chunks/JMRR-D-20-00004_R2_chunk178.txt",
    "text": "Cappel,  Motion Simulator , US Patent No. 3,295,224, 3 Jan 1967. [8] J. U. Duncombe, Infrared navigation Part I: An assessment of feasibility, IEEE Trans."
  },
  {
    "chunk_file": "data/chunks/pone.0047133_chunk16.txt",
    "text": "Computational Methods For the computational simulations of the urine stream we make use of a novel method which replicates the jet shape from an orifice by simulating the unsteady development of a 2-dimensional droplet deforming under the action of surface tension. This model is described next."
  },
  {
    "chunk_file": "data/chunks/JMRR-D-20-00004_R2_chunk144.txt",
    "text": "The platform provides a large amount of rigidity, or stiffness, for a given structural mass, and thus provides significant positional certainty. In this section, the behavior of the platform is demonstrated using Simulink, with SimMechanics to model the mechanical components of the system. Figure 17 shows the complete platform model."
  },
  {
    "chunk_file": "data/chunks/JMRR-D-20-00004_R2_chunk150.txt",
    "text": "Because of the  powered  nature of our flexible surgical tool (to be introduced in a separate paper), by means of either mechanical drill or a fluid high-pressure pump, the handheld use of the tool is prone to vibration and fluid impact force. Consequently, this leads to control difficulties during critical operation procedures."
  },
  {
    "chunk_file": "data/chunks/JMRR-D-20-00004_R2_chunk61.txt",
    "text": "To still achieve the same mechanical goals, but offering a simpler, more compact joint configuration, the novel Concentric Connector Joint was used in the design of the surgical robotic framework, originally developed by the authors for use in prototypes of form-changing space frame structures [15][18]. 3. Path Towards A Solution 3.1."
  },
  {
    "chunk_file": "data/chunks/JMRR-D-20-00004_R2_chunk75.txt",
    "text": "Refinements to the design This crude arrangement would function as a 3DoF joint for 3 or more struts, but there are some important refinements that can be made to greatly improve the joint s performance, shown in Figure 8-A and 8-B."
  },
  {
    "chunk_file": "data/chunks/1-s2.0-S1350453324001371-main_chunk180.txt",
    "text": "[29] Morad S. Flexible robotic device for spinal surgery. London, UK: Imperial College London; 2015. https://doi.org/10.25560/26878. PhD thesis."
  },
  {
    "chunk_file": "data/chunks/286_chunk13.txt",
    "text": "The tool is designed such that it may integrate with a robot system and would allow the removal of tumor growth in front of the spinal column without the need for additional invasive entry; thus risk to the patient would be much-reduced. Two alternative methods of cutting were applied: pressurized water-jet and mechanical drilling."
  },
  {
    "chunk_file": "data/chunks/JMRR-D-20-00004_R2_chunk49.txt",
    "text": "Typically, however, these joints are configured so that each strut has a separate connection to one of the rigid plates (Fig.5A), rather than being concentric with the end of the adjacent strut (Fig.5B)."
  },
  {
    "chunk_file": "data/chunks/1-s2.0-S1350453324001371-main_chunk157.txt",
    "text": "Haptics. In: Siciliano B, Khatib O, editors. Springer handbook of robotics."
  },
  {
    "chunk_file": "data/chunks/1-s2.0-S1350453324001371-main_chunk143.txt",
    "text": "For extending and retracting its legs, the robotic platform was equipped with DC geared motors. Despite being inexpensive, DC motors cannot instantly adjust the length of the legs. As a result, tracking the trajectory was particularly difficult."
  },
  {
    "chunk_file": "data/chunks/1-s2.0-S1350453324001371-main_chunk147.txt",
    "text": "A surgical robot s position control is integrated with constraint control and inverse kinematics, resulting in haptic feedback control. We developed a computer simulation model in MATLAB and validated the inverse kinematic equations based on it."
  },
  {
    "chunk_file": "data/chunks/1-s2.0-S1350453324001371-main_chunk153.txt",
    "text": "[2] Okamura AM. Haptic feedback in robot-assisted minimally invasive surgery. Curr Opin Urol 2009;19:102 7. https://doi.org/10.1097/MOU.0b013e32831a478c."
  },
  {
    "chunk_file": "data/chunks/286_chunk17.txt",
    "text": "Schematic of water jet device [7]. Flexible surgical robotic device for spinal surgery Samir Morad Student Member IEEE, Christian Ulbricht, Paul Harkin, Justin Chan, Kim Parker, Ravi Vaidyanathan, Member IEEE Surgical drills are an essential tool in orthopedic surgery."
  },
  {
    "chunk_file": "data/chunks/JMRR-D-20-00004_R2_chunk71.txt",
    "text": "A compressive load, pushing along the axis of the strut, would, as above, be induced to push the end of the strut through and then past the ends of the other struts, but the cord would prevent it from doing so. When the strut is subject to a tension force, the cord would resist this by itself going into tension."
  },
  {
    "chunk_file": "data/chunks/JMRR-D-20-00004_R2_chunk65.txt",
    "text": "The key insight was to re- examine the joints within rigid space frame structures, and understand how these resisted compressive forces, and then see if the principles could be combined with the efficiency and simplicity of the tension cords."
  },
  {
    "chunk_file": "data/chunks/JMRR-D-20-00004_R2_chunk59.txt",
    "text": "To simplify the kinematics, the joint configuration proposed by both Bosscher/Ebert-Uphoff and Hamlin allow more than two moving components to be pivotally connected with concentricity. Thus, they seem to solve the problem of a joint at the node points of a parallel robotic framework."
  },
  {
    "chunk_file": "data/chunks/pone.0047133_chunk12.txt",
    "text": "Liquid jet flows have received significant attention in the published literature, and there has been a substantial amount of work which has elucidated the surface-tension driven effects which develop in these flows (a thorough review can be found in [9]). Short wavelength capillary instabilities can often lead to break-up of a liquid column [10 12]."
  },
  {
    "chunk_file": "data/chunks/1-s2.0-S1350453324001371-main_chunk98.txt",
    "text": "The constraint controller becomes active at the boundaries of the constraint region, generating forces that keep the system within pre-defined boundaries. Fig. 7."
  },
  {
    "chunk_file": "data/chunks/JMRR-D-20-00004_R2_chunk168.txt",
    "text": "The joints have near-perfect concentricity of rotation around the node point, which enables the tension and compression forces of the struts to be resolved in a structurally-efficient manner."
  },
  {
    "chunk_file": "data/chunks/JMRR-D-20-00004_R2_chunk154.txt",
    "text": "The re- designing process has simplified the structure so it would be more appropriate for use in an operating theatre and can be controlled remotely."
  },
  {
    "chunk_file": "data/chunks/JMRR-D-20-00004_R2_chunk140.txt",
    "text": "Symbol Physical description   Rotation about X-axis   Rotation about Y-axis   Rotation about Z-axis   Rotational matrix   Attachment point of leg i in the top plate   Position of the top plate relative to the base plate   Attachment point of leg i in the base plate   Nominal length of leg i (A) (B) Fig. 15."
  },
  {
    "chunk_file": "data/chunks/pone.0047133_chunk120.txt",
    "text": "Annual Review of Fluid Mechanics 30: 85 105. 12. Papageorgiou DT (1995) On the breakup of viscous-liquid threads."
  },
  {
    "chunk_file": "data/chunks/pone.0047133_chunk134.txt",
    "text": "Journal of Urology 147: 1044 1047. The Biophysics of the Urine Stream PLOS ONE | www.plosone.org 7 October 2012 | Volume 7 | Issue 10 | e47133"
  },
  {
    "chunk_file": "data/chunks/1-s2.0-S1350453324001371-main_chunk67.txt",
    "text": "In the draw function, the robot platform figure is continuously updated in real-time as the simulation continues. Regional constraints were implemented by generating force feed  back when an inadmissible position was reached."
  },
  {
    "chunk_file": "data/chunks/CASE15_0460_MS_chunk1.txt",
    "text": "We report the design and experimental testing of a novel flexible robotic surgical system addressing these issues. The robot consists of a flexible probe, a water jet cutting system, and haptic feedback controller. The water jet cutting system consists of a flexible end effector capable of bending around the spinal column for tissue removal."
  },
  {
    "chunk_file": "data/chunks/JMRR-D-20-00004_R2_chunk197.txt",
    "text": "Christian Ulbricht is a Consultant Spinal Neurosurgeon at Imperial College Healthcare NHS Trust and based at Charing Cross Hospital. He qualified from Medical School in Berlin, Germany but moved to the UK in 1995. He completed his neurosurgical training in London and has been a consultant neurosurgeon since 2006."
  },
  {
    "chunk_file": "data/chunks/JMRR-D-20-00004_R2_chunk183.txt",
    "text": "Conf. Robotics and Biomimetics (China, Tianjin, 2010), pp. 1382-1387."
  },
  {
    "chunk_file": "data/chunks/pone.0047133_chunk108.txt",
    "text": "doi:10.1371/journal.pone.0047133.g007 The Biophysics of the Urine Stream PLOS ONE | www.plosone.org 6 October 2012 | Volume 7 | Issue 10 | e47133 MK. Clinical support with patient trial: NB. Computational modelling: AW."
  },
  {
    "chunk_file": "data/chunks/1-s2.0-S1350453324001371-main_chunk73.txt",
    "text": "The component layout of the surgical robot platform (SRP) system. (For interpretation of the references to color in this figure legend, the reader is referred to the web version of this article.) S. Morad et al."
  },
  {
    "chunk_file": "data/chunks/CASE15_0460_MS_chunk10.txt",
    "text": "C. Ulbricht is with Charing Cross Hospital, London, UK (Christian.Ulbricht@imperial.nhs.uk) abrasives into the flow line between the high pressure pump and the acceleration nozzle [1, 2] has rapidly improved the use of water jets and become more common for a growing range of tasks."
  },
  {
    "chunk_file": "data/chunks/Concentric joint connectors for form-changing space frames AM_chunk68.txt",
    "text": "In the prototype joints, the cord cho- sen ( Beta Saltwater Mono 80lb Clear  by Shake- speare Fishing) was a monofilament fishing line of 1.2mm diameter, with a breaking load of 36kg, which also has a sufficient degree of elasticity to al- low the struts to pivot. Testing of the line showed it elongated approx. 1.5mm when supporting a 5kg load."
  },
  {
    "chunk_file": "data/chunks/Concentric joint connectors for form-changing space frames AM_chunk40.txt",
    "text": "Both of the joints shown above project a virtual pivot point (PP) into space outside of its own structure, making this a shared pivot point for all of the convergent struts. However, both of these examples use relatively bulky and complex mechanisms, with many moving parts."
  },
  {
    "chunk_file": "data/chunks/Concentric joint connectors for form-changing space frames AM_chunk54.txt",
    "text": "Cross-section of struts tied together with cords 4.4 Refinements to the design This crude arrangement would function as a 3 DOF joint for 3 or more struts, but there are some im- portant refinements that can be made to greatly im- prove the joint s performance, shown in Figure 11. Figure 11."
  },
  {
    "chunk_file": "data/chunks/CASE15_0460_MS_chunk38.txt",
    "text": "It also computes a force feedback whose magnitude is proportional to the severity of the constraint exceeded. The mathematical equations governing the role of the constraint controller is represents below: where UB and LB are upper and lower boundaries respectively, f is force magnitude, and i is x, y, z. Based on the work done by A. Kapoor, et al."
  },
  {
    "chunk_file": "data/chunks/Concentric joint connectors for form-changing space frames AM_chunk83.txt",
    "text": "Hamlin, G. et al 1994. A Novel Concentric Multilink Spherical Joint with Parallel Robotics Applications Troy, NY, USA: Rensselaer Polytechnic Institute. Lan, T.T."
  },
  {
    "chunk_file": "data/chunks/286_chunk7.txt",
    "text": "This procedure targets the removal of cancerous tumors sitting on top of and around the lumber vertebrae. At present, the surgeon approaches the patient from the back of the body, and the tumor is removed only from the posterior side of the spinal column using the available rigid tools, which are typically hand-held."
  },
  {
    "chunk_file": "data/chunks/286_chunk6.txt",
    "text": "However, these tools cannot navigate around small corners present in complex bones such as the spinal column. The target application for the flexible surgical tool is the removal of cancerous tumors surrounding the spinal column (Fig. 1)."
  },
  {
    "chunk_file": "data/chunks/Concentric joint connectors for form-changing space frames AM_chunk82.txt",
    "text": "Universal tyre test ma- chine. In: Proceedings of the FISITA 9th international technical congress, London: 117 137. London: Institution of Mechanical Engineers."
  },
  {
    "chunk_file": "data/chunks/Concentric joint connectors for form-changing space frames AM_chunk55.txt",
    "text": "Cross-section of tapering cord joint As the tips of the struts are in moving contact with one another, the extremities of struts have been formed as relatively short tubular barrels of a low- friction bearing material (BN)."
  },
  {
    "chunk_file": "data/chunks/CASE15_0460_MS_chunk39.txt",
    "text": "[15] in highlighting basic geometric constraints relevant for constrained control in surgical assistant robots, five main types of constraints were defined. For spherical constraints, as example of one of the geometric constraints, polar coordinates are used to define the system which is natively defined in Cartesian coordinates."
  },
  {
    "chunk_file": "data/chunks/Concentric joint connectors for form-changing space frames AM_chunk41.txt",
    "text": "Instead, a concentric joint design was sought that was simple, compact, robust, and used few, if any, moving parts."
  },
  {
    "chunk_file": "data/chunks/Concentric joint connectors for form-changing space frames AM_chunk69.txt",
    "text": "4.7 Concentricity It is acknowledged that the proposed joint design has less than perfect concentricity of the pivot points of the struts. Figure 12 shows that the actual pivot point (PP) is not at the original convergence point (CP), but closer to the rounded contact point be- tween the barrels (BN) at the ends of the struts."
  },
  {
    "chunk_file": "data/chunks/CASE15_0460_MS_chunk11.txt",
    "text": "The water jet technique was adapted in 1982 for medical application by Papachristou and Barters for the resection of the liver [3, 4]. Since, this technique was further developed and modified to be used in many medical applications such as neurosurgery, renal surgery, and brain surgery [5-9]."
  },
  {
    "chunk_file": "data/chunks/pone.0047133_chunk109.txt",
    "text": "References 1. Schafer W, Abrams P, Liao LM, Mattiasson A, Pesce F, et al. (2002) Good urodynamic practices: Uroflowmetry, filling cystometry, and pressure-flow studies."
  },
  {
    "chunk_file": "data/chunks/JMRR-D-20-00004_R2_chunk182.txt",
    "text": "Du, J. Ma, L.Sun. Development of a Robot System Assisting Artificial Cervical Disc Replacement Surgery, in Proc. Int."
  },
  {
    "chunk_file": "data/chunks/1-s2.0-S1350453324001371-main_chunk72.txt",
    "text": "Inverse kinematics and all necessary calculations are performed by the NC to determine the nom  inal control signals (unom) for the system to achieve the desired position without taking into account any constraints. The constraint controller Fig. 3."
  },
  {
    "chunk_file": "data/chunks/CASE15_0460_MS_chunk0.txt",
    "text": "Abstract surgical removal of cancerous tissue from the spine is limited by the inability for hand held drills and cutters tool to reach small crevices present in complex bones such as the spinal column. The high speed rotating mechanisms used presently, however, incure stability issues for maneuvering through tortous structures."
  },
  {
    "chunk_file": "data/chunks/1-s2.0-S1350453324001371-main_chunk66.txt",
    "text": "In the next script, the GUI is initialized. A menu bar, la  bels, and position values indicating the orientation and location of the end effector are created in the on-screen user interface. Finally, MATLAB reads the input from the NF and performs the inverse kinematics to get the six-leg lengths."
  },
  {
    "chunk_file": "data/chunks/JMRR-D-20-00004_R2_chunk196.txt",
    "text": "From 2015 to 2016 Dr. Morad was a Research Fellow in medical robotics at Bristol Robotics Laboratory. His research interest includes the development of robot assisted flexible surgical intervention, 3D reconstruction and FEA analysis of human tissues."
  },
  {
    "chunk_file": "data/chunks/pone.0047133_chunk121.txt",
    "text": "Physics of Fluids 7: 1529 1544. 13. Rayleigh L (1878) On the instability of jets."
  },
  {
    "chunk_file": "data/chunks/JMRR-D-20-00004_R2_chunk141.txt",
    "text": "Connector joint assemblies, shown in (A) section and (B) side view. (SA) sub-assemblies, (LA) linear actuators, (MB) mobile base, (C) elastic cord, (TM) threaded mechanism, and (HB) hollow barrel."
  },
  {
    "chunk_file": "data/chunks/JMRR-D-20-00004_R2_chunk155.txt",
    "text": "For the concentric connector joint, it is possible that the joint would ultimately fail due to compression loading once the cord elongated to such a degree that the tip of one strut passed beyond that of the others, leading to two eventualities."
  },
  {
    "chunk_file": "data/chunks/1-s2.0-S1350453324001371-main_chunk99.txt",
    "text": "A cylinder with radius r centred about the origin O. Table 2 Constraint set for cylindrical constraint. Axis Region Value x Upper boundary, UBx r   cos   Lower boundary, LBx  r   cos   y Upper boundary, UBy r   sin   Lower boundary, LBy  r   sin   z Upper boundary, UBz z5 Lower boundary, LBz z4 S. Morad et al."
  },
  {
    "chunk_file": "data/chunks/pone.0047133_chunk13.txt",
    "text": "Whilst this may be observed further down in the urine stream, the wavelengths at the start of the stream tend to be much longer than the cross-sectional size of the meatus and thus the urine stream is initially relatively stable."
  },
  {
    "chunk_file": "data/chunks/JMRR-D-20-00004_R2_chunk169.txt",
    "text": "The design evolved from an analysis of simple, pure-tension net structures, combined with aspects of rigid space frame structures, to resist compressive forces. The advantages of using such joint connectors were Fig. 18."
  },
  {
    "chunk_file": "data/chunks/JMRR-D-20-00004_R2_chunk58.txt",
    "text": "For the kinematics that control such a device, measures must be taken to work around this non-concentricity, e.g. the use of more complicated formulae to calculate the geometric form of the device."
  },
  {
    "chunk_file": "data/chunks/JMRR-D-20-00004_R2_chunk64.txt",
    "text": "Resolving tension and compression forces A way was sought to utilize the simplicity and efficiency of a tension-based network comprised entirely of flexible cords, yet also have it resist compressive forces."
  },
  {
    "chunk_file": "data/chunks/286_chunk16.txt",
    "text": "The water reservoir normally contains sterile saline. Fig. 2."
  },
  {
    "chunk_file": "data/chunks/JMRR-D-20-00004_R2_chunk70.txt",
    "text": "Use of cords to tie struts together But what if the joining by bonding of the strut ends could be done via the flexible cords of the net structure, passing through the ends of the struts, and entwining with other cords from other struts, thus tying the ends together?"
  },
  {
    "chunk_file": "data/chunks/1-s2.0-S1350453324001371-main_chunk152.txt",
    "text": "References [1] Walgrave S, Oussedik S. Comparative assessment of current robotic-assisted systems in primary total knee arthroplasty. Bone Jt Open 2023;4:13 8. https://doi. org/10.1302/2633-1462.41."
  },
  {
    "chunk_file": "data/chunks/1-s2.0-S1350453324001371-main_chunk146.txt",
    "text": "6. Conclusion We present the design and development of a working position con  trol structure that integrates haptic technology into the surgical robotic platform on the basis of our previous work on a surgical robotic platform with a concentric connecting joint."
  },
  {
    "chunk_file": "data/chunks/1-s2.0-S1350453324001371-main_chunk150.txt",
    "text": "Declaration of competing interest Authors declare that they have no conflict of interest. Acknowledgements This is a summary of independent research funded by the UK Engi  neering and Physical Sciences Research Council (EPSRC)."
  },
  {
    "chunk_file": "data/chunks/1-s2.0-S1350453324001371-main_chunk144.txt",
    "text": "Trajectory path control is achieved by limiting input speed to a certain level. The system then has sufficient time to respond to the input signals. Due to the slow leg extension caused by DC motors, the threshold was very low."
  },
  {
    "chunk_file": "data/chunks/JMRR-D-20-00004_R2_chunk99.txt",
    "text": "(a) A retractable lower distal tip fully tensioned and fully released. (b) Proximal end with the attachment of tensioning screw. Samir Morad, Christian Ulbricht, Paul Harkin, Justin Chan, Kim Parker, Ravi Vaidyanathan 8 adjustable articulated tip (FE), and an overall length of approximately 250mm."
  },
  {
    "chunk_file": "data/chunks/1-s2.0-S1350453324001371-main_chunk178.txt",
    "text": "[27] Clark L, Shirinzadeh B, Tian Y, Oetomo D. Laser-based sensing, measurement, and misalignment control of coupled linear and angular motion for ultrahigh precision movement. IEEE/ASME Trans Mech 2015;20:84 92. https://doi.org/10.1109/ TMECH.2014.230182414361442."
  },
  {
    "chunk_file": "data/chunks/JMRR-D-20-00004_R2_chunk66.txt",
    "text": "For the example shown in Figure 2-C, the frame s struts join together at their ends via their connection to solid blocks, which are typically spherical in form."
  },
  {
    "chunk_file": "data/chunks/JMRR-D-20-00004_R2_chunk72.txt",
    "text": "Due to the ends of the struts not being joined rigidly to each other, but only pulled into contact Fig.6."
  },
  {
    "chunk_file": "data/chunks/286_chunk14.txt",
    "text": "Pressurized water-jet cutting was originally developed in the steel and glass-forming industries, where ultra-precise cutting was required [3]. This technique was adapted for medical applications [4] and was further developed and modified [5],[6]."
  },
  {
    "chunk_file": "data/chunks/286_chunk28.txt",
    "text": "Generally, water-jet technology does not damage the surrounding tissues during the cutting process, partly as it only reaches a low temperature. It enables high-precision cutting, and leaves a clean cut as it instantly flushes out the debris, and decreases bleeding during surgery [7]."
  },
  {
    "chunk_file": "data/chunks/pone.0047133_chunk11.txt",
    "text": "In this study we show how the shape of the urine stream, which arises due to surface-tension driven capillary-waves that initiate at the meatal opening, contains useful diagnostic information about the urine flow rate and meatal dilation."
  },
  {
    "chunk_file": "data/chunks/pone.0047133_chunk39.txt",
    "text": "At the end of each physical time-step, the edge of the droplet was displaced according to the calculated velocity, and a new computational grid was fitted to the new shape."
  },
  {
    "chunk_file": "data/chunks/JMRR-D-20-00004_R2_chunk143.txt",
    "text": "7. Simulation Results The design of the surgical platform was based on the classic Stewart platform for positioning objects. The platform has an exceptional range of motion and can be accurately and easily positioned and oriented."
  },
  {
    "chunk_file": "data/chunks/JMRR-D-20-00004_R2_chunk157.txt",
    "text": "The second is that the  barrel  tubular form at the end of the strut would be subject to a concentrated bending moment as the cord would still be restrained by the other struts, likely leading to its permanent deformation and/or disintegration."
  },
  {
    "chunk_file": "data/chunks/pone.0047133_chunk123.txt",
    "text": "International Urogynecology Journal 18: 665 669. 15. Steenkamp JW, Heyns CF, deKock MLS (1997) Internal urethrotomy versus dilation as treatment for male urethral strictures: A prospective, randomized comparison."
  },
  {
    "chunk_file": "data/chunks/1-s2.0-S1350453324001371-main_chunk58.txt",
    "text": "S. Morad et al. Medical Engineering and Physics 132 (2024) 104236 3 end effector. The program calculates each leg s target length using inverse kine  matics, using a rotational matrix and positional matrix."
  },
  {
    "chunk_file": "data/chunks/1-s2.0-S1350453324001371-main_chunk70.txt",
    "text": "A set of constraints and bound  aries that are impermissible or inadmissible to the robot are specified. Fig. 5 shows the basic structure of the control loop used for haptic rendering."
  },
  {
    "chunk_file": "data/chunks/JMRR-D-20-00004_R2_chunk180.txt",
    "text": "J. Clin. Med. 3(2) (2012) 75- 82."
  },
  {
    "chunk_file": "data/chunks/JMRR-D-20-00004_R2_chunk194.txt",
    "text": "Samir Morad received the BEng degree in medical engineering from Queen Mary College, University of London, London, UK, in 2010 and the MSc. degree in biomedical engineering from Imperial College London, London, UK, in 2011, and PhD. degree in medical robotics from Imperial College London, London, UK, in 2015."
  },
  {
    "chunk_file": "data/chunks/1-s2.0-S1350453324001371-main_chunk64.txt",
    "text": "The desired position (x, y, z) and orientation ( ,  ,  ) of the end-effector was specified and the nominal leg lengths of each of the six platform s legs were calculated. The leg lengths were plotted in a real-time 3-D model (Fig. 4)."
  },
  {
    "chunk_file": "data/chunks/CASE15_0460_MS_chunk2.txt",
    "text": "A new experimental method of controlling the depth of water jet cut is developed. The haptic feedback controller is based on constraint set approach to define 3D boundary constraints based on five key types of constraints."
  },
  {
    "chunk_file": "data/chunks/CASE15_0460_MS_chunk13.txt",
    "text": "As technology progresses, the field of medical robotics seems more and more promising with lots of work being done towards implementing robots in the surgical theatre [11]. Robot-assisted surgery promises greater dexterity and higher accuracy by eliminating human error and invoking countless other methods of surgery."
  },
  {
    "chunk_file": "data/chunks/Concentric joint connectors for form-changing space frames AM_chunk57.txt",
    "text": "The cord passes through the barrel, emerging to entwine with other cords. A relatively non-brittle material such as nylon is also suitable as it directly contacts the cord and exerts a pressure upon it, e.g. when the strut is subject to a compressive force, it attempts to push past the other barrels and shear the cord."
  },
  {
    "chunk_file": "data/chunks/Concentric joint connectors for form-changing space frames AM_chunk43.txt",
    "text": "However, for the many potential applications where a form-changing space frame structure might be used, both tension and compression forces occur within the struts. Hence both types of loads must be resolved by the nodal connections."
  },
  {
    "chunk_file": "data/chunks/286_chunk4.txt",
    "text": "INTRODUCTION The integration of robotic technologies in surgical instrumentation has contributed to the further development of Minimally Invasive Surgery (MIS), aimed at reducing patient trauma and hospitalization costs [2]."
  },
  {
    "chunk_file": "data/chunks/Concentric joint connectors for form-changing space frames AM_chunk80.txt",
    "text": "In National Geographic Magazine Vol. XIV, No.6. Washing- ton, D.C. USA: National Geographic Magazine Bosscher, P. & Ebert-Uphoff, I."
  },
  {
    "chunk_file": "data/chunks/JMRR-D-20-00004_R2_chunk209.txt",
    "text": "Paul Harkin is the author and co-author of over 5 technical publications. His research interests focus on Adaptive Structures and their applications in various areas of design and engineering. Justin Chan received the MEng degree in Mechanical Engineering from Imperial College London, UK, in 2014."
  },
  {
    "chunk_file": "data/chunks/JMRR-D-20-00004_R2_chunk208.txt",
    "text": "He became a Chartered Member of the Royal Institute of British Architects in 2002. Since then, he has practiced as an Architect in a variety of Building sectors, notably on Airports and Education Buildings. Since 1992, he has also conducted research into Adaptive Space Frame Structures, and holds several related patents."
  },
  {
    "chunk_file": "data/chunks/Concentric joint connectors for form-changing space frames AM_chunk81.txt",
    "text": "2003. A Novel Mechanism for Implementing Multiple Collocated Spherical Joints Geor- gia, USA: Georgia Institute of Technology Gough, V.E. & Whitehall, S.G. 1962."
  },
  {
    "chunk_file": "data/chunks/286_chunk5.txt",
    "text": "The main requirement for such procedures is the ability of surgical tools to reach the operative target through complex anatomical pathways. The present generation of surgical tools is reliant on drills and cutting tools which vary in their principles of operation."
  },
  {
    "chunk_file": "data/chunks/Concentric joint connectors for form-changing space frames AM_chunk42.txt",
    "text": "4 PATH TOWARDS A SOLUTION 4.1 Tension structures For the resolution of purely tension loads, multi-link concentric joints that can resolve tension forces, but not compression, have been in common use for mil- lennia   one example being those within a structure woven from flexible fibres or cords, such as a fish- ing net."
  },
  {
    "chunk_file": "data/chunks/Concentric joint connectors for form-changing space frames AM_chunk56.txt",
    "text": "Nylon 66 (a type of polyamide) was chosen in prototypes due to its bal- ance between reasonable resistance to bending forc- es, low friction properties and good resistance to impact loading; it was accepted that relatively minor deformations of the nylon tips would add to the joints overall robustness, with only a negligible ef- fect on the joints overall concentricity within the frame."
  },
  {
    "chunk_file": "data/chunks/CASE15_0460_MS_chunk12.txt",
    "text": "B. Surgical robots and haptic feedback The introduction of minimal invasive surgery (MIS) has attributed to a reduction in patient trauma, resulting in faster recovery and lower hospitalisation cost [10]. However, performing MIS, can introduce a range of ergonomic and safety challenges."
  },
  {
    "chunk_file": "data/chunks/JMRR-D-20-00004_R2_chunk195.txt",
    "text": "He is currently a lecturer in mechanical engineering and the leader of the biomedical engineering programme at the department of architecture, computing and engineering at the University of East London. From 2016 to 2019 Dr Morad was a teaching associate in biomedical engineering at the department of life and health science at Aston University."
  },
  {
    "chunk_file": "data/chunks/CASE15_0460_MS_chunk3.txt",
    "text": "Experimental outcomes of measuring the depth of water jet cut were combined with haptic regional constraints to advance the safety of performing surgical procedures. The reliability, accuracy and performance of the prototype robot were tested in a mock surgical procedure mimicking a surgery on the lower lumbar vertebrae."
  },
  {
    "chunk_file": "data/chunks/1-s2.0-S1350453324001371-main_chunk65.txt",
    "text": "Simulation is structured into three main subsections: the model construction, the GUI initialization, and the draw function. In model construct script, the figure is initialized and created. A fixed coordinate system is used to define the manipulator geometry including the tool, base and legs."
  },
  {
    "chunk_file": "data/chunks/1-s2.0-S1350453324001371-main_chunk71.txt",
    "text": "3.1.1. Control loop structure A position and orientation of the end-effector are specified by an input set (p) to the nominal controller (NC)."
  },
  {
    "chunk_file": "data/chunks/JMRR-D-20-00004_R2_chunk181.txt",
    "text": "[10] J.P. Merlet, Parallel Robots (Springer, The Netherlands, 2006) [11] M. Shoham, M. Burman, E. Zehavi, L. Joskowicz, E. Batkilin, and Y. Kunicher, Bone-Mounted Miniature Robot for Surgical Procedures: Concept and Clinical Applications, IEEE Transactions on Robotics and Automation. 19(5) (2003) 893 - 901. [12] H. Tian, D.Wu, Z."
  },
  {
    "chunk_file": "data/chunks/pone.0047133_chunk122.txt",
    "text": "Proceedings of the London Mathematical Society s1 10: 3. 14. Dietz HP (2007) Does bladder neck descent increase with age?"
  },
  {
    "chunk_file": "data/chunks/1-s2.0-S1350453324001371-main_chunk59.txt",
    "text": "Using six en  coders, one on each leg, the position control creates a feedback loop. At the beginning of the program, the legs are datumed with a home flag, which indicates the base s initial position. The encoder readings in relation to this home position value represent the length of each of the six legs of the platform."
  },
  {
    "chunk_file": "data/chunks/JMRR-D-20-00004_R2_chunk156.txt",
    "text": "One is that the cord would be elongated beyond its elastic limit and its elongation becomes irreversible (or plastic), then when the compressive load is removed, the strut end would no longer be in contact with the adjacent strut ends, leading to loss of concentricity."
  },
  {
    "chunk_file": "data/chunks/pone.0047133_chunk38.txt",
    "text": "The liquid properties used were those of water (surface tension = 0:07N=m, viscosity = 0:0089Pa:s). The surface tension forces were applied using body forces around the edge of the droplet."
  },
  {
    "chunk_file": "data/chunks/JMRR-D-20-00004_R2_chunk142.txt",
    "text": "Surgical robot platform with a novel concentric joint for minimal invasive procedures 11  =  ( ) ( ) ( )  = [ cos    0     0 0 0 1 ] [   0   0 1 0   0   ] [ 1 0 0 0     0     ]  = [    +      +        +    +     ]  = |       | =  +     (3) Where Pi and Bi are given by the expressions:   = [       ] = [   cos ( )  sin( ) 0 ] (4)  = [       ] = [  cos( )  cos( ) 0 ] (5) Where   and   are the radiuses of the points to the centre and   and   are:  = ( 1)  3 ,  =   3 ; for  = 1,3,5 (6)  =  1 + 2  3 ,  =  1; for  = 2,4,6 (7) Solving Equation 3 using Equations 1, 2, 4, 5, 6 and 7 gives the nominal lengths for all six legs of the robot platform for any given input of  ,  ,  ,  ,  , and  ."
  },
  {
    "chunk_file": "data/chunks/pone.0047133_chunk10.txt",
    "text": "It is therefore surprising that there are no published studies in the field of urology, which describe the characteristic shape or wave pattern made by the urine stream as it exits the urethral meatus and whether this shape contains potential diagnostic information."
  },
  {
    "chunk_file": "data/chunks/286_chunk29.txt",
    "text": "B. Surgical drill prototype With reference to Fig 5, the drilling system consists of a flexible  3mm shaft (FS), made by twisting several layers of wire around a central core [9]. The flexible shaft is connected to an electrical drill (ED) via flexible coupling (FC)."
  },
  {
    "chunk_file": "data/chunks/JMRR-D-20-00004_R2_chunk73.txt",
    "text": "Concentric joints by (A) Bosscher/Ebert-Uphoff, and (b) Hamlin Samir Morad, Christian Ulbricht, Paul Harkin, Justin Chan, Kim Parker, Ravi Vaidyanathan 6 with each other by the flexible cord, they can effectively pivot relative to each other, giving 3DoF. Figure 7 shows a cross- section view through the joint configuration."
  },
  {
    "chunk_file": "data/chunks/286_chunk15.txt",
    "text": "It is used in many surgical applications including: Cutting Bone, Liver Surgery, Renal Surgery, Kidney Surgery, and Neurosurgery. Fig. 2 shows the typical constituents of a medical water jet cutting system [7]."
  },
  {
    "chunk_file": "data/chunks/JMRR-D-20-00004_R2_chunk67.txt",
    "text": "For commercially-available rigid space frames, the spheres act as a convenient method of joining the struts together, thus extending the material structure of each strut towards the node point, where the tension/compression forces are transmitted to the conjoining struts."
  },
  {
    "chunk_file": "data/chunks/1-s2.0-S1350453324001371-main_chunk179.txt",
    "text": "[28] Morad S, Ulbricht C, Harkin P, Chan J, Parker K, Vaidyanathan R. Surgical robot platform with a novel concentric joint for minimally invasive procedures. J Med Robot Res 2021;5:e2050001. https://doi.org/10.1142/S2424905 20500014."
  },
  {
    "chunk_file": "data/chunks/JMRR-D-20-00004_R2_chunk98.txt",
    "text": "Fig. 10. The flexion unit."
  },
  {
    "chunk_file": "data/chunks/1-s2.0-S1350453324001371-main_chunk145.txt",
    "text": "As a result, the input signals were also limited to a very slow rate. It is also possible to use pneumatic or linear drives instead of DC motors. In the surgical application at hand, these actuators provide sufficient accuracy and holding torque to pro  vide desirable response times."
  },
  {
    "chunk_file": "data/chunks/1-s2.0-S1350453324001371-main_chunk151.txt",
    "text": "Funding The UK Engineering and Physical Sciences Research Council (EPSRC)   the United Kingdom, funded this study (Funder s Grant Number: ME- ME F46009). Ethical Approval This article does not contain any studies with human participants or animals performed by any of the authors."
  },
  {
    "chunk_file": "data/chunks/1-s2.0-S1350453324001371-main_chunk148.txt",
    "text": "A position control code incorporating haptic rendering and trajectory monitoring was successfully implemented using the required hardware, software, and electronics. Tests were conducted to determine the accu  racy and robustness of the system."
  },
  {
    "chunk_file": "data/chunks/JMRR-D-20-00004_R2_chunk81.txt",
    "text": "Cord tension adjustment and elasticity Collars CL1 and CL2 are threaded together; their rotation relative to each other varies the distance between KN and the barrel (BN), thus giving a convenient method of adjusting the tension in the cords."
  },
  {
    "chunk_file": "data/chunks/1-s2.0-S1350453324001371-main_chunk174.txt",
    "text": "[23] Kapoor A, Li M, Taylor RH. Constrained control for surgical assistant robots. Proceedings of the international conference on robotics and automation."
  },
  {
    "chunk_file": "data/chunks/1-s2.0-S1350453324001371-main_chunk160.txt",
    "text": "IEEE Trans Haptics 2018;11:241 54. https://doi.org/10.1109/ TOH.2017.2786243. [8] Ehrampoosh A, Shirinzadeh B, Pinskier J, Smith J, Moshinsky R, Zhong Y. A force- feedback methodology for teleoperated suturing task in robotic-assisted minimally invasive surgery."
  },
  {
    "chunk_file": "data/chunks/JMRR-D-20-00004_R2_chunk95.txt",
    "text": "(ii) An independent floor-bearing structure that straddles the operating table. This could be achieved by using a trolley in the form of an inverted U-form, that could fix to the table, and then move relative to it as needed along the length of the patient s spine. In other words, making RS moving along the length of the patient s spine."
  },
  {
    "chunk_file": "data/chunks/286_chunk18.txt",
    "text": "They can be used for many purposes, such as for cutting holes in bone for the insertion of various implants. The modern drill bit is a complex engineering tool whose various design elements allow penetration of bone in an efficient manner, capable of consistently creating channels of uniform size [8]. II."
  },
  {
    "chunk_file": "data/chunks/JMRR-D-20-00004_R2_chunk42.txt",
    "text": "With the angles of separation (AS) between the struts as shown, the lines of force intersect at a convergence point (CP) of the central connection (CC), and the struts are not subject to shear or moment forces. Figure 4-B shows the same joint arrangement, but with forces of compression (FC) acting upon the struts (S)."
  },
  {
    "chunk_file": "data/chunks/286_chunk24.txt",
    "text": "Thus the tip can be made to bend in a controlled manner up to approximately 120  from the shaft axis. B. Surgical water jet cutting prototype The water-jet cutting system consists of a pressure washer (Nilfisk C110.4-5) with a pressure range of 75-100 bar. With reference to Fig."
  },
  {
    "chunk_file": "data/chunks/286_chunk30.txt",
    "text": "The drilling and Flexion (FE) systems were then integrated together along with the cutting burr using the housing (H), embedded with bearings and solid couplings. Fig. 5."
  },
  {
    "chunk_file": "data/chunks/JMRR-D-20-00004_R2_chunk56.txt",
    "text": "Ball and socket joints   (A) aligned, and (B) misaligned Fig. 5. (A) Non-concentric joints are configured so that each strut has a separate connection to one of the rigid plates, (B) Concentric joints allow the struts to be concentrically connected to each other and the rigid plates."
  },
  {
    "chunk_file": "data/chunks/JMRR-D-20-00004_R2_chunk167.txt",
    "text": "Each strut, acting as part of a truss, can change in length (telescope), and thus their combined variations can change the overall form of the frame. The CCJ enables multiple struts to be connected and pivot around each node point."
  },
  {
    "chunk_file": "data/chunks/1-s2.0-S1350453324001371-main_chunk97.txt",
    "text": "6. Constraint controller control logic. The (NC) signals are used to control the output of the system within the pre-defined boundaries."
  },
  {
    "chunk_file": "data/chunks/1-s2.0-S1350453324001371-main_chunk83.txt",
    "text": "7). The associated equations for a cylinder with radius r cantered about the origin O are: Fig. 4."
  },
  {
    "chunk_file": "data/chunks/JMRR-D-20-00004_R2_chunk173.txt",
    "text": "In the future, the development of the tele-operation scheme for the robot will be presented, including the design of control and haptic feedback system. References [1] M. Diana, J. Marescaux, Robotic surgery, Brit J Surg. 102(2) (2015) 15 - 28."
  },
  {
    "chunk_file": "data/chunks/pone.0047133_chunk21.txt",
    "text": "For a viscous fluid, the viscosity damps out these oscillations, so that at distances far downstream the jet effectively becomes cylindrical."
  },
  {
    "chunk_file": "data/chunks/pone.0047133_chunk35.txt",
    "text": "The computational solution algorithm comprised of a finite volume, 2nd order, pseudo-compressibility, dual-time stepping scheme with 2nd and 4th order smoothing. The effects of laminar viscosity were added by determining the strain field normal to the axis of the jet, and including the shear forces in the finite volume formulation."
  },
  {
    "chunk_file": "data/chunks/1-s2.0-S1350453324001371-main_chunk54.txt",
    "text": "Fig. 2 shows the structure of the code used to translate this user input into meaningful motion for the platform. Programming begins with the definition of global vari  ables, inputs, and outputs."
  },
  {
    "chunk_file": "data/chunks/Concentric joint connectors for form-changing space frames AM_chunk3.txt",
    "text": "The an- gular displacement (AS) between all the struts does not change; therefore the struts can be connected at the vertices (or nodes) via simple rigid joints at the convergence points (CP), which are often spherical in form (JS). Figure 2."
  },
  {
    "chunk_file": "data/chunks/1-s2.0-S1350453324001371-main_chunk40.txt",
    "text": "[24] studied trajectory su  pervision and rendering with invariance control. An example of regional constraint implementation is presented. The laser interferometry-based sensing and measuring (LISM) approach was initially studied for dynamic measurements of the end effector of a robot manipulator in motion."
  },
  {
    "chunk_file": "data/chunks/pone.0047133_chunk113.txt",
    "text": "Pel JJM, van Mastrigt R (2002) Development of a low-cost flow meter to grade the maximum flow rate. Neurourology and Urodynamics 21: 48 54. 5."
  },
  {
    "chunk_file": "data/chunks/JMRR-D-20-00004_R2_chunk198.txt",
    "text": "Since 2007 Mr. Ulbricht s practice has been exclusively spinal and he has a very wide clinical range from assessing patients with simple back and neck pain to complex spinal surgery. His interests are spinal surgery for degenerative disease, minimal invasive surgery and surgery for tumors and infections."
  },
  {
    "chunk_file": "data/chunks/1-s2.0-S1350453324001371-main_chunk68.txt",
    "text": "Due to the physical limitations of the robot s actuation and/or geometry, some robot ma  nipulators have a fixed workspace beyond which they will not be able to reach. Therefore, kinesthetic haptics, or active constraints, are used to keep the user within a certain predefined spatial area, namely the robot platform s workspace. 3."
  },
  {
    "chunk_file": "data/chunks/pone.0047133_chunk107.txt",
    "text": "The closed symbols show the predicted Qmax based on an individual s Qmax=Lmax measured at the first recorded voiding event. The open symbols show the increased scatter if the sample mean Qmax=Lmax value is used rather than the individual s Qmax=Lmax."
  },
  {
    "chunk_file": "data/chunks/Concentric joint connectors for form-changing space frames AM_chunk73.txt",
    "text": "This is due to their combination of near- concentricity, relatively few moving parts, and their rugged and simple overall design. 5.2 Operation in various environments Consideration would need to be given to the envi- ronment in which the joints would eventually oper- ate."
  },
  {
    "chunk_file": "data/chunks/Concentric joint connectors for form-changing space frames AM_chunk67.txt",
    "text": "Obviously, in addition to the cord elongating be- yond its elastic limit in either scenario noted above, the ultimate failure of the joint would occur should the cord break."
  },
  {
    "chunk_file": "data/chunks/CASE15_0460_MS_chunk23.txt",
    "text": "The flexible probe was mounted on the platform s end-effector, therefore, this enables the orientation of the probe to be manipulated in the three translational coordinates (x, y and z) and three rotational orientations (pitch  , roll   and yaw  )."
  },
  {
    "chunk_file": "data/chunks/CASE15_0460_MS_chunk37.txt",
    "text": "The constraint controller monitors the state of the system and only becomes active at the boundaries of the constraint set. Here, the constraint controller modifies the nominal control signals (Unom) and outputs a corrected control signal (Ucor) which prevents the system from entering the restricted region."
  },
  {
    "chunk_file": "data/chunks/286_chunk8.txt",
    "text": "This approach, however, makes the removal of cancerous tissue on the anterior side of the spinal column extremely challenging."
  },
  {
    "chunk_file": "data/chunks/JMRR-D-20-00004_R2_chunk211.txt",
    "text": "Proficient in programming, design, electronics, prototyping and optimization. He is interested in new innovative, emerging, disruptive technologies."
  },
  {
    "chunk_file": "data/chunks/JMRR-D-20-00004_R2_chunk205.txt",
    "text": "Mr. Parker trained at Princeton University as an aeronautical engineer specializing in combustion and rocketry, followed by experience in the Mechanics Department at Johns Hopkins University, but has been studying various aspects of hemodynamics and physiological mechanics since joining the Physiological Flow Studies Unit at Imperial College London over 30 years ago."
  },
  {
    "chunk_file": "data/chunks/JMRR-D-20-00004_R2_chunk3.txt",
    "text": "The CCJ joints have near- perfect concentricity of rotation around the node point, which enables the tension and compression forces of the struts to be resolved in a structurally-efficient manner. The preliminary feasibility tests, modelling, and simulations were introduced."
  },
  {
    "chunk_file": "data/chunks/CASE15_0460_MS_chunk101.txt",
    "text": "Preprint submitted to 2015 IEEE International Conference on Automation Science and Engineering. Received March 20, 2015."
  },
  {
    "chunk_file": "data/chunks/CASE15_0460_MS_chunk100.txt",
    "text": "in Proceedings of the 2006 IEEE International Conference on Robotics and Automation. 2006. Orlando, Florida: IEEE."
  },
  {
    "chunk_file": "data/chunks/JMRR-D-20-00004_R2_chunk2.txt",
    "text": "The surgical robot is a parallel robot platform comprised of multiple struts, arranged in a geometrically stable array, connected at their end points via the CCJ."
  },
  {
    "chunk_file": "data/chunks/JMRR-D-20-00004_R2_chunk204.txt",
    "text": "degree in Aerospace and Mechanical Engineering from Princeton University, USA, in 1964, and PhD degree in Aerospace and Mechanical Engineering from Princeton University, USA, in 1966. He is Emeritus Professor of Physiological Fluid Mechanics at the department of bioengineering, Imperial College London."
  },
  {
    "chunk_file": "data/chunks/JMRR-D-20-00004_R2_chunk210.txt",
    "text": "He is a senior mechanical engineer at Cytera CellWorks. Mr. Chan is Experienced Design Engineer with a demonstrated history of working in the mechanical, electrical and electronic manufacturing industry focusing on R&D and New Product Innovation. Skilled at concept generation and development from ideation to production."
  },
  {
    "chunk_file": "data/chunks/286_chunk9.txt",
    "text": "In extreme cases, the surgeon may attempt to remove additional tumor growth by entering Supported by UK Engineering and Physical Sciences Research Council S. Morad, J. Chan and R. Vaidyanathan are with the Department Of Mechanical Engineering, Imperial College, London, phone: (44) 020 7594 7020; (samir.morad10; justin.h.chan10; r.vaidyanathan@imperial.ac.uk)."
  },
  {
    "chunk_file": "data/chunks/CASE15_0460_MS_chunk36.txt",
    "text": "The basic structure of the control loop used for haptic rendering can be seen in Fig. 5. A nominal controller, which receives input set (p) from the user interface device, carries out the inverse kinematics and sends the nominal control signals (Unom) to the system to achieve the desired position."
  },
  {
    "chunk_file": "data/chunks/CASE15_0460_MS_chunk22.txt",
    "text": "A flexion unit is a surgical retraction probe with an adjustable articulated distal tip connected to the tensioning screw at the end of proximal handle via cables."
  },
  {
    "chunk_file": "data/chunks/Concentric joint connectors for form-changing space frames AM_chunk66.txt",
    "text": "Failure due to tension loading would occur when the cord elongates beyond its elastic limit; when the load was removed, this would lead to a similar lack of contact between the strut ends as above."
  },
  {
    "chunk_file": "data/chunks/Concentric joint connectors for form-changing space frames AM_chunk72.txt",
    "text": "Cross-section of tapering cord joint, with strut pivot- ing 5 CONCLUSIONS 5.1 Overview Tapering Cord Joints appear to be well suited for use in variable-geometry truss structures, for both existing applications such as hexapods/Stewart Plat- forms in surgical/industrial devices, and more specu- lative applications such as form-changing space frames (which are mostly in the working-prototype stage)."
  },
  {
    "chunk_file": "data/chunks/pone.0047133_chunk106.txt",
    "text": "Wrote the paper: AW Figure 7. Flow rate measurement accuracy can be improved if an individual s dilation parameter is calibrated for. The open symbols show the predicted Qmax based on Lmax multiplied by the sample mean value of Qmax/Lmax."
  },
  {
    "chunk_file": "data/chunks/JMRR-D-20-00004_R2_chunk199.txt",
    "text": "He is the surgical lead for metastatic spinal cord compression at Imperial College NHS Trust, and he is on the advisory board of the European Spine Journal."
  },
  {
    "chunk_file": "data/chunks/pone.0047133_chunk112.txt",
    "text": "Nitti VW (2005) Pressure flow urodynamic studies: the gold standard for diagnosing bladder outlet obstruction. Rev Urol 7 Suppl 6: S14 21. 4."
  },
  {
    "chunk_file": "data/chunks/1-s2.0-S1350453324001371-main_chunk69.txt",
    "text": "Haptic modelling 3.1. Haptic rendering Haptic rendering enables the surgeon to perceive forces in the sur  gical environment in response to interaction with objects. From a control theory perspective, haptic rendering is a problem with constrained control, since rigid walls are rendered."
  },
  {
    "chunk_file": "data/chunks/1-s2.0-S1350453324001371-main_chunk41.txt",
    "text": "This approach may give dy  namic position measurements in real time while maintaining high pre  cision, a vast working space, a high sample rate, and autonomous target tracking [25]."
  },
  {
    "chunk_file": "data/chunks/Concentric joint connectors for form-changing space frames AM_chunk2.txt",
    "text": "Space frames   pyramidal/tetrahedral (left) & tetra- hedral/octahedral (right) arrangements 1.2 Space frame joints Figure 2 shows a close-up view of a rigid space frame, comprised of fixed-length struts (S)."
  },
  {
    "chunk_file": "data/chunks/1-s2.0-S1350453324001371-main_chunk55.txt",
    "text": "In the main loop, the program continues to read the positional input from the NF and controls the motors, adjusting the six-leg lengths as necessary, to achieve the desired position for the Fig. 1. The installed motor-encoder units on the platform legs via motor-encoder adapter (A)."
  },
  {
    "chunk_file": "data/chunks/pone.0047133_chunk34.txt",
    "text": "The streamwise z{axis for the jet flow is simply the time (t) axis for the droplet, scaled by the streamwise jet velocity (w): z~t|w  7  Application to physiologically relevant flow Making use of these assumptions, a computational method developed here is solved for the unsteady development of a 2- dimensional  droplet , whose initial shape was determined from the orifice geometry."
  },
  {
    "chunk_file": "data/chunks/pone.0047133_chunk20.txt",
    "text": "As the jet PLOS ONE | www.plosone.org 1 October 2012 | Volume 7 | Issue 10 | e47133 develops downstream, the jet surface oscillates under the action of surface tension, and the opposing action of the radial and tangential momentum in the jet."
  },
  {
    "chunk_file": "data/chunks/1-s2.0-S1350453324001371-main_chunk82.txt",
    "text": "Eqs. (1) and (2) are the mathematical equations governing the constraint controller, where UB and LB are the upper and lower boundaries respectively, f is force magnitude, and i the position along each of the Cartesian axis x, y, z. As an example of a geometric constraint, cylindrical constraints can be defined using 2D polar coordinates (Fig."
  },
  {
    "chunk_file": "data/chunks/JMRR-D-20-00004_R2_chunk172.txt",
    "text": "The kinematics were simpler as a direct result of using the concentric joints, which created a form changing platform with the underlying geometry of a pure octahedron, rather than a complex skew hexagonal prism of existing platforms."
  },
  {
    "chunk_file": "data/chunks/JMRR-D-20-00004_R2_chunk166.txt",
    "text": "Conclusion In this paper, we have developed a robotic platform that could be used in spinal surgery procedures, with promising early results. The surgical robot is a parallel robot platform comprised of multiple struts, arranged in a geometrically stable array, connected at their end points via the CCJ."
  },
  {
    "chunk_file": "data/chunks/1-s2.0-S1350453324001371-main_chunk96.txt",
    "text": "8, the black arrows show the same path inputs from ucor. Due to the constraint control, the arrows will never enter the forbidden area. Fig."
  },
  {
    "chunk_file": "data/chunks/286_chunk31.txt",
    "text": "The flexible drilling system, showing non-tensioned distal tip (SS), and predetermined  J -shape of tightened distal tip (SR). III. SURGICAL ROBOT SYSTEM With reference to Fig."
  },
  {
    "chunk_file": "data/chunks/JMRR-D-20-00004_R2_chunk57.txt",
    "text": "(B) (A) Surgical robot platform with a novel concentric joint for minimal invasive procedures 5 manipulator, it is typical for multiple copies of distinct two-link joints to be grouped together as closely as is practical. This compromise is adequate in a mechanical sense for many purposes, but then concentricity is clearly not achieved."
  },
  {
    "chunk_file": "data/chunks/JMRR-D-20-00004_R2_chunk43.txt",
    "text": "CC component has been made to rotate due to the loads from the struts acting as moment forces (FM) upon it. LF now do not pass through the convergence point (CP). At the ball-and-socket joint JBS1 the strut (S1) connected to the ball is now in contact with the socket edge of the socket at point P1."
  },
  {
    "chunk_file": "data/chunks/286_chunk25.txt",
    "text": "4, the pressure washer, or source, is connected to a flow control valve, which controls the pressure and rate of flow. The flow control valve is then connected to a solenoid valve, which essentially acts as an on-off switch, allowing the flow of water to be controlled using a PS2 controller. Beyond this is a pressure gauge."
  },
  {
    "chunk_file": "data/chunks/286_chunk19.txt",
    "text": "SURGICAL CUTTING SYSTEMS A. The Flexion system The Flexion system (Fig. 3) is a surgical retraction instrument with an adjustable articulated tip (FE), and an overall length of approximately 250mm (NEWCO Surgical)."
  },
  {
    "chunk_file": "data/chunks/JMRR-D-20-00004_R2_chunk94.txt",
    "text": "There are two possible configurations of the surgical platform: (i) Mounted from a fixed structure above the surgical table (e.g. suspended from the ceiling of the operating theatre), possibly in the form of rails that run parallel to the patient s spine, to allow the robotic framework to move along them."
  },
  {
    "chunk_file": "data/chunks/1-s2.0-S1350453324001371-main_chunk161.txt",
    "text": "Sensors 2022;22:7829. https://doi.org/10.3390/s22207829. [9] Souipas S, Nguyen A, Laws SG, Davies BL, Baena FR. Real-time active constraint generation and enforcement for surgical tools using 3D detection and localisation network."
  },
  {
    "chunk_file": "data/chunks/1-s2.0-S1350453324001371-main_chunk175.txt",
    "text": "Florida: IEEE; 2006. p. 231 6. [24] Scheient M, Wolff J, Buss M. Invariance control in robotic applications: trajectory supervision and haptic rendering. Seattle: American Control Conference; 2008. p. 1436 42."
  },
  {
    "chunk_file": "data/chunks/JMRR-D-20-00004_R2_chunk80.txt",
    "text": "This partially overcomes the issue noted previously; the seemingly conflicting desire to locate rigid materials as close as practically possible to the point where the struts join together, whilst still allowing clearance for the struts to pivot around the node point. 3.5."
  },
  {
    "chunk_file": "data/chunks/1-s2.0-S1350453324001371-main_chunk149.txt",
    "text": "Future work will improve the design and further investigate the implementation of haptic technology in surgical robots based on the findings of this study. Future work will involve designing and developing a flexible robotic surgical device that includes a water jet tool and an articulated distal tip (ADT)."
  },
  {
    "chunk_file": "data/chunks/1-s2.0-S1350453324001371-main_chunk163.txt",
    "text": "IEEE Trans Med Robot Bionics 2023;5: 614 22. https://doi.org/10.1109/TMRB.2023.3291022. [11] Dalvand MM, Shirinzadeh B, Shamdani AH, Smith J, Zhong Y. An actuated force feedback-enabled laparoscopic instrument for robotic-assisted surgery."
  },
  {
    "chunk_file": "data/chunks/JMRR-D-20-00004_R2_chunk96.txt",
    "text": "4.3. The Articulated Distal Tip Tool An Articulated Distal Tip (ADT) tool was constructed [19] to the design specifications according to the angulation principles (Fig.10). The tool is a surgical Retraction Instrument with an Fig."
  },
  {
    "chunk_file": "data/chunks/JMRR-D-20-00004_R2_chunk82.txt",
    "text": "It is an important factor for the cords to have a slight degree of elasticity whilst the struts pivot around the node point, their length would need to vary slightly depending on the angular displacement of the struts."
  },
  {
    "chunk_file": "data/chunks/1-s2.0-S1350453324001371-main_chunk177.txt",
    "text": "Laser interferometry-based guidance methodology for high precision positioning of mechanisms and robots. Robot Comput Integr Manuf 2010;26:74 82. https://doi. org/10.1016/j.rcim.2009.04.002."
  },
  {
    "chunk_file": "data/chunks/JMRR-D-20-00004_R2_chunk69.txt",
    "text": "In effect, the strut is attempting to push through and then past the ends of the other struts. 3.3."
  },
  {
    "chunk_file": "data/chunks/JMRR-D-20-00004_R2_chunk55.txt",
    "text": "Virtually all mechanical joints with more than 1DoF connect only a pair links. In those applications where more than two components are intended to be joined together, such as a hexapod Fig. 4."
  },
  {
    "chunk_file": "data/chunks/286_chunk33.txt",
    "text": "The tools could be hand-held and manipulated by a surgeon, but there is an intrinsic problem with fatigue in the human hand during longer length procedures [10]."
  },
  {
    "chunk_file": "data/chunks/286_chunk27.txt",
    "text": "Fig. 4. Schematic of water jet system (left), and the integration of water jet and Flexion systems (right)."
  },
  {
    "chunk_file": "data/chunks/JMRR-D-20-00004_R2_chunk41.txt",
    "text": "The non-concentric pivot points (PP) of the joints are separated by distance D. The separation is necessary as this mechanism is not able to be transposed into the same volume as another. FC and FT acting along the axes of the struts are shown as LF."
  },
  {
    "chunk_file": "data/chunks/JMRR-D-20-00004_R2_chunk170.txt",
    "text": "The platform s end effector position. A plot representing the end effector path in (A) 3D and (B) 2D, (C) the position of the end effector as a function of time as displayed in MATLAB s scope block."
  },
  {
    "chunk_file": "data/chunks/1-s2.0-S1350453324001371-main_chunk80.txt",
    "text": "fi =  (i  LBi), uicor = LBi, for i < LBi (1) fi =  (i  UBi), uicor = UBi, for i > UBi (2) fi = 0, uicor = i A haptic device produces force feedback in three translational coordinates (x, y and z), so there are 3D boundary conditions for each constraint. The CC block in Fig."
  },
  {
    "chunk_file": "data/chunks/1-s2.0-S1350453324001371-main_chunk94.txt",
    "text": "5. The constraint controller contains two additional constraint sets: the first, a speed limit set, and the second, an allowable threshold set. 3.2.1."
  },
  {
    "chunk_file": "data/chunks/JMRR-D-20-00004_R2_chunk164.txt",
    "text": "The cords did not fail at any time during the testing period. Following the initial assembly of the joints, the tension in the cords was normally adjusted once, via a very simple procedure with a spanner to rotate the threaded tension mechanism after a brief period of use, and then never had to be adjusted again."
  },
  {
    "chunk_file": "data/chunks/pone.0047133_chunk36.txt",
    "text": "The Reynolds number based on wavelength L was typically around 4000. A correction for gravitational effects was also added, by scaling the droplet area to account for a fixed volumetric flow rate at each streamwise plane of the jet. Both the laminar viscosity and gravitational effects Figure 1."
  },
  {
    "chunk_file": "data/chunks/pone.0047133_chunk22.txt",
    "text": "On the other hand, if viscous effects are small, and the forces due to surface tension are large in comparison to the momentum in the jet, then the jet surface can become unstable and break-up due to the amplifica- tion of capillary waves. Consider the jet flow in Fig. 1, where the minimum dimension of the jet at the exit of the aperture is Dmin."
  },
  {
    "chunk_file": "data/chunks/JMRR-D-20-00004_R2_chunk158.txt",
    "text": "Failure due to tension loading would occur when the cord elongates beyond its elastic limit; when the load was removed, this would lead to a similar lack of contact between the strut ends as above."
  },
  {
    "chunk_file": "data/chunks/Concentric joint connectors for form-changing space frames AM_chunk0.txt",
    "text": "1 INTRODUCTION 1.1 Space frames Space frame structures emerged in the 1890s, from work by Bell (1903) related to structures for kites that were lightweight, but also strong. They are comprised from rigid struts joined together at their ends, configured as 3-dimensional trusses."
  },
  {
    "chunk_file": "data/chunks/1-s2.0-S1350453324001371-main_chunk43.txt",
    "text": "The LISM equipment is used in the approach to guide the robot s end effector to a desired place or along a desired path by guiding the robot to follow the laser beam-mapped trajectory [26]. In their work, Clark et al."
  },
  {
    "chunk_file": "data/chunks/1-s2.0-S1350453324001371-main_chunk57.txt",
    "text": "2. Code structure used to process the user input (NF) into the meaningful motion of the robot platform. (For interpretation of the references to color in this figure legend, the reader is referred to the web version of this article.)"
  },
  {
    "chunk_file": "data/chunks/pone.0047133_chunk104.txt",
    "text": "Procedures were conducted in private with approval of the local ethics committee. Acknowledgments We wish to thank all those that took part in the human studies and also to Albyn Medical for the loan of a gravimetric urine flow meter. Author Contributions Conceived and designed the experiments: AW MK."
  },
  {
    "chunk_file": "data/chunks/pone.0047133_chunk110.txt",
    "text": "Neurourology and Urodynamics 21: 261 274. 2. Madersbacher S, Alivizatos G, Nordling J, Sanz CR, Emberton M, et al."
  },
  {
    "chunk_file": "data/chunks/Concentric joint connectors for form-changing space frames AM_chunk64.txt",
    "text": "One is that the cord would be elongated beyond its elastic limit and its elongation becomes irreversible (i.e. plastic), then when the compressive load is re- moved, the strut end would no longer be in contact with the adjacent strut ends, leading to loss of con- centricity."
  },
  {
    "chunk_file": "data/chunks/Concentric joint connectors for form-changing space frames AM_chunk70.txt",
    "text": "In the built prototypes, the distance between the node point and the actual pivot point was approximately 4mm. This displacement of concentricity appears to be proportional and approximately equal to the diame- ter of the barrels (4mm). This displacement distance is smaller than could practically be achieved using multiple ball-and-socket joints."
  },
  {
    "chunk_file": "data/chunks/Concentric joint connectors for form-changing space frames AM_chunk58.txt",
    "text": "A 2-piece end collar (CL1, CL2) with a conical form is located at the end of each strut (S); i.e. their cross-sectional area decreases towards the node point. This provides rigid support for the barrel and in turn the cord very near to the convergence point at the node."
  },
  {
    "chunk_file": "data/chunks/CASE15_0460_MS_chunk34.txt",
    "text": "Fig. 3. Schematic of water jet system (left), and the integration of water jet and Flexion units (right)."
  },
  {
    "chunk_file": "data/chunks/CASE15_0460_MS_chunk20.txt",
    "text": "Received March 20, 2015. have been limited by their capacity to control. In this study a new experimental method of controlling the depth of water jet cut was conducted. In addition, a new method of haptically controlling the depth of water jet cutting is proposed."
  },
  {
    "chunk_file": "data/chunks/JMRR-D-20-00004_R2_chunk206.txt",
    "text": "His work in hemodynamics has included the analysis of the wave nature of flow in the arteries, the hemodynamics of the heart and the coupling of flow from the heart to the arteries, and the experimental and theoretical study of the mechanics of the deep veins of the calf."
  },
  {
    "chunk_file": "data/chunks/JMRR-D-20-00004_R2_chunk0.txt",
    "text": "Journal of Medical Robotics Research, Vol. 0, No."
  },
  {
    "chunk_file": "data/chunks/JMRR-D-20-00004_R2_chunk1.txt",
    "text": "0 (2015) 1 15  World Scientific Publishing Company 1 Surgical Robot Platform With A Novel Concentric Joint For Minimally Invasive Procedures Samir Morada, Christian Ulbrichtb, Paul Harkinc, Justin Chanc, Kim Parkerc, Ravi Vaidyanathanc aDepartment of Engineering, the University of East London, University Way, London, E16 2RD, UK E-mail: s.morad@uel.ac.uk bCharing Cross Hospital, Fulham Palace Road, London, W6 8RF, UK cImperial College London, Exhibition Road, SW7 2AZ, UK Abstract  In this paper, a surgical robot platform with a novel concentric connector joint (CCJ) is presented."
  },
  {
    "chunk_file": "data/chunks/JMRR-D-20-00004_R2_chunk207.txt",
    "text": "His work in connective tissue mechanics has included study of the deformation of the red-blood cell membrane, the osmotic pressure in cartilage and the physicochemical properties of elastin. Paul Harkin received his M.A. degree in Architecture from Birmingham City University, UK in 1997."
  },
  {
    "chunk_file": "data/chunks/CASE15_0460_MS_chunk21.txt",
    "text": "II. SYSTEM DEFENITION A 3-3 parallel manipulator platform with 6DoFs was constructed (Fig.1). The platform is comprised of a fixed top, and a mobile base, connected by six individually- powered extensible linear actuators."
  },
  {
    "chunk_file": "data/chunks/Concentric joint connectors for form-changing space frames AM_chunk59.txt",
    "text": "This partially overcomes the issue noted previously; i.e. the seemingly conflicting desire to locate rigid materials as close as practically possible to the point where the struts join together, whilst still allowing clearance for the struts to pivot around the node point."
  },
  {
    "chunk_file": "data/chunks/CASE15_0460_MS_chunk35.txt",
    "text": "Preprint submitted to 2015 IEEE International Conference on Automation Science and Engineering. Received March 20, 2015. walls; haptic rendering, when viewed from a control theory perspective, is a constrained control problem. The set of constraints and boundaries that are impermissible or inadmissible to the robot are defined in a constraint set."
  },
  {
    "chunk_file": "data/chunks/Concentric joint connectors for form-changing space frames AM_chunk71.txt",
    "text": "It is also proportion- ally low relative to the overall length of the telescop- ic struts of the prototypes (which vary in length from 450mm to 270mm); the displacement of concentrici- ty is between 0.9% and 1.5% of the strut length. Figure 12."
  },
  {
    "chunk_file": "data/chunks/Concentric joint connectors for form-changing space frames AM_chunk65.txt",
    "text": "The second is that the  barrel  tubular form at the end of the strut would be subject to a concentrated bending moment as the cord would still be restrained by the other struts, likely leading to its permanent deformation and/or disintegration."
  },
  {
    "chunk_file": "data/chunks/pone.0047133_chunk111.txt",
    "text": "(2004) Eau 2004 guidelines on assessment, therapy and follow-up of men with lower urinary tract symptoms suggestive of benign prostatic obstruction (bph guidelines). European Urology 46: 547 554. 3."
  },
  {
    "chunk_file": "data/chunks/pone.0047133_chunk105.txt",
    "text": "Performed the experiments: AW SM MK. Analyzed the data: AW SM MK. Contributed reagents/materials/analysis tools: AW SM MK."
  },
  {
    "chunk_file": "data/chunks/1-s2.0-S1350453324001371-main_chunk56.txt",
    "text": "The stepper motor attached to the probe tensioning screw via a motor- tensioning screw adapter (B). (For interpretation of the references to color in this figure legend, the reader is referred to the web version of this article.) Fig."
  },
  {
    "chunk_file": "data/chunks/1-s2.0-S1350453324001371-main_chunk42.txt",
    "text": "An approach based on the LISM technique is suggested to provide laser interferometry-based guiding (LIG) for precise placement of a robot manipulator in high precision manufacturing processes."
  },
  {
    "chunk_file": "data/chunks/Concentric joint connectors for form-changing space frames AM_chunk1.txt",
    "text": "Figure 1 shows examples based on struts in square pyrami- dal/tetrahedral and octahedral/tetrahedral arrange- ments. Historically, these frames have used struts of fixed lengths to create rigid structures. Figure 1."
  },
  {
    "chunk_file": "data/chunks/pone.0047133_chunk23.txt",
    "text": "For the cases described here, we find that the initial wavelength (L) to be around thirty times larger than Dmin. The pressure differences due to surface tension are inversely proportional to the radius of curvature of the jet surface both in the streamwise direction and in the x-y plane (see Fig. 1)."
  },
  {
    "chunk_file": "data/chunks/JMRR-D-20-00004_R2_chunk159.txt",
    "text": "Obviously, in addition to the cord elongating beyond its elastic limit in either scenario noted above, the ultimate failure of the joint would occur should the cord break."
  },
  {
    "chunk_file": "data/chunks/pone.0047133_chunk37.txt",
    "text": "Sketch of the liquid jet flow exiting an elliptical orifice. doi:10.1371/journal.pone.0047133.g001 The Biophysics of the Urine Stream PLOS ONE | www.plosone.org 2 October 2012 | Volume 7 | Issue 10 | e47133 were found to make little difference to the solutions."
  },
  {
    "chunk_file": "data/chunks/1-s2.0-S1350453324001371-main_chunk95.txt",
    "text": "Velocity limit The system needs time to accelerate and decelerate to achieve target alignment. If the rate of change of the entered targets is critically high, the system will not have enough time to acceptably respond to the target orientations. In Fig."
  },
  {
    "chunk_file": "data/chunks/JMRR-D-20-00004_R2_chunk165.txt",
    "text": "The robot platform is validated by modelling and simulation only. The authors are intending to follow up with a study/paper that presents the design of the control scheme and haptic feedback of the robot platform to qualitatively validate the function of the robot experimentally. 9."
  },
  {
    "chunk_file": "data/chunks/JMRR-D-20-00004_R2_chunk171.txt",
    "text": "Samir Morad, Christian Ulbricht, Paul Harkin, Justin Chan, Kim Parker, Ravi Vaidyanathan 14 demonstrated by applying a variable-geometry mount in the design of the surgical robot, to target the removal of cancerous tumours surrounding the spinal column of affected patients."
  },
  {
    "chunk_file": "data/chunks/1-s2.0-S1350453324001371-main_chunk81.txt",
    "text": "5 is expanded to show how the code within this program determines the appropriate force output f and the ucor to the output. Fig. 6 shows the control logic."
  },
  {
    "chunk_file": "data/chunks/286_chunk26.txt",
    "text": "The pressurized water is pushed through a  0.84mm high pressure solid stream nozzle via a high pressure reinforced tube with standard fittings. The water jet prototype (WJ) is then integrated with flexion system (FS) to complete the flexible surgical water jet prototype (Fig. 4)."
  },
  {
    "chunk_file": "data/chunks/JMRR-D-20-00004_R2_chunk40.txt",
    "text": "Inherent weaknesses of ball-and-socket joints On first examining the problem, the authors first considered using multiple ball-and-socket joints, clustered together at the nodes. Figure 4-A shows a joint assembly of 3DoF ball-and- socket joints (JBS)."
  },
  {
    "chunk_file": "data/chunks/JMRR-D-20-00004_R2_chunk54.txt",
    "text": "What initially appears to be a simple requirement (design a mechanical joint allowing more than two linked struts/links to share a common center of rotation) turns out to be a deceptively difficult task to solve. This may be due to the relatively rare instances where such a joint would be required."
  },
  {
    "chunk_file": "data/chunks/286_chunk32.txt",
    "text": "6, both of the surgical cutting tools (T) need to be positioned and moved around the dorsal parts (e.g. the vertebral cavity VC) of patient (P), who would be laying face-down during the surgical procedure."
  },
  {
    "chunk_file": "data/chunks/JMRR-D-20-00004_R2_chunk68.txt",
    "text": "Instead of the sphere, the struts themselves could be extended as close as practical to the node point, and joined directly to the other adjoining struts, such as by welding or bonding (i.e. gluing). As the struts are subject to compressive forces along their lengths, the ends at the joints have a tendency to push onto the adjacent strut end."
  },
  {
    "chunk_file": "data/chunks/1-s2.0-S1350453324001371-main_chunk176.txt",
    "text": "[25] Shirinzadeh B. Laser-interferometry-based tracking for dynamic measurements. Indust Robot 1998;25:35 41. https://doi.org/10.1108/01439919810196946. [26] Shirinzadeh B, Teoh PL, Tian Y, Dalvand MM, Zhong Y, Liaw HC."
  },
  {
    "chunk_file": "data/chunks/JMRR-D-20-00004_R2_chunk83.txt",
    "text": "The degree of this elasticity would have to be chosen carefully, as it would need to balance sufficient  slackness  to allow the struts to pivot freely versus ensuring the strut ends maintain contact with one another. The elasticity would also have to be chosen to resist the tensile/compressive forces imposed by the struts on the joint. Fig."
  },
  {
    "chunk_file": "data/chunks/JMRR-D-20-00004_R2_chunk97.txt",
    "text": "9. An illustration of the assembled surgical robot device installed in an operating theatre environment. (T) Surgical tool, (VC) vertebral cavity, (FT) fixed top, (LA) linear actuators, (MB) mobile base, (P) patient, (OP) octahedral platform, and (RS) rigid structure."
  },
  {
    "chunk_file": "data/chunks/1-s2.0-S1350453324001371-main_chunk162.txt",
    "text": "Front Robot AI 2024;11:1365632. https://doi.org/10.3389/ frobt.2024.1365632. [10] Souipas S, Nguyen A, Laws SG, Davies BL, Baena FR. SimPS-Net: simultaneous pose and segmentation network of surgical tools."
  },
  {
    "chunk_file": "data/chunks/1-s2.0-S1350453324001371-main_chunk166.txt",
    "text": "[14] Tzemanaki A, Al GA, Melhuish C, Dogramadzi S. Design of a wearable fingertip haptic device for remote palpation: characterisation and interface with a virtual environment. Front Robot AI 2018;5:311495. https://doi.org/10.3389/ frobt.2018.00062."
  },
  {
    "chunk_file": "data/chunks/JMRR-D-20-00004_R2_chunk93.txt",
    "text": "The aforementioned practical limits on the range-of- movement for the robotic framework (an approximate sphere (S) of 120mm diameter), and the consequence of having to reposition the support structure to enable access to as much of the length of the vertebral cavity as possible (700mm in length), result in the need to consider how the support structure itself is configured/fits around the patient (Figure 9)."
  },
  {
    "chunk_file": "data/chunks/JMRR-D-20-00004_R2_chunk87.txt",
    "text": "In the built prototypes, the distance between the node point and the actual pivot point was approximately 4mm. This displacement of concentricity appears to be proportional and approximately equal to the diameter of the barrels (4mm). This displacement distance is smaller than could practically be achieved using multiple ball-and-socket joints."
  },
  {
    "chunk_file": "data/chunks/1-s2.0-S1350453324001371-main_chunk172.txt",
    "text": "[21] Bettini A, Marayong P, Lang S, Okamura AM, Hager GD. Vision-assisted control for manipulation using virtual fixtures. IEEE Trans Robot 2004;20:953 66. https:// doi.org/10.1109/TRO.2004.829483."
  },
  {
    "chunk_file": "data/chunks/286_chunk36.txt",
    "text": "This configuration was chosen over a serial manipulator due to it producing an inherently more stable end effector position. The octahedral platform is intended to be suspended from a rigid structure (RS) located above the prone patient (P). Fig."
  },
  {
    "chunk_file": "data/chunks/JMRR-D-20-00004_R2_chunk50.txt",
    "text": "Rather than a pure octahedron, it will be seen that this forms a more complex geometric shape comprised of a pair of irregular hexagons (the rigid plates), connected via the variable-length struts, pairs of which form  skew quadrilaterals. In geometric terms, the whole form is a  skew hexagonal prism."
  },
  {
    "chunk_file": "data/chunks/JMRR-D-20-00004_R2_chunk44.txt",
    "text": "Thus, a load resulting in a FC upon strut S1 would impose a bending moment at this point of contact (P1) upon the end of strut S1 as it induces further rotation of the central connection."
  },
  {
    "chunk_file": "data/chunks/286_chunk22.txt",
    "text": "An adjustable lower distal tip section (FE) is comprised of a series of links held together by one or more cables of 1.4305 steel, with the cables routed within the hollow round shaft (R)."
  },
  {
    "chunk_file": "data/chunks/JMRR-D-20-00004_R2_chunk78.txt",
    "text": "The cord passes through the barrel, emerging to entwine with other cords. A relatively non-brittle material such as nylon is also suitable as it directly contacts the cord and exerts a pressure upon it, e.g. when the strut is subject to a compressive force, it attempts to push past the other barrels and shear the cord."
  },
  {
    "chunk_file": "data/chunks/pone.0047133_chunk33.txt",
    "text": "zrgy  5  Lu Lx z Lv Ly ~0  6  One can immediately see that the deformation of the jet surface, in this simplified case, can be described by the deformation of a two- dimensional droplet which is deforming unsteadily in time under the action of surface tension."
  },
  {
    "chunk_file": "data/chunks/JMRR-D-20-00004_R2_chunk149.txt",
    "text": "Discussion The concentric connector joint, originally developed for use in variable-geometry space frames, was modified and used in the development of a parallel robot platform for this medical application."
  },
  {
    "chunk_file": "data/chunks/pone.0047133_chunk27.txt",
    "text": "A further simpification will be to neglect the second derivatives of velocity in the streamwise direction, which is reasonable when LwwDmin since in this case the jet surface will not deform rapidly along the jet axis. This latter assumption in effect neglects the shear forces due to velocity gradients in the streamwise direction."
  },
  {
    "chunk_file": "data/chunks/1-s2.0-S1350453324001371-main_chunk85.txt",
    "text": "5. Control loop structure for haptic rendering. User input information (p) is sent to the nominal controller (NC) to provide signals (unom) to control the system s output within permissible regions."
  },
  {
    "chunk_file": "data/chunks/JMRR-D-20-00004_R2_chunk175.txt",
    "text": "19 (135) (2005) 674-678. [4] C. Detter, H.Reichenspurner, D.H. Boehm and B. Reichart, Robotic manipulators in cardiac surgery: the computer-assisted surgical system ZEUS. Minimally Invasive Therapy & Allied Technologies, 10(6) (2001) 275-281."
  },
  {
    "chunk_file": "data/chunks/JMRR-D-20-00004_R2_chunk161.txt",
    "text": "The physical plant is connected to the controller model, which is encompassed of inverse kinematics and trajectory models, to perform simulation. The model is also connected to several displays representing positioning data."
  },
  {
    "chunk_file": "data/chunks/1-s2.0-S1350453324001371-main_chunk91.txt",
    "text": "Since the input control signals are monitored by the constraint controller; The robot end effector s trajectory or path will never enter an inadmissible region as long as the end effector s real-time position is always equal to the input."
  },
  {
    "chunk_file": "data/chunks/pone.0047133_chunk101.txt",
    "text": "Trials with Health Volunteers and Patients Sixty healthy volunteers and sixty patients, mean ages +1 standard deviation were 26+8 and 67+13 respectively, were asked to void normally into a clinical urine flow meter and to record the maximum wavelength in their flow stream."
  },
  {
    "chunk_file": "data/chunks/pone.0047133_chunk115.txt",
    "text": "Caffarel J, Robson W, Pickard R, Griffiths C, Drinnan M (2007) Flow measurements: Can several  wrongs  make a  right ? Neurourology and Urodynamics 26: 474 480. 7."
  },
  {
    "chunk_file": "data/chunks/CASE15_0460_MS_chunk8.txt",
    "text": "In recent years, the approach of injecting Supported by UK Engineering and Physical Sciences Research Council S. Morad, J. Chan and R. Vaidyanathan are with the Department Of Mechanical Engineering, Imperial College, London, phone: (44) 020 7594 7020; (samir.morad10; justin.h.chan10; r.vaidyanathan@imperial.ac.uk)."
  },
  {
    "chunk_file": "data/chunks/Concentric joint connectors for form-changing space frames AM_chunk5.txt",
    "text": "From Lan (1999), this alignment, along with the use of triangulation in 3 dimensions, means loads imposed upon the structure are resisted almost Concentric Joint Connectors for Form-Changing Space Frames P. Harkin Form Changing Structures Limited and Imperial College London R. Vaidyanathan Imperial College London S. Morad Aston University, UK ABSTRACT: This paper presents a novel joint design for use in form-changing structural frames."
  },
  {
    "chunk_file": "data/chunks/1-s2.0-S1350453324001371-main_chunk46.txt",
    "text": "The purpose of this paper is to explore the design of a working po  sitional control structure incorporating a robotic framework, developed for use in spine surgical procedures, which serves as the guide and moving mount. In order to simplify the mechanical design of the framework. The parallel manipulator uses novel concentric joints [28]."
  },
  {
    "chunk_file": "data/chunks/pone.0047133_chunk129.txt",
    "text": "Wasson JH, Reda DJ, Bruskewitz RC, Elinson J, Keller AM, et al. (1995) A comparison of transurethral surgery with watchful waiting for moderate symptoms of benign prostatic hyperplasia. New England Journal of Medicine 332: 75 79."
  },
  {
    "chunk_file": "data/chunks/1-s2.0-S1350453324001371-main_chunk52.txt",
    "text": "Each of the six DC motors was connected to a rotary encoder via a custom-made adapter to provide positional feedback regarding each leg (Fig. 1-A). A unipolar stepper motor was controlled by a single ULN2003a transistor array, which was connected to the flexible probe (Fig."
  },
  {
    "chunk_file": "data/chunks/CASE15_0460_MS_chunk31.txt",
    "text": "A. Haptic Rendering Haptic rendering is implemented to restore the surgeon s perception of forces in response to interaction with objects in the surgical environment. Considering the rendering of rigid Fig. 4."
  },
  {
    "chunk_file": "data/chunks/Concentric joint connectors for form-changing space frames AM_chunk49.txt",
    "text": "In ef- fect, the strut is attempting to push through and then past the ends of the other struts."
  },
  {
    "chunk_file": "data/chunks/CASE15_0460_MS_chunk25.txt",
    "text": "The flexible probe was equipped with a water jet cutting system that uses pressurized water to dissect and resect body tissue (Fig. 3). The setup is connected to a Novint Falcon haptic device controller through a network of electronics, a microcontroller and a computer."
  },
  {
    "chunk_file": "data/chunks/Concentric joint connectors for form-changing space frames AM_chunk61.txt",
    "text": "It is important factor for the cords to have a slight degree of elasticity whilst the struts pivot around the node point, its length would need to vary slightly depending on the angular displacement of the struts."
  },
  {
    "chunk_file": "data/chunks/Concentric joint connectors for form-changing space frames AM_chunk75.txt",
    "text": "5.3 Possible design improvements Due to the proportional relationship between the diameter of the barrels at the strut ends and the off- set of the strut pivot points from the node points, there appears to be scope for the pivot points to be closer to the nodes, thus moving closer to true- concentricity, via the use of materials for the barrels with higher flexural strength."
  },
  {
    "chunk_file": "data/chunks/CASE15_0460_MS_chunk19.txt",
    "text": "Water jet cutting tool in surgery; Modelling and control of a water jet cutting probe for flexible surgical robot Samir Morad Student Member IEEE, Christian Ulbricht, Paul Harkin, Justin Chan, Kim Parker, Ravi Vaidyanathan, Member IEEE Preprint submitted to 2015 IEEE International Conference on Automation Science and Engineering."
  },
  {
    "chunk_file": "data/chunks/JMRR-D-20-00004_R2_chunk203.txt",
    "text": "His academic research has translated in a range industrial projects including several new ventures based on principles established in his laboratory Kim H. Parker received the B.S.E degree in Aeronautical Engineering from Princeton University, USA, in 1962 and the M.A."
  },
  {
    "chunk_file": "data/chunks/JMRR-D-20-00004_R2_chunk5.txt",
    "text": "Clinical Motivation Surgical robots have proliferated in recent years, with well- established benefits including: reduced patient trauma, shortened hospitalization, and improved diagnostic accuracy and therapeutic outcome."
  },
  {
    "chunk_file": "data/chunks/JMRR-D-20-00004_R2_chunk4.txt",
    "text": "Keywords: surgical robotics, parallel robot platform, form-changing space frames, concentric connector joint. 1. Introduction 1.1."
  },
  {
    "chunk_file": "data/chunks/JMRR-D-20-00004_R2_chunk202.txt",
    "text": "Prior to his post at Imperial, he completed a Senior Research Fellowship in Brain-Computer Interface at the University of Southampton, was a Research Assistant Professor of Systems Engineering at the US Naval Postgraduate School, and a Senior Lecturer in Biodynamics at the University of Bristol."
  },
  {
    "chunk_file": "data/chunks/Concentric joint connectors for form-changing space frames AM_chunk74.txt",
    "text": "Sealing against the ingress of dirt, dust or grit is likely to be necessary in some circumstances, e.g. a flexible covering or encasement. It is not anticipated that water ingress would significantly affect the joint s performance, provided material such as nylon was used for bearing components."
  },
  {
    "chunk_file": "data/chunks/CASE15_0460_MS_chunk18.txt",
    "text": "This system would allow the removal of tumor growth in front of the spinal column without the need for additional invasive entry; thus risk to the patient would be much-reduced. In this paper, a novel flexible water jet cutter is presented and tested for performance."
  },
  {
    "chunk_file": "data/chunks/Concentric joint connectors for form-changing space frames AM_chunk60.txt",
    "text": "4.5 Cord tension adjustment and elasticity Collars CL1 and CL2 are threaded together; their rotation relative to each other varies the distance be- tween the cord knot (KN) and the barrel (BN), thus giving a convenient method of adjusting the tension in the cords."
  },
  {
    "chunk_file": "data/chunks/Concentric joint connectors for form-changing space frames AM_chunk48.txt",
    "text": "Instead of the sphere, the struts themselves could be extended as close as prac- tical to the node point, and joined directly to the oth- er adjoining struts, such as by welding or bonding (i.e. gluing). As the struts are subject to compressive forces along their lengths, the ends at the joints have a tendency to push onto the adjacent strut end."
  },
  {
    "chunk_file": "data/chunks/CASE15_0460_MS_chunk24.txt",
    "text": "When the cables are tightened via tensioning screw, the tip bends to form an approximate arc or J-shape, with the radius of the arc diminishing as the tension increases (Fig.2). As is shown in Fig. 1, when the instrument was mounted on the robot platform, a stepper motor was installed at the proximal end to operate the tensioning screw."
  },
  {
    "chunk_file": "data/chunks/CASE15_0460_MS_chunk30.txt",
    "text": "It is important to limit the position of the robot to a certain application-defined workspace as unconstrained robot movements can risk dealing severe damage and potentially life-threatening damage to the patient."
  },
  {
    "chunk_file": "data/chunks/pone.0047133_chunk128.txt",
    "text": "Jonas U, Hofner K (1996) Symptom scores, watchful waiting and prostate specific antigen levels in benign prostatic hyperplasia. Journal of Urology 156: 1040 1041. 20."
  },
  {
    "chunk_file": "data/chunks/1-s2.0-S1350453324001371-main_chunk53.txt",
    "text": "1-B). 2.2. Position control of the SRP With the NF, user inputs of up to 3DOF can be made and mechanical force feedback can be passed back to the user."
  },
  {
    "chunk_file": "data/chunks/1-s2.0-S1350453324001371-main_chunk47.txt",
    "text": "The design of a surgical tool that can remove tissue from both the anterior and the posterior sides of the spine will be developed in a separate paper. This paper is part of a PhD thesis defended by the author [29]. S. Morad et al."
  },
  {
    "chunk_file": "data/chunks/Concentric joint connectors for form-changing space frames AM_chunk4.txt",
    "text": "Space frame node with rigid joint Figure 3 shows a simplified, detailed view of the same fixed spherical joint (JS). It is important that the struts  axes, and therefore the lines of force (LF) all need to intersect at the convergence point (CP) at the nodes."
  },
  {
    "chunk_file": "data/chunks/pone.0047133_chunk114.txt",
    "text": "Addla SK, Marri RR, Daayana SL, Irwin P (2010) Avoid cruising on the uroflowmeter: Evaluation of cruising artifact on spinning disc flowmeters in an experimental setup. Neurourology and Urodynamics 29: 1301 1305. 6."
  },
  {
    "chunk_file": "data/chunks/CASE15_0460_MS_chunk9.txt",
    "text": "K. Parker is with the Department of Bioengineering, Imperial College, London, south Kensington, (k.parker@imperial.ac.uk). P. Harkin is with Form Changing Structures, Lincolnshire, UK (paul.harkin@formchangingstructures.com)."
  },
  {
    "chunk_file": "data/chunks/pone.0047133_chunk100.txt",
    "text": "Data was adjusted for the 0.2 second delay between the imaging of the wavelength at the meatus and urine flow rate being detected at the flow meter."
  },
  {
    "chunk_file": "data/chunks/JMRR-D-20-00004_R2_chunk160.txt",
    "text": "In the prototype joints, the cord chosen ( Beta Saltwater Mono 80lb Clear  by Shakespeare Fishing) was a monofilament fishing line of 1.2mm diameter, with a breaking load of 36kg, which also has a Fig.17: The complete surgical platform model."
  },
  {
    "chunk_file": "data/chunks/1-s2.0-S1350453324001371-main_chunk90.txt",
    "text": "Trajectory supervision Since the robot s trajectory is not designed to run autonomously from one point to another, there is no need to model the robot s trajectories. Due to the real-time nature of the robot s application, it is sufficient to ensure that the end effector s position is within an allowable threshold of the input position."
  },
  {
    "chunk_file": "data/chunks/1-s2.0-S1350453324001371-main_chunk84.txt",
    "text": "Logic flow chart of the simulation (A) and the resultant simulation of the robot platform displayed in MATLAB GUI (B). (For interpretation of the references to color in this figure legend, the reader is referred to the web version of this article.) Fig."
  },
  {
    "chunk_file": "data/chunks/JMRR-D-20-00004_R2_chunk174.txt",
    "text": "[2] M. Ciftdemir, M. Kaya, E. Selcuk, and E. Yalniz, Tumors of the spine, World J Orthop. 7(2) (2016) 109-116. [3] J. Bodnera, F. Augustina, H. Wykypiela, J. Fisha, G. Muehlmanna, G. Wetscherb, T. Schmida, The da Vinci robotic system for general surgical applications: a critical interim appraisal, Swiss Medical Weekly."
  },
  {
    "chunk_file": "data/chunks/pone.0047133_chunk26.txt",
    "text": "We will also make the assumption that the streamwise z-component of velocity (w) is a constant, and set by the cross-sectional area of the jet and the volume flow-rate. This assumption will generally hold if the streamwise pressure gradients are small, and the action of streamwise body forces (such as gravity) are also small."
  },
  {
    "chunk_file": "data/chunks/pone.0047133_chunk32.txt",
    "text": "The motion of these fluid elements is described by the unsteady incompressible Navier-Stokes equations in two dimen- sions, which are: r Du Dt ~{ Lp Lx zm L2u Lx2 z L2u Ly2 ! zrgx  4  r Dv Dt ~{ Lp Ly zm L2v Lx2 z L2v Ly2 !"
  },
  {
    "chunk_file": "data/chunks/JMRR-D-20-00004_R2_chunk148.txt",
    "text": "The numerical data of the end effector position (X, Y, and Z) was used to plot a 2-D/3-D representation of the end effector path (Figure 18-B) and volume (Figure 18- C). 8."
  },
  {
    "chunk_file": "data/chunks/JMRR-D-20-00004_R2_chunk79.txt",
    "text": "A 2-piece end collar (CL1, CL2) with a conical form is located at the end of each strut (S); so their cross-sectional area decreases towards the node point. This provides rigid support for the barrel and in turn the cord very near to the convergence point at the node."
  },
  {
    "chunk_file": "data/chunks/JMRR-D-20-00004_R2_chunk45.txt",
    "text": "The intrinsic structural efficiency of the space frame structure is compromised, as its struts now have to resist shear and bending forces, rather than simply FT and FC loads along their primary axes."
  },
  {
    "chunk_file": "data/chunks/286_chunk23.txt",
    "text": "When the cables are tightened via a threaded mechanism connected to the nut/tensioning screw (TC), the tip bends to form an approximate arc or J-shape, with the radius of the arc diminishing as the tension increases. Conversely, as the cable tension decreases, the adjustable tip resumes its default near-linear form."
  },
  {
    "chunk_file": "data/chunks/286_chunk37.txt",
    "text": "6. An illustration of the assembled surgical robot device installed in an operating theatre environment. A."
  },
  {
    "chunk_file": "data/chunks/JMRR-D-20-00004_R2_chunk51.txt",
    "text": "In order to create a geometric structure that is much closer in pure geometry to an octahedron, with all of the benefits of simplicity this would bring, it will be seen that the commonly- used 2DoF pin joints need to be replaced with a different joint configuration."
  },
  {
    "chunk_file": "data/chunks/1-s2.0-S1350453324001371-main_chunk173.txt",
    "text": "[22] Yen P-L, Davies BL. Active constraint control for image-guided robotic surgery. J Eng Med 2010;224:623 31. https://doi.org/10.1243/09544119JEIM606."
  },
  {
    "chunk_file": "data/chunks/JMRR-D-20-00004_R2_chunk86.txt",
    "text": "Concentricity It is acknowledged that the proposed joint design has less than perfect concentricity of the pivot points of the struts. Figure 8-B shows that the actual PP is not at the original convergence point (CP), but closer to the rounded contact point between the barrels (BN) at the ends of the struts."
  },
  {
    "chunk_file": "data/chunks/JMRR-D-20-00004_R2_chunk92.txt",
    "text": "This requirement is a consequence of the prone, facedown posture of the patient during the surgical procedure. The structure of the suspension system simply has to provide three rigid attachment points for the topmost triangular face of the octahedral robotic framework."
  },
  {
    "chunk_file": "data/chunks/1-s2.0-S1350453324001371-main_chunk167.txt",
    "text": "[15] Morad S, Jaffer Z, Dogramadzi S. Design of a wearable fingertip haptic device: investigating materials of varying stiffness for mapping the variable compliance platform. J Med Robot Res 2021;06:2150005. https://doi.org/10.1142/ S2424905x21500057."
  },
  {
    "chunk_file": "data/chunks/JMRR-D-20-00004_R2_chunk84.txt",
    "text": "7. Cross-section of struts tied together with cords Fig. 8."
  },
  {
    "chunk_file": "data/chunks/1-s2.0-S1350453324001371-main_chunk171.txt",
    "text": "J Mech Behav Biomed Mater 2023;137: 105553. https://doi.org/10.1016/j.jmbbm.2022.105553. [20] Sharp A, Pryor M. Virtual fixture generation for task planning with complex geometriesASME. J Comput Inf Sci Eng 2021;21. https://doi.org/10.1115/ 1.4049993."
  },
  {
    "chunk_file": "data/chunks/1-s2.0-S1350453324001371-main_chunk165.txt",
    "text": "[13] Abeywardena S, Yuan Q, Tzemanaki A, Psomopoulou E, Droukas L, Melhuish C, Dogramadzi S. Estimation of tool-tissue forces in robot-assisted minimally invasive surgery using neural networks. Front Robot AI 2019;6:56. https://doi.org/ 10.3389/frobt.2019.00056."
  },
  {
    "chunk_file": "data/chunks/JMRR-D-20-00004_R2_chunk90.txt",
    "text": "A parallel manipulator robotic platform has been designed that acts as a mount for the tools (T), and produces the desired range of movements. The octahedral platform is 6DoF parallel manipulator, which is comprised of a fixed top (FT), and a mobile base (MB), connected by six individually-powered extensible linear actuators (LA) or legs."
  },
  {
    "chunk_file": "data/chunks/1-s2.0-S1350453324001371-main_chunk159.txt",
    "text": "Sensors 2022;22:9770. https://doi.org/10.3390/s22249770. [7] Olivieri E, Barresi G, Caldwell DG, Mattos LS. Haptic Feedback for control and active constraints in contactless laser surgery: concept, implementation, and evaluation."
  },
  {
    "chunk_file": "data/chunks/286_chunk21.txt",
    "text": "Fig. 3. The Flexion system."
  },
  {
    "chunk_file": "data/chunks/JMRR-D-20-00004_R2_chunk47.txt",
    "text": "This rotation amounts to localized instability of the joint assembly. For the overall framework, the accumulation of these localized instabilities Samir Morad, Christian Ulbricht, Paul Harkin, Justin Chan, Kim Parker, Ravi Vaidyanathan 4 would lead to wider patterns of more pronounced and uncontrolled instability. 2.3."
  },
  {
    "chunk_file": "data/chunks/JMRR-D-20-00004_R2_chunk53.txt",
    "text": "As part of the growing interest in variable geometry truss structures within the robotic community since the 1990s, several research groups have been developing novel designs for truly concentric free-rotation joints (Fig. 6), such as those by [16,17]."
  },
  {
    "chunk_file": "data/chunks/286_chunk35.txt",
    "text": "The octahedral platform is a six degrees of freedom (6DOF) parallel manipulator, which is comprised of a fixed top (FT), and a mobile base (MB), connected by six individually-powered extensible linear actuators (LA) or  legs . The linear actuators are configured in an octahedral arrangement, commonly known as a Stewart Platform."
  },
  {
    "chunk_file": "data/chunks/pone.0047133_chunk24.txt",
    "text": "Because L is over an order of magnitude greater than Dmin, the radius of curvature in the streamwise direction will be much larger than the radius of curvature in the x-y plane (which will be approximately Dmin=2), and its contribution to the internal pressure within the jet is neglected."
  },
  {
    "chunk_file": "data/chunks/pone.0047133_chunk30.txt",
    "text": "Given these assumptions the steady-state incompressible Navier-Stokes equations at any streamwise plane along the jet axis become r u Lu Lx zv Lu Ly zw Lu Lz \u0002 \u0003 ~{ Lp Lx zm L2u Lx2 z L2u Ly2 ! zrgx  1  r u Lv Lx zv Lv Ly zw Lv Lz \u0002 \u0003 ~{ Lp Ly zm L2v Lx2 z L2v Ly2 !"
  },
  {
    "chunk_file": "data/chunks/1-s2.0-S1350453324001371-main_chunk92.txt",
    "text": "In other words, if the real-time position of the robot end effector is always equal to the corrected con  trol position signal, the end effector will never enter a restricted area because the corrected control position signal will never output an inadmissible signal."
  },
  {
    "chunk_file": "data/chunks/pone.0047133_chunk18.txt",
    "text": "The inital shape of the jet will closely match the aperture shape, and the surface tension will act to reduce the local surface curvature, thus accelerating the flow radially inwards in regions of high convex curvature. However, in order to conserve mass flux, the flow must also accelerate radially outwards elsewhere on the jet surface."
  },
  {
    "chunk_file": "data/chunks/JMRR-D-20-00004_R2_chunk162.txt",
    "text": "Surgical robot platform with a novel concentric joint for minimal invasive procedures 13 sufficient degree of elasticity to allow the struts to pivot. Testing of the line showed it elongated approx. 1.5mm when supporting a 5kg load."
  },
  {
    "chunk_file": "data/chunks/JMRR-D-20-00004_R2_chunk176.txt",
    "text": "[5] V. E. Gough, and S. G. Whitehall, Universal tyre test machine 1962. In Proc of the FISITA 9th Int Technical Cong, (Institution of Mechanical Engineers, 1962) pp. 117-137 [6] D. Stewart, 1965."
  },
  {
    "chunk_file": "data/chunks/1-s2.0-S1350453324001371-main_chunk86.txt",
    "text": "Otherwise, the constraint controller is involved to generate forces (f) that keep the system s output within the permissible region. Table 1 The five basic types of constraints."
  },
  {
    "chunk_file": "data/chunks/pone.0047133_chunk116.txt",
    "text": "Currie RJ (1998) The streamtest cup: a new uroflow device. Urology 52: 1118  21. 8. delaRosette JJMCH, Witjes WPJ, Debruyne FMJ, Kersten PL, Wijkstra H (1996) Improved reliability of uroflowmetry investigations: Results of a portable home-based uroflowmetry study."
  },
  {
    "chunk_file": "data/chunks/JMRR-D-20-00004_R2_chunk189.txt",
    "text": "Conf. Robotics and Automation (San Diego, CA, USA, 1994), pp. 1267-1272."
  },
  {
    "chunk_file": "data/chunks/pone.0047133_chunk102.txt",
    "text": "Individual data consisted of the maximum wavelength, the corresponding peak flow rate, the total voided volume and the subject s age."
  },
  {
    "chunk_file": "data/chunks/1-s2.0-S1350453324001371-main_chunk79.txt",
    "text": "There are five constraints: point limit, cuboid constraint, plane constraint, cylindrical constraint, and spherical constraint (Table 1)."
  },
  {
    "chunk_file": "data/chunks/1-s2.0-S1350453324001371-main_chunk51.txt",
    "text": "The user-side controller generates kinesthetic haptics (force feed  back) through the implementation of the 3DOF Novint Falcon haptic enabled controller (NF) to control the three translational inputs [30]. A graphical user interface (GUI) was generated to control the three rota  tional input values."
  },
  {
    "chunk_file": "data/chunks/Concentric joint connectors for form-changing space frames AM_chunk6.txt",
    "text": "These structures are comprised of multiple struts, arranged in a geometrically stable array, connected at their end points via the joints. Each strut, acting as part of a truss, can change in length (telescope), and thus their com- bined variations can change the overall form of the frame."
  },
  {
    "chunk_file": "data/chunks/1-s2.0-S1350453324001371-main_chunk45.txt",
    "text": "A position-sensitive diode sensing approach identifies misalignment, while a feed-forward feedback compound controller minimizes misalignment errors. The approach was experimentally validated on a three DOF planar micro/nano positioning stage, con  firming its capacity to give both linear and angular measurements."
  },
  {
    "chunk_file": "data/chunks/CASE15_0460_MS_chunk26.txt",
    "text": "The layout of the electronics used, along with the associated program code that implements full positional control of the platform, can be seen in Fig. 4. The figure illustrates how each electronic component is connected, powered electrically and controlled electronically from the input side through to the output side."
  },
  {
    "chunk_file": "data/chunks/CASE15_0460_MS_chunk32.txt",
    "text": "Component layout of the system Fig. 2. Stages of bending the flexion distal tip showing the angulation degree for each ascending stage, where EP is the end point of the end link (EL)."
  },
  {
    "chunk_file": "data/chunks/Concentric joint connectors for form-changing space frames AM_chunk76.txt",
    "text": "This would allow them to be smaller in overall diameter and cross-sectional area for a given yield value; the joint components could be more tightly compacted together, whilst still enabling sufficient freedom of movement."
  },
  {
    "chunk_file": "data/chunks/Concentric joint connectors for form-changing space frames AM_chunk62.txt",
    "text": "The degree of this elasticity would have to be chosen carefully, as it would need to balance sufficient  slackness  to allow the struts to pivot freely versus ensuring the strut ends maintain contact with one another. The elasticity would also have to be chosen to resist the forces acting on the joint i.e."
  },
  {
    "chunk_file": "data/chunks/JMRR-D-20-00004_R2_chunk200.txt",
    "text": "Surgical robot platform with a novel concentric joint for minimal invasive procedures 15 Ravi Vaidyanathan is a Reader in Biomechatronic in the Department of Mechanical Engineering at Imperial College London."
  },
  {
    "chunk_file": "data/chunks/JMRR-D-20-00004_R2_chunk6.txt",
    "text": "Despite these benefits, many challenges in their development remain, including how to improve instrument control and ergonomics whilst using rigid instrumentation with its associated fulcrum effects. Existing rigid instruments have restricted access to anatomical targets in- vivo and require well-planned incision points."
  },
  {
    "chunk_file": "data/chunks/JMRR-D-20-00004_R2_chunk7.txt",
    "text": "Consequently, it is still extremely challenging to utilize such devices in cases that involve complex anatomical pathways such as the spinal column [1]. Malignant spinal tumors are cancerous and they spread and destroy the tissue surrounding them."
  },
  {
    "chunk_file": "data/chunks/JMRR-D-20-00004_R2_chunk201.txt",
    "text": "He earned his Ph.D. in biologically inspired systems at Case Western Reserve University (USA) in 2001, and worked in industry through 2004, holding two directorships in control systems and medical engineering."
  },
  {
    "chunk_file": "data/chunks/Concentric joint connectors for form-changing space frames AM_chunk63.txt",
    "text": "the ten- sile/compressive forces imposed by the struts. 4.6 Failure of the joint It is possible that the joint would ultimately fail due to compression loading once the cord elongated to such a degree that the tip of one strut passed be- yond that of the others, leading to two eventualities."
  },
  {
    "chunk_file": "data/chunks/Concentric joint connectors for form-changing space frames AM_chunk77.txt",
    "text": "5.4 Early applications and future plans The joints as manufactured (Figure 13) performed very well as part of the octahedral form-changing space frame (Figure 5) and a prototype hexapod ma- nipulator surgical platform developed with Morad (2014) at Imperial College London."
  },
  {
    "chunk_file": "data/chunks/CASE15_0460_MS_chunk33.txt",
    "text": "Fig. 1. A 3-3 parallel manipulator with mounted flexible unit at the end effector (left), and the attachment of the stepper motor to the tensioning screw of the flexible tip via an adapter (right)."
  },
  {
    "chunk_file": "data/chunks/CASE15_0460_MS_chunk27.txt",
    "text": "The orientation and position of the flexible probe in 6DoFs is specified by the user. It is then necessary to calculate the required leg lengths of each of the six platform legs in order for the robot platform to impose the desired orientation of its end-effector."
  },
  {
    "chunk_file": "data/chunks/1-s2.0-S1350453324001371-main_chunk44.txt",
    "text": "[27] describes a novel approach for sensing position and orientation in micro/nano positioning stages with three planar degrees of freedom (DOF). To prevent misalignment, the mech  anism is counter-rotated utilizing a laser interferometry-based sensing approach."
  },
  {
    "chunk_file": "data/chunks/Concentric joint connectors for form-changing space frames AM_chunk7.txt",
    "text": "The joints enable multiple struts to be connected together and pivot around each node point. The joints have near-perfect concentricity of rotation around the node point, which enables the tension and compression forces of the struts to be resolved in a structurally- efficient manner."
  },
  {
    "chunk_file": "data/chunks/1-s2.0-S1350453324001371-main_chunk50.txt",
    "text": "The SRP was mounted on a cuboid frame, inverted to mimic the way it would be positioned in the operation theatre, above the patient [28]. The mobile plate of the SRP has a surgical probe attached to it. It has a high-pressure water jet tool that can be used to remove human tissue, and is intended to be introduced in detail in a separate paper."
  },
  {
    "chunk_file": "data/chunks/pone.0047133_chunk103.txt",
    "text": "The patients,were at various stages of treatment with an alpha-1 receptor blocker (Tamsulosin) and/or an alpha-reductase inhibitor (Finasteride) to reduce the size of the prostate, such that some had regained a more normal peak flow rate (w10mL:s{1) at the time of the trial."
  },
  {
    "chunk_file": "data/chunks/JMRR-D-20-00004_R2_chunk188.txt",
    "text": "336- 341. [17] G. Hamlin, and A. C. Sanderson, A Novel Concentric Multilink Spherical Joint with Parallel Robotics Applications, in Proc. Int."
  },
  {
    "chunk_file": "data/chunks/1-s2.0-S1350453324001371-main_chunk78.txt",
    "text": "Constrain set To test the control loop, a virtual environment is created with basic constraints. Through modifying the constraint set by which the CC samples, the output of the haptic device and the robot platform can be controlled. In [23], the methods of superposition and linear combination can be used to define any boundary system."
  },
  {
    "chunk_file": "data/chunks/pone.0047133_chunk117.txt",
    "text": "British Journal of Urology 78: 385 390. 9. Eggers J, Villermaux E (2008) Physics of liquid jets."
  },
  {
    "chunk_file": "data/chunks/JMRR-D-20-00004_R2_chunk177.txt",
    "text": "A Platform with six degree of freedom. In Proc Instn Mech Engrs (UK, 1965)180: p. 371-386. [7] K.L."
  },
  {
    "chunk_file": "data/chunks/1-s2.0-S1350453324001371-main_chunk87.txt",
    "text": "Constraint type Description Example of physical uses Point limit Limits the robot end effector to a particular point A set of point limits can be superimposed to create a 3D path Cuboid Constraint Restricts the robot to motion within a cuboid- shaped region Used to define the robot s workspace Plane Constraint Prevent the robot from penetrating a plane A combination of planes can be generated to recreate a particular environment Cylindrical Constraint Confines the robot to a cylindrical region Linear combination with point limit to give hard and soft constraint for motion along a path Spherical Constraint Defines a critical spherical region Limiting the robot s functional space to a 3D curved surface S. Morad et al."
  },
  {
    "chunk_file": "data/chunks/pone.0047133_chunk19.txt",
    "text": "Thus, along the axis of the jet, the jet surface forms a wave-like pattern with displacements in orthogonal directions (x, y). The wavelength (L) of these oscillations is dependent on the jet flow rate, aperture geometry and surface tension (T)."
  },
  {
    "chunk_file": "data/chunks/1-s2.0-S1350453324001371-main_chunk93.txt",
    "text": "Thus, the robot s trajectory monitoring is achieved by incorporating a closed-loop feedback mechanism. In this case, a proportional-integral- derivative (PID) controller was implemented to ensure that the robotic platform s leg lengths increase to the desired length in the optimal time. This is illustrated by signal h in Fig."
  },
  {
    "chunk_file": "data/chunks/JMRR-D-20-00004_R2_chunk163.txt",
    "text": "The combined weight of the platform and the Articulated Distal Tip Tool is approximately 8kg. Even allowing for some dynamic loading, the cords are never loaded beyond their breaking stresses, especially as the weight of the platform and tool is distributed between three connection points on each of the upper and lower platforms."
  },
  {
    "chunk_file": "data/chunks/pone.0047133_chunk31.txt",
    "text": "zrgy  2  Lu Lx z Lv Ly ~0  3  Where r,m,p are the fluid density, viscosity and pressure, respectively, and gx,gy represent body forces (such as surface tension) acting on the fluid elements. Now consider elements of fluid within a two-dimensional droplet which is deforming in time (t) under the action of surface tension."
  },
  {
    "chunk_file": "data/chunks/pone.0047133_chunk25.txt",
    "text": "Similarly, the gradients in pressure along the axis of the jet will be at least an order of magnitude smaller than pressure gradients within the x-y plane and so we neglect streamwise pressure gradients. Therefore the pressure within the jet is assumed to be solely due to the curvature of the surface in the x-y plane."
  },
  {
    "chunk_file": "data/chunks/JMRR-D-20-00004_R2_chunk52.txt",
    "text": "The preferred joint type would allow adjacent pairs of telescopic struts to share a common connection point with the rigid plates (thus three components are connected), and this same point would act as a center of rotation for the end points of the struts."
  },
  {
    "chunk_file": "data/chunks/286_chunk34.txt",
    "text": "To overcome this, a parallel manipulator robotic platform, which is also called the octahedral platform [11] (OP), has been designed that acts as a mount for the tools (T), and produces the desired range of movements."
  },
  {
    "chunk_file": "data/chunks/286_chunk20.txt",
    "text": "It is primarily formed from a  5mm hollow round shaft (R) of 1.4301 surgical steel, which extends virtually the full length of the instrument. A handle (H) near the proximal end is formed from polyphenylsulfone (PPSU) plastic material. A revolving nut/tensioning screw (TC) is located beyond the handle at the proximal end."
  },
  {
    "chunk_file": "data/chunks/JMRR-D-20-00004_R2_chunk46.txt",
    "text": "Should the loads on the struts (S) change to FT (blue arrow), the central connection will rotate back in the opposite direction (blue rotated arrow), as the struts exert a pulling force upon it via the ball/socket joints. This rotation could be sudden, and difficult for any control system to predict."
  },
  {
    "chunk_file": "data/chunks/1-s2.0-S1350453324001371-main_chunk158.txt",
    "text": "Berlin: Springer; 2008. p. 719 39. [6] Batty T, Ehrampoosh A, Shirinzadeh B, Zhong Y, Smith J. A transparent teleoperated robotic surgical system with predictive haptic feedback and force modelling."
  },
  {
    "chunk_file": "data/chunks/JMRR-D-20-00004_R2_chunk91.txt",
    "text": "The octahedral platform is intended to be suspended from a rigid structure (RS) located above the prone patient (P). 4.2. Configuration of the surgical platform The robot manipulator was designed such that it will be suspended from a fixed structure located above the patient."
  },
  {
    "chunk_file": "data/chunks/1-s2.0-S1350453324001371-main_chunk164.txt",
    "text": "Int J Med Robot 2014;10:11 21. https://doi.org/10.1002/rcs.1503. [12] Shin J, Zhong Y, Gu C. Master-slave robotic system for needle indentation and insertion. Comput Assist Surg (Abingdon) 2017;22:100 5. https://doi.org/ 10.1080/24699322.2017.1379236."
  },
  {
    "chunk_file": "data/chunks/1-s2.0-S1350453324001371-main_chunk170.txt",
    "text": "Int J Robust Nonlinear Control 2023:1 13. https://doi.org/10.1002/rnc.6742. [19] Song J, Xie H, Zhong Y, Gu C, Choi KS. Maximum likelihood-based extended Kalman filter for soft tissue modelling."
  },
  {
    "chunk_file": "data/chunks/JMRR-D-20-00004_R2_chunk85.txt",
    "text": "Cross-section of tapering cord joint. (A) aliened strut, (B) pivoting strut. Surgical robot platform with a novel concentric joint for minimal invasive procedures 7 3.6."
  },
  {
    "chunk_file": "data/chunks/pone.0047133_chunk3.txt",
    "text": "For healthy volunteers, self estimation of the flow shape provided an accurate estimation of peak flow rate (+2%). However for the patients, the relationship between shape and flow rate suggested poor meatal opening during voiding."
  },
  {
    "chunk_file": "data/chunks/286_chunk84.txt",
    "text": "Instead of low-cost DC motors, pneumatic actuators or higher- torque/higher-geared servo motors could be used. These alternatives would almost certainly give improved response times, whilst still delivering sufficient accuracy and rigidity for the intended surgical application. VII."
  },
  {
    "chunk_file": "data/chunks/1-s2.0-S1350453324001371-main_chunk117.txt",
    "text": "The software debouncer was implemented by introducing a simple timer script that waits 3.0 ms every time the interrupt is called before checking the signal again to ascertain if the signal was noise; disregarding it if it is. Individual functional cells were tested for accuracy and robustness before being assembled into the robot."
  },
  {
    "chunk_file": "data/chunks/1-s2.0-S1350453324001371-main_chunk103.txt",
    "text": "3.2.2. Permissible threshold Fig. 8 shows that the robot s real-time trajectory does not exactly match the control signal trajectory ucor."
  },
  {
    "chunk_file": "data/chunks/286_chunk90.txt",
    "text": "Grant, S. Gallinger, B.R. Taylor, P.D. Greig, Water-jet dissection for parenchymal division during hepatectomy."
  },
  {
    "chunk_file": "data/chunks/286_chunk47.txt",
    "text": "The joints (Fig.9) consist of a number of sub- assemblies (SA), which each connect to the ends of the linear actuators (LA), or legs, and the mobile base (MB). A flexible, slightly elastic cord (C) passes through each subassembly. The cord is precisely adjusted via a threaded mechanism (TM) to pre-tension it."
  },
  {
    "chunk_file": "data/chunks/JMRR-D-20-00004_R2_chunk21.txt",
    "text": "Few parallel robotic systems have spinal applications, those that do have been developed for the positioning of pedicle screws [11]. Another system was developed for the replacement of cervical artificial discs [12]."
  },
  {
    "chunk_file": "data/chunks/JMRR-D-20-00004_R2_chunk35.txt",
    "text": "The near-concentric node joints examined in this paper were originally developed for this type of form-changing space frame. However, this paper focuses on the parallel hexapod manipulator configuration featuring rigid upper and lower plates, where the use of near-concentric node joints still offers intrinsic advantages [15]. 2."
  },
  {
    "chunk_file": "data/chunks/286_chunk53.txt",
    "text": "10. Code structure. The position of the end-effector is specified by the input controller."
  },
  {
    "chunk_file": "data/chunks/JMRR-D-20-00004_R2_chunk104.txt",
    "text": "1, it will be seen that the tumors that are the device s target are typically less than approximately 100mm in length along the axis of the spinal column. Therefore, it was decided that the surgical cutting tool (T) needs to access a section of the vertebral cavity only approximately 120mm in length, rather than the full 700mm of the spinal column."
  },
  {
    "chunk_file": "data/chunks/JMRR-D-20-00004_R2_chunk110.txt",
    "text": "12, the single-portion actuator comprises only two main groups of components: an outer, cylindrical  barrel  (B) and a corresponding inner  piston  (P). The ratio of the fully-retracted/fully-extended length of the whole assembly should be 1:2. However, this is only a theoretical ratio, as it is usually a slightly lower ratio (typically Fig."
  },
  {
    "chunk_file": "data/chunks/pone.0047133_chunk42.txt",
    "text": "Both the experimental and computational modeling show a very similar positive linear relationship between flow rate (Q) and wavelength (L) for a given orifice (Fig. 4)."
  },
  {
    "chunk_file": "data/chunks/JMRR-D-20-00004_R2_chunk138.txt",
    "text": "In order to progress further into the analysis, it is important to define two separate coordinate systems; the fixed Cartesian coordinate system X, Y and Z which are attached to the base and has its origin at the center of the base, and the end-effector coordinates system x, y and z attached to the end-effector with its origin located at the geometric center of the top plate."
  },
  {
    "chunk_file": "data/chunks/pone.0047133_chunk56.txt",
    "text": "doi:10.1371/journal.pone.0047133.g002 Figure 3. Computational modelling solves the 3-dimensional jet flow from a wide range of orifice shapes. Two examples are shown here for aspect ratios (Dmax=Dmin) of 3 and 6, and Dmin~2:0mm, Q~1:2l=m."
  },
  {
    "chunk_file": "data/chunks/1-s2.0-S1350453324001371-main_chunk37.txt",
    "text": "The mechanical constraint was further developed to be used in knee replacement surgery. Three zones were defined for bone removal. A robot in a safe zone I can be moved by an operator."
  },
  {
    "chunk_file": "data/chunks/1-s2.0-S1350453324001371-main_chunk23.txt",
    "text": "This robotic device can characterise touch interactions with soft tissue. For robotic indentation and needle inser  tion, a bilateral controller with a linear motor is used."
  },
  {
    "chunk_file": "data/chunks/pone.0047133_chunk81.txt",
    "text": "(d) The resulting plot of wavelength, L, versus flow rate, Q, shows a clear correlation. Note that the relationship is non-linear due to the changes in the meatal opening. doi:10.1371/journal.pone.0047133.g005 Figure 6."
  },
  {
    "chunk_file": "data/chunks/286_chunk101.txt",
    "text": "[11] N. Rojas, F. Thomas., The octahedralmanipulator revised,. IEEE International Conference on Robotics and Automation,, 2012: p. 2293-2298,St."
  },
  {
    "chunk_file": "data/chunks/pone.0047133_chunk95.txt",
    "text": "Thus this technique can provide a simple non-invasive method for monitoring peak urine flow rate as part of the recommended practise of watchful waiting for patients with benign prostatic hyperplasia [17 20] Materials and Methods Ethics statement All volunteers gave signed consent to the trial which was approved by the local ethics committee at Queen Mary University of London (Ethics Application No."
  },
  {
    "chunk_file": "data/chunks/Concentric joint connectors for form-changing space frames AM_chunk10.txt",
    "text": "wholly via tension forces (FT) or compression forces (FC) along the axes of the struts forming the frame, with little or no shear or bending forces acting upon the struts. Thus the struts only have to resist elonga- tion from tension, or buckling due to compression. This leads to a very efficient structure for a given quantity of material, i.e."
  },
  {
    "chunk_file": "data/chunks/CASE15_0460_MS_chunk68.txt",
    "text": "The depth of water jet cut as a function of nozzle s orifice diameter and the time of applied water jet under flow pressure of 20 bars Fig. 15. A plot showing the combination of experimental water jet data and active regional constraint (haptic feedback)."
  },
  {
    "chunk_file": "data/chunks/CASE15_0460_MS_chunk40.txt",
    "text": "Considering a sphere with radius r and cantered about the origin O, as shown in Fig.6. The polar equations for the sphere are numbered 1-3, and an example of constraints set for spherical region is listed in table 1: B. Trajectory Supervision The trajectory supervision of the robot is achieved by integrating a control loop feedback mechanism."
  },
  {
    "chunk_file": "data/chunks/Concentric joint connectors for form-changing space frames AM_chunk38.txt",
    "text": "the vertices/nodes), in order to transfer loads efficiently and within a com- pact form. Yet the relative movement of more than two connected struts around a shared pivot point (i.e."
  },
  {
    "chunk_file": "data/chunks/CASE15_0460_MS_chunk54.txt",
    "text": "The most important for plain water jet cutting are: water pressure, orifice diameter, nozzle stand-off distance, and the time of cut. These parameters were experimentally measured. The experimental set up is demonstrated in Fig.10 where a piece of cow topside is used as an object."
  },
  {
    "chunk_file": "data/chunks/CASE15_0460_MS_chunk83.txt",
    "text": "In this paper we established and proposed the first step in the development of a system that implementing a haptic method of controlling the depth of water jet cut. The next step is to advance the testing and the modelling of the haptically controlling the depth of water jet cut. REFERENCES [1] D.A."
  },
  {
    "chunk_file": "data/chunks/CASE15_0460_MS_chunk97.txt",
    "text": "Engineering in Medicine, 2010. 224 part H(special issue paper): p. 623-631. [14] S. Morad, C.Ulbricht, P. Harkin, J.Chan, K. Parker, and R. Vaidyanathan."
  },
  {
    "chunk_file": "data/chunks/CASE15_0460_MS_chunk96.txt",
    "text": "[13] P-L. Yen, B.L.Davies., Active constraint control for image-guided robotic surgery. J."
  },
  {
    "chunk_file": "data/chunks/CASE15_0460_MS_chunk82.txt",
    "text": "Successful feasibility tests, modelling, and simulations were all undertaken. We developed and test a method to determine the depth of water jet cut such that it does not affect (hit) the surrounding tissues. A working positional control structure that incorporates haptic technology in a flexible surgical robotic device was presented."
  },
  {
    "chunk_file": "data/chunks/Concentric joint connectors for form-changing space frames AM_chunk39.txt",
    "text": "concentricity) results in the connecting material or mechanism of each strut attempting to overlap in space with the other connections, and the capability for movement can be lost."
  },
  {
    "chunk_file": "data/chunks/CASE15_0460_MS_chunk55.txt",
    "text": "The depth of cut was measured using a digital caliper with a blunt needle fixed at the tip of the caliper. The first test was conducted to test the effect of the pressure on the depth of cut by varying the source pressure (10-25 bars) over a period of 5s keeping the nozzle stand- off distance constant at 3.9 mm (Fig. 11)."
  },
  {
    "chunk_file": "data/chunks/CASE15_0460_MS_chunk41.txt",
    "text": "In this case a Proportional-Integral-Derivative (PID) controller was implemented to ensure that the robot platform leg lengths extend to the desired length in the ideal time. This is illustrated by the signal h in the Fig. 5."
  },
  {
    "chunk_file": "data/chunks/CASE15_0460_MS_chunk69.txt",
    "text": "Preprint submitted to 2015 IEEE International Conference on Automation Science and Engineering. Received March 20, 2015. prevents the tool, in this case the water jet nozzle, from entering the forbidden region."
  },
  {
    "chunk_file": "data/chunks/Concentric joint connectors for form-changing space frames AM_chunk11.txt",
    "text": "they have excellent strength-to-weight ratios. Figure 3."
  },
  {
    "chunk_file": "data/chunks/pone.0047133_chunk94.txt",
    "text": "However despite the associated scatter there was still a statistically significant correlation between Qmax and Lmax for healthy volunteers, showing that an individual s peak urine flow rate can be estimated from self measurement of maximum wavelength."
  },
  {
    "chunk_file": "data/chunks/286_chunk100.txt",
    "text": "Salisbury., Robotic technology in surgery: past, present, and future. The American Journal of Surgery, 2004. 188: p. 2s-15s."
  },
  {
    "chunk_file": "data/chunks/pone.0047133_chunk80.txt",
    "text": "(c) The opening of the urethral orifice during voiding was quantified by the minimum diameter of the meatal ellipse (Dmin) measured from the video images. The size and shape of the orifice is also characterised by the dilation parameter L=Q, such that a reduction in L=Q corresponds to an increase in opening."
  },
  {
    "chunk_file": "data/chunks/1-s2.0-S1350453324001371-main_chunk22.txt",
    "text": "Additionally, the device can change the direction in which it grasps the patient s body. A master-slave robotic system for needle indentation and insertion is described by Shin et al. [12]."
  },
  {
    "chunk_file": "data/chunks/1-s2.0-S1350453324001371-main_chunk36.txt",
    "text": "It is necessary to \"anchor\" the created active constraint border to the tissue of the operated patient. By doing this, the produced geometry can be localised by any registered robotic system. During the development of a prostatectomy robot, an active constraint theory was put into practice [22]."
  },
  {
    "chunk_file": "data/chunks/pone.0047133_chunk57.txt",
    "text": "doi:10.1371/journal.pone.0047133.g003 The Biophysics of the Urine Stream PLOS ONE | www.plosone.org 3 October 2012 | Volume 7 | Issue 10 | e47133 models. Results show a typical temporal profile, such that the flow rate increases to a maximum value of 20{25 mL:s{1 and then gradually reduces over the course of the void (Fig. 5(b))."
  },
  {
    "chunk_file": "data/chunks/pone.0047133_chunk43.txt",
    "text": "It was Lord Rayleigh [13] who first suggested that the characteristic wavelength (L) of a non-cylindrical liquid stream was directly proportional to the flow rate (Q) for small amplitude capillary waves, although this has never been discussed with relation to urine flow."
  },
  {
    "chunk_file": "data/chunks/JMRR-D-20-00004_R2_chunk139.txt",
    "text": "The position of the end-effector is denoted by P and given by the expression:  = [     ]  (1) It follows from the kinematics of each leg that the closed loop position vector equations are given by: Table 1. Description of the notations used in the calculation of the inverse kinematics."
  },
  {
    "chunk_file": "data/chunks/JMRR-D-20-00004_R2_chunk111.txt",
    "text": "11. Surgical tool (T) working envelope relative to vertebral cavity (VC). (FT) fixed top, (LA) linear actuators, (MB) mobile base, (HF) hook-like form, (P) patient, (S) approximate sphere, and (OP) octahedral platform."
  },
  {
    "chunk_file": "data/chunks/JMRR-D-20-00004_R2_chunk105.txt",
    "text": "This helped to simplify the mechanism, and prioritized end effector accuracy within a smaller working envelope. Taking the spinal column as being very approximately cylindrical in form, and based on the dimensions as above, the end-effector working envelope was established as an approximate sphere (S) of 120mm diameter."
  },
  {
    "chunk_file": "data/chunks/JMRR-D-20-00004_R2_chunk34.txt",
    "text": "A widely-used version of this type of structure is the Gough/Stewart Platform [5]. Since the 1990s, there has been growing interest in frames comprised entirely of telescopic struts, with no rigid sections, which are inherently able to assume a wide variety of forms."
  },
  {
    "chunk_file": "data/chunks/286_chunk52.txt",
    "text": "The structure of the code used to process the user input into meaningful motion of the platform is shown in Fig. 10 and was written in MATLAB. Fig."
  },
  {
    "chunk_file": "data/chunks/286_chunk46.txt",
    "text": "Primarily to simplify the kinematics, near-concentric (within 1-2mm), passive, free-rotation, multi-leg joints [12] are used. These were originally developed for use in variable-geometry space frames."
  },
  {
    "chunk_file": "data/chunks/JMRR-D-20-00004_R2_chunk20.txt",
    "text": "Much work has been done comparing the two main robot configurations; in summary, serial manipulators have a larger working envelope in relation to their overall size [10], whereas parallel manipulators offer positional accuracy of the end effector, and smaller mobile mass than serial ones, thus allowing faster and more precise manipulations that are generally more suitable for medical applications."
  },
  {
    "chunk_file": "data/chunks/1-s2.0-S1350453324001371-main_chunk102.txt",
    "text": "As a result, a red line represents the robotic end effector s path through the prohibited area. To avoid this, the input velocity must be limited to be below the critical value at all times. This is done by incorporating a velocity limit constraint that generates a haptic force that slows the user down if the critical velocity is exceeded."
  },
  {
    "chunk_file": "data/chunks/286_chunk91.txt",
    "text": "HPB (Oxford), 2006. 8(5): p. 377-85. [4] K. Schwieger, R. Rentzsch, A. Becker, N. Bishop, E. Hille, H. Louis, M. Morlock, M. Honl, Abrasive water jet cutting as a new procedure for cutting cancellous bone--in vitro testing in comparison with the oscillating saw."
  },
  {
    "chunk_file": "data/chunks/286_chunk85.txt",
    "text": "CONCLUSION We have developed a surgical robotic system that could be used in spinal surgery procedures, with promising early results. Successful feasibility tests, modelling, and simulations were all undertaken."
  },
  {
    "chunk_file": "data/chunks/1-s2.0-S1350453324001371-main_chunk116.txt",
    "text": "There are two ways of eliminating the signal noise: hardware filter, also known as debouncer circuits, and software filter. Both methods were employed in the control structure to ultimately produce a robust and accurate encoder."
  },
  {
    "chunk_file": "data/chunks/pone.0047133_chunk2.txt",
    "text": "We find that the shape of the stream can be used as an indicator of both the flow rate and orifice geometry. We performed volunteer trials which showed these fundamental correlations are also observed in vivo for male healthy volunteers and patients undergoing treatment for low flow rate."
  },
  {
    "chunk_file": "data/chunks/1-s2.0-S1350453324001371-main_chunk128.txt",
    "text": "This allows the surgeon to control the robotic end effector at the microscopic level by scaling down the macroscopic movements of the system input device. An example of what the logic of the scaling code would look like is shown in Fig. 13."
  },
  {
    "chunk_file": "data/chunks/pone.0047133_chunk0.txt",
    "text": "The Shape of the Urine Stream   From Biophysics to Diagnostics Andrew P. S. Wheeler1*, Samir Morad2, Noor Buchholz3, Martin M. Knight2 1 Engineering and the Environment, University of Southampton, Southampton, United Kingdom, 2 School of Engineering and Materials Science, Queen Mary University of London, London, United Kingdom, 3 Department of Urology, Newham University Hospital, Plaistow, London, United Kingdom Abstract We develop a new computational model of capillary-waves in free-jet flows, and apply this to the problem of urological diagnosis in this first ever study of the biophysics behind the characteristic shape of the urine stream as it exits the urethral meatus."
  },
  {
    "chunk_file": "data/chunks/286_chunk93.txt",
    "text": "Tschan, J.K. Krauss, J. Oertel, First experimental results with a new waterjet dissector: Erbejet 2. Acta Neurochir (Wien), 2009. 151(11): p. 1473-82."
  },
  {
    "chunk_file": "data/chunks/1-s2.0-S1350453324001371-main_chunk100.txt",
    "text": "Medical Engineering and Physics 132 (2024) 104236 6 In the figure, two different instances of the system response trajectory are shown. The green line trajectory corresponds to input speeds below the critical speed."
  },
  {
    "chunk_file": "data/chunks/1-s2.0-S1350453324001371-main_chunk114.txt",
    "text": "When the quadrature encoder is rotated, it acts like two switches producing cyclical outputs operating at 90 out of phase with one another. It is this phase shift that allows the software to determine if the shaft is rotating clockwise or anticlockwise. These switches produce noise when they latch on and latch off."
  },
  {
    "chunk_file": "data/chunks/286_chunk87.txt",
    "text": "Spinal Tumors. Available: http://spinephysiciansinstitute.com/conditions-view/spinal-tumors/. Last accessed 17th Jul 2014."
  },
  {
    "chunk_file": "data/chunks/286_chunk78.txt",
    "text": "The overall depth of cut would then be the distance moved by the moving nozzle added to the effective cutting depth of the jet at the pressure as set. Testing of the water-jet shape showed that the spray pattern of the output jet affected its cutting ability."
  },
  {
    "chunk_file": "data/chunks/286_chunk50.txt",
    "text": "Connector joint assemblies, shown in (a) section and (b) side view. B. The design of the control system The control system comprises two main elements: the electronic hardware, and its programming language."
  },
  {
    "chunk_file": "data/chunks/JMRR-D-20-00004_R2_chunk36.txt",
    "text": "The Design of the Concentric Joint 2.1. Requirements for the joint In a form-changing space frame, the struts can change length independently of one another. Therefore, at each node point, a joint is required where at least 3 struts need to pivot with 3 degrees of freedom (3DoF) around the nodes where the ends of the struts are connected."
  },
  {
    "chunk_file": "data/chunks/JMRR-D-20-00004_R2_chunk22.txt",
    "text": "However, the authors are not aware of any previous studies which have investigated or even mentioned the use of parallel robots for the resection of spinal tumors. In this paper a 6DoF parallel robot has been designed to guide and position a surgical tool for the resection of spinal tumor surrounding the spinal column."
  },
  {
    "chunk_file": "data/chunks/286_chunk44.txt",
    "text": "Fig. 8. Variable length linear actuator."
  },
  {
    "chunk_file": "data/chunks/pone.0047133_chunk69.txt",
    "text": "6, red region). Nonetheless, meatal dilation also appeared to be reduced in patients that have regained a more normal flow rate (Fig. 6, yellow region)."
  },
  {
    "chunk_file": "data/chunks/JMRR-D-20-00004_R2_chunk113.txt",
    "text": "(P) Piston, (B) barrel, (M) motor, (G) gear, and (S) switch. Surgical robot platform with a novel concentric joint for minimal invasive procedures 9 1: 1.7). Typically this is due to there being portions of the overall length of the actuator that do not fully retract into the barrel (e.g."
  },
  {
    "chunk_file": "data/chunks/JMRR-D-20-00004_R2_chunk107.txt",
    "text": "Robot Platform: Detailed Design Based on the above-mentioned octahedral configuration, and to create a device that was considerably lower-cost than those that are commercially available, a simplified design of the platform was developed for the moveable mounting platform for the surgical tool. 5.1."
  },
  {
    "chunk_file": "data/chunks/pone.0047133_chunk55.txt",
    "text": "(a) Computational fluid dynamics (CFD) indicates the pressure distribution and shape of a liquid stream exiting from an elliptical orifice such as the urethral meatus. (b) Experimental models with a rigid walled elliptical orifice produced the characteristic flow pattern of the urine stream (Dmin~2mm, Q~1:2l=m)."
  },
  {
    "chunk_file": "data/chunks/pone.0047133_chunk41.txt",
    "text": "The computational and experimental models both produce flow patterns which show a characteristic initial wavelength (L) representing the distance between the orifice and the first pinch point as shown in Figure 2. Further examples of computed jet flows are shown in Fig. 3."
  },
  {
    "chunk_file": "data/chunks/1-s2.0-S1350453324001371-main_chunk20.txt",
    "text": "[9] demonstrated the use of SimPS-Net, a monocular RGB (Red-Green-Blue) camera-based network, that can recognise and locate surgical instruments in three dimensions, to generate and enforce active constraints [10]. Real-time network deployment was done in order to define boundaries. Later on, this boundary was employed to test constraint enforcement."
  },
  {
    "chunk_file": "data/chunks/1-s2.0-S1350453324001371-main_chunk34.txt",
    "text": "Active constraints It is typically assumed when examining the active constraint defi  nition process that the constraint geometry has either been defined a priori or can be produced using a generated point-cloud [20]. Creating and combining primitive shapes (such as spheres, cylinders, etc.) is another common application."
  },
  {
    "chunk_file": "data/chunks/pone.0047133_chunk96.txt",
    "text": "QMREC2009/18). Healthy volunteers were recruited from staff and students within the University. Patients were assessed for urine flow rate as part of their standard on-going clinical treatment/monitoring for bladder outlet obstruction associated with benign prostatic enlargement as described in the text."
  },
  {
    "chunk_file": "data/chunks/286_chunk102.txt",
    "text": "Paul, Minn, USA. [12] P. Harkin, Adjustable Structures, WIPO PCT patent application WO2014006422 (A2), 2014, claim 12: p. 34, UK. [13] Z. Shao, and L. Wang, Optimum Design of 3-3 Stewart Platform Considering Inertia Property."
  },
  {
    "chunk_file": "data/chunks/pone.0047133_chunk82.txt",
    "text": "Self measurement of the maximum wavelength provides an estimate of the peak urine flow rate for healthy males, but requires individual calibration for patients under- going treatment for urethral obstruction."
  },
  {
    "chunk_file": "data/chunks/Concentric joint connectors for form-changing space frames AM_chunk13.txt",
    "text": "If the frame is double-layered, up to 12 struts converge at the nodes for either arrangement."
  },
  {
    "chunk_file": "data/chunks/CASE15_0460_MS_chunk57.txt",
    "text": "10. Experimentally measuring the depth of the water jet cut, experimental setup (left), and a hole drilled by the water jet on an animal tissue (right). Fig."
  },
  {
    "chunk_file": "data/chunks/CASE15_0460_MS_chunk43.txt",
    "text": "When the rate of change of the input targets is critically high, the system will not have enough time to respond to the target orientations in an acceptable manner. To illustrate this, Fig.7 shows the same path inputs of Ucor in black arrows. The green trajectory is for an input velocity which is below the critical velocity."
  },
  {
    "chunk_file": "data/chunks/CASE15_0460_MS_chunk94.txt",
    "text": "IEEE Transactions on Robotics and Automation, 2003. 19(5): p. 893 - 901. [11] A.M. Okamura, Haptic Feedback in Robot-Assisted Minimally Invasive Surgery."
  },
  {
    "chunk_file": "data/chunks/CASE15_0460_MS_chunk80.txt",
    "text": "However, the effectiveness of the above parameters is dependent on the type and the mechanical properties of the target tissue such as the tensile strength, compressive strength, modulus of elasticity and hardness. An increase in any of these properties will increase the strength of the material and thus the resistance to a water jet."
  },
  {
    "chunk_file": "data/chunks/CASE15_0460_MS_chunk81.txt",
    "text": "Therefore, would be necessary to specify the properties of targeted tissue in order to apply the water jet system in surgical environments safely. VII. CONCLUSION We have developed a surgical robotic system that could be used in spinal surgery procedures, with promising early results."
  },
  {
    "chunk_file": "data/chunks/CASE15_0460_MS_chunk95.txt",
    "text": "Curr Opin Urol, 2009. 19(1): p. 102 107. [12] H. Xina, J.S.Zeleka, H. Carnahanb, Laparoscopic surgery, perceptual limitations and force: A review, in First Canadian Student Conference on Biomedical Computing2006: Kingston, Ontario, Canada."
  },
  {
    "chunk_file": "data/chunks/CASE15_0460_MS_chunk42.txt",
    "text": "The constraint controller incorporates an additional two constraint sets: the first, a velocity limit set and the second, an allowable threshold set. The system requires time to accelerate and decelerate to reach a target orientation."
  },
  {
    "chunk_file": "data/chunks/CASE15_0460_MS_chunk56.txt",
    "text": "Secondly, the stand- off distance of the water jet nozzle was varied (3.9-23.3 mm) for a selected set of pressures (10-25 bar) that were kept constant over the same period of applied water jet (Fig. 12). Fig."
  },
  {
    "chunk_file": "data/chunks/Concentric joint connectors for form-changing space frames AM_chunk12.txt",
    "text": "Space frame node   rigid joint detail It will be seen that there are at least 3 struts con- verging at any of the nodes within a space frame, and this can increase to 8 in a pyramidal/tetrahedral arrangement of the frame, or 9 struts in the tetrahe- dral/octahedral frame, both shown in Figure 1."
  },
  {
    "chunk_file": "data/chunks/pone.0047133_chunk83.txt",
    "text": "(a) Plot of Lmax versus Qmax showing a statistically significant positive correlation for healthy men (pv0:05, solid line) but not for the patient cohort (dashed line). A peak flow rate v10mL=s was considered as abnormally low (red region)."
  },
  {
    "chunk_file": "data/chunks/286_chunk103.txt",
    "text": "Advances in Mechanical Engineering, 2013. Volume 2013(Article ID 249121): p. 10 pages. [14] L.A. Bonev, A geometrical method for computing the constant- orientation workspace of 6-PRRS parallel manipulators."
  },
  {
    "chunk_file": "data/chunks/pone.0047133_chunk97.txt",
    "text": "In vitro Experimental Modelling Rigid walled orifice geometries used in the experimental work were manufactured using a rapid-prototyping technique within a 0.1 mm tolerance. Orifice circumference was varied from 6 to 33 mm to reflect the physiological range in urethral dimensions."
  },
  {
    "chunk_file": "data/chunks/1-s2.0-S1350453324001371-main_chunk35.txt",
    "text": "Then, by combining these basic forms, a more intricate active constraint geometry can be created [21]. However, it should be highlighted that creating the constraint geometry by itself is insufficient when investigating the idea of active constraint definition."
  },
  {
    "chunk_file": "data/chunks/1-s2.0-S1350453324001371-main_chunk21.txt",
    "text": "Two distinct active limitations were tested with the robot: a restricted region and a safe region. In addition to measuring conventional grabbing forces, an actuated modular force feedback-enabled laparoscopic tool was proposed by Dalvand et al. [11] that can monitor the forces of tip-tissue lateral interaction."
  },
  {
    "chunk_file": "data/chunks/pone.0047133_chunk40.txt",
    "text": "The resulting simulated flow patterns match closely with those generated experimentally for water exiting an identical elliptical orifice at physiologically relevant flow rates (Fig. 2)."
  },
  {
    "chunk_file": "data/chunks/pone.0047133_chunk54.txt",
    "text": "Figure 5(a) shows representative images taken from a video of a complete voiding event for a healthy male volunteer. The characteristic shape of the urine stream matches closely with that predicted by the experimental and computational Figure 2. Experimental and computational models describe the shape of the urine flow pattern."
  },
  {
    "chunk_file": "data/chunks/JMRR-D-20-00004_R2_chunk106.txt",
    "text": "Based on the ability of ADT tool to assume a hook-like form (HF) around the spinal column, the platform was configured to give an angular displacement of  45  from the z-axis, thus giving the surgical tool complete access to all sides of the spinal column. 5."
  },
  {
    "chunk_file": "data/chunks/pone.0047133_chunk68.txt",
    "text": "6(b)). Notably some patients with low peak flow rates showed higher values of the dilation parameter indicative of a reduced meatal opening. A reduction in a patient s meatal opening might be expected at very low flow rates where there is insufficient flow to fully open the meatus (Fig."
  },
  {
    "chunk_file": "data/chunks/JMRR-D-20-00004_R2_chunk112.txt",
    "text": "Fig. 12. Variable length linear actuator."
  },
  {
    "chunk_file": "data/chunks/JMRR-D-20-00004_R2_chunk23.txt",
    "text": "To explain the evolution of the connector joint design used in the surgical robot parallel manipulator, the following section examines how the joint design originated from work on form- changing space frame structures, comprised of multiple telescopic struts. 1.3."
  },
  {
    "chunk_file": "data/chunks/286_chunk45.txt",
    "text": "To connect the linear actuators/legs to the stationary/fixed top and lower mobile base, existing octahedral robotic surgery platforms typically utilize two degree-of-freedom pivot joints. These are robust, but not concentric at the end vertices of the adjacent legs."
  },
  {
    "chunk_file": "data/chunks/286_chunk51.txt",
    "text": "The user input device selected was the NOVINT Falcon. This controller allowed a translational input of x, y and z coordinates (3DOF s). However, a graphical user interface (GUI) was generated using MATLAB to control the three rotational input values ( ,  ,  )."
  },
  {
    "chunk_file": "data/chunks/JMRR-D-20-00004_R2_chunk37.txt",
    "text": "The pivot point needs to be at the node point of the space frame to ensure the struts form the triangles that are key to the frame s stability and structural efficiency so the pivot points must be concentric."
  },
  {
    "chunk_file": "data/chunks/286_chunk79.txt",
    "text": "It was thought that a turbulent flow was generating at the entrance of the nozzle, caused by the high pressure flow. To overcome this defect, the fluid mechanics theory of  T  junction [15] flow was applied by using a second flow- controlling valve."
  },
  {
    "chunk_file": "data/chunks/1-s2.0-S1350453324001371-main_chunk115.txt",
    "text": "The extent of the noise is a property of the particular encoder in use. In our case, Tyco Electronics DPL12 Rotary Encoder produces chattering noise and rotational noise. These signal artifacts, if not dealt with, falsely trigger the software interrupts which lead to highly inaccurate encoder readings."
  },
  {
    "chunk_file": "data/chunks/286_chunk86.txt",
    "text": "The next steps in the development of the system will be implementing the proposed method of controlling the depth of water jet cut, exploring different means of powering the platform legs, and further testing and modelling. REFERENCES [1] Spine Physicians Institute. (2014)."
  },
  {
    "chunk_file": "data/chunks/286_chunk92.txt",
    "text": "J Biomed Mater Res B Appl Biomater, 2004. 71(2): p. 223-8. [5] C.A."
  },
  {
    "chunk_file": "data/chunks/1-s2.0-S1350453324001371-main_chunk101.txt",
    "text": "In this case, the PID controller maintains the robot s trajectory within a threshold acceptable to the input signal in real time, allowing the system to react in time. Notice what happens when the input speed is increased to a speed higher than the critical speed."
  },
  {
    "chunk_file": "data/chunks/1-s2.0-S1350453324001371-main_chunk129.txt",
    "text": "The scaling controller sits between the input devices and the nominal controller. Signal p is modified to produce signal  p, which is the scaled control output signal. For macro-scale,  p = p, and for micro-scale,  p = p/100."
  },
  {
    "chunk_file": "data/chunks/pone.0047133_chunk1.txt",
    "text": "The computational fluid dynamics model is used to determine the shape of a liquid jet issuing from a non- axisymmetric orifice as it deforms under the action of surface tension. The computational results are verified with experimental modelling of the urine stream."
  },
  {
    "chunk_file": "data/chunks/1-s2.0-S1350453324001371-main_chunk105.txt",
    "text": "In order to correct the motion, a suitable acceptable error threshold must be established, beyond which the constraint controller must intervene. Through empirical testing integrated with MATLAB GUI demonstrating a geometrical constraint of various shapes (Fig. 9), 10 mm has been found to be an acceptable value for this threshold."
  },
  {
    "chunk_file": "data/chunks/286_chunk96.txt",
    "text": "Technical Gazette, 2010. 17(2): p. 237-240. [8] C. Natali, Orthopaedic Bone Drills   Can They Be Improved?"
  },
  {
    "chunk_file": "data/chunks/286_chunk82.txt",
    "text": "Experimental water jet cutting, tissue removal from lamb femur (a), meat separated off the bone (b). The robot platform built used high-speed geared DC motors, coupled to leadscrew mechanisms, to extend and retract the platform s legs. Whilst cost effective, the DC motors were inadequate in actuating the lengths of the legs in a timely manner."
  },
  {
    "chunk_file": "data/chunks/1-s2.0-S1350453324001371-main_chunk111.txt",
    "text": "The controller is designed to output force feed  back that is proportional to the error hence, if the user moves the controller to outside the permissible zone, the force will be large and the vector will act to force (push/pull) the user s hand back into the permissible zone."
  },
  {
    "chunk_file": "data/chunks/1-s2.0-S1350453324001371-main_chunk139.txt",
    "text": "Graph of percentage errors against the number of encoder pulses for motor test cell with filter and without a filter. (For interpretation of the references to color in this figure legend, the reader is referred to the web version of this article.) Fig."
  },
  {
    "chunk_file": "data/chunks/pone.0047133_chunk5.txt",
    "text": "PLoS ONE 7(10): e47133. doi:10.1371/journal.pone.0047133 Editor: Timothy W. Secomb, University of Arizona, United States of America Received May 4, 2012; Accepted September 12, 2012; Published October 16, 2012 Copyright: \u0002 2012 Wheeler et al."
  },
  {
    "chunk_file": "data/chunks/JMRR-D-20-00004_R2_chunk33.txt",
    "text": "They are linear actuators that have struts that can change their length (or  telescope ) in a controlled manner, connected together pivotally at their ends, and arranged in the same geometrically-stable forms as rigid space frames. By varying the length of the struts, the frame can assume a wide variety of forms."
  },
  {
    "chunk_file": "data/chunks/286_chunk55.txt",
    "text": "Based on [13], the inverse kinematic was formulated for the 3-3 parallel octahedral platform. The layout of the electronics used, along with the associated program code that implements full positional control of the platform, can be seen in Fig. 11."
  },
  {
    "chunk_file": "data/chunks/286_chunk41.txt",
    "text": "7. Surgical tool (T) working envelope relative to vertebral cavity (VC). the Flexion system to assume a hook-like form (HF) around the spinal column, the platform was configured to give an angular displacement of  45  from the z-axis, thus giving the surgical tool complete access to all sides of the spinal column."
  },
  {
    "chunk_file": "data/chunks/JMRR-D-20-00004_R2_chunk27.txt",
    "text": "It is important that the struts  axes, and therefore the lines of force (LF) all need to intersect at CP at the nodes. This alignment, along with the use of triangulation in 3 Fig. 2."
  },
  {
    "chunk_file": "data/chunks/286_chunk69.txt",
    "text": "The test showed that the flexible drill/water jet was able to move between the transverse processes of the lumber vertebrate freely and bend to reach the lower mid-line of the vertebrate body (Fig. 15). This suggests that the size and the full curve of the  J -shape of the device is very suitable for such surgeries."
  },
  {
    "chunk_file": "data/chunks/pone.0047133_chunk50.txt",
    "text": "We therefore propose a new parameter, L=Q, which is a measure of the meatal dilation or opening as shown in Fig. 4(b). Comparisons between the CFD and experimental data for a range of orifice shapes show an excellent agreement in the values of dilation parameter L=Q (see Fig."
  },
  {
    "chunk_file": "data/chunks/pone.0047133_chunk44.txt",
    "text": "Here we show that the method of Rayleigh, significantly underestimates the actual wavelength in this simulation of the urine flow pattern (Fig. 4(a))."
  },
  {
    "chunk_file": "data/chunks/JMRR-D-20-00004_R2_chunk116.txt",
    "text": "In the prototype, the lengths when fully retracted/ fully extended are approximately 270mm and 450mm respectively  a ratio of approximately 1:1.7. A single lead screw mechanism, powered by a DC motor (M) via a gear assembly (G), produces the linear movement."
  },
  {
    "chunk_file": "data/chunks/pone.0047133_chunk78.txt",
    "text": "Self measurement of an individual s urine flow pattern and maximum wavelength can provide a simple non-invasive method for Figure 5. The human urine flow stream shows a characteristic pattern that is dependent on flow rate and orifice dilation as predicted by the experimental and computational modelling."
  },
  {
    "chunk_file": "data/chunks/JMRR-D-20-00004_R2_chunk102.txt",
    "text": "Conversely, as the cable tension decreases, the adjustable tip resumes its default near-linear form. Thus, the tip can be bend in a controlled manner up to approximately 120  from the shaft axis. 4.4."
  },
  {
    "chunk_file": "data/chunks/1-s2.0-S1350453324001371-main_chunk19.txt",
    "text": "The proposed methodology offers the surgeon with two types of force information via the haptic feedback control ar  chitecture: virtual fixture force and needle-tissue contact force. Souipas et al."
  },
  {
    "chunk_file": "data/chunks/pone.0047133_chunk93.txt",
    "text": "The data obtained in the present study included inaccuracies caused by poor estimates of Lmax which are likely to be exacerbated by obesity, poor eye sight, or lack of manual dexterity."
  },
  {
    "chunk_file": "data/chunks/pone.0047133_chunk87.txt",
    "text": "This has advantages over existing uroflow- metry techniques in that it is completely non-invasive, simple and cheap to implement and avoids inaccuracies associated with voiding in a clinical setting and obtaining data from a single void [7,21 24]."
  },
  {
    "chunk_file": "data/chunks/1-s2.0-S1350453324001371-main_chunk25.txt",
    "text": "[13] for esti  mating the tool-tissue force interaction in robot-assisted minimally invasive surgery that does not rely on external force measurement. To estimate the force interaction, the suggested technique uses the current from the surgical instrument s motors as well as neural network algo  rithms."
  },
  {
    "chunk_file": "data/chunks/1-s2.0-S1350453324001371-main_chunk31.txt",
    "text": "This method helps identify mechanical characteristics and estimate soft tissue deformation behavior, creating a nonlinear state-space equation based on hyperelasticity. In comparisons to the above existing haptic technology, guidance constraints and regional constraints are considered in this paper."
  },
  {
    "chunk_file": "data/chunks/CASE15_0460_MS_chunk52.txt",
    "text": "8 summarises the results of the test. The velocity of the flow is calculated by applying formula (8) using the known outlet pressure, P, and density of the fluid,  : Where Cd is the coefficient of discharge, this is the ratio of the actual discharge to the theoretical discharge."
  },
  {
    "chunk_file": "data/chunks/CASE15_0460_MS_chunk46.txt",
    "text": "Figure 5: Control loop structure for haptic rendering Fig. 6. A sphere with radius r cantered about the origin O, and the associated equations."
  },
  {
    "chunk_file": "data/chunks/Concentric joint connectors for form-changing space frames AM_chunk16.txt",
    "text": "A widely-used version of this type of structure is the Gough/Stewart Platform, originally developed by Gough (1962) as a tyre-testing device in the 1950s & 60s. These typically comprise upper and lower rigid plates, connected via 6 telescopic struts, and are referred to with terms such as  parallel hexa- pod manipulators  in robotics."
  },
  {
    "chunk_file": "data/chunks/CASE15_0460_MS_chunk91.txt",
    "text": "78: p. 502- 503. [8] J. Piek, J. Ortel, M.R. Gaab, Waterjet dissection in neurosurgical procedures: clinical results in 35 patients."
  },
  {
    "chunk_file": "data/chunks/CASE15_0460_MS_chunk85.txt",
    "text": "[3] K. Schwieger, V.Carrero, R. Rentzsch, A. Becker, N. Bishop, E. Hille, H. Louis, M. Morlock, M. Honl, Abrasive water jet cutting as a new procedure for cutting cancellous bone--in vitro testing in comparison with the oscillating saw. J Biomed Mater Res B Appl Biomater, 2004. 71(2): p. 223-8."
  },
  {
    "chunk_file": "data/chunks/CASE15_0460_MS_chunk84.txt",
    "text": "Summers, Waterjetting Technology1995, London: E&FN Spon. [2] M. A. Hashish, M.J.K.irby, Y-H. Pao, Method and apparatus for forming a high velocity liquid abrasive jet, in US Patent1987, Flow Industries, Inc.: USA."
  },
  {
    "chunk_file": "data/chunks/CASE15_0460_MS_chunk90.txt",
    "text": "Baer, G.J.Maddren, L.H.Blumgart, New water-jet dissector: initial experience in hepatic surgery. Br. J. Surg, 1991."
  },
  {
    "chunk_file": "data/chunks/Concentric joint connectors for form-changing space frames AM_chunk17.txt",
    "text": "However, since the 1990s, there has been growing interest in frames comprised entirely of telescopic struts, with no rigid sections, and often with multiple  cells  of struts forming arrays of tetrahedrons and/or octahedrons, which are inherently able to assume a wide variety of forms."
  },
  {
    "chunk_file": "data/chunks/CASE15_0460_MS_chunk47.txt",
    "text": "Fig. 7. Illustrative diagram showing the effects of input signal velocity Table 1: Constraint set for a cuboid, spherical and cylindrical constraint Preprint submitted to 2015 IEEE International Conference on Automation Science and Engineering."
  },
  {
    "chunk_file": "data/chunks/CASE15_0460_MS_chunk53.txt",
    "text": "Consequently, we calculate the momentum flow rate F applying: Where   is the mass flow rate. B. Measure and Control the Depth of Water Jet Cut The water jet cutting process result depends on several process parameters."
  },
  {
    "chunk_file": "data/chunks/1-s2.0-S1350453324001371-main_chunk30.txt",
    "text": "A technique for realistic modelling of human soft tissue, incorporating dynamic soft tissue characterisation was introduced by Song et al. [19]. It uses maximum likelihood theory, nonlinear filtering, and the nonlinear finite element technique (NFEM) to describe nonlinear tissue deformation behaviour."
  },
  {
    "chunk_file": "data/chunks/1-s2.0-S1350453324001371-main_chunk24.txt",
    "text": "A new nonlinear state observer is created by combining unscented Kalman filter (UKF) with the Hunt-Crossley (H C) model to estimate the contact interaction with soft tissue in real time. A new technique is proposed by Abeywardena et al."
  },
  {
    "chunk_file": "data/chunks/pone.0047133_chunk86.txt",
    "text": "doi:10.1371/journal.pone.0047133.g006 The Biophysics of the Urine Stream PLOS ONE | www.plosone.org 5 October 2012 | Volume 7 | Issue 10 | e47133 monitoring peak urine flow rate as part of the recommended practise of watchful waiting for patients with benign prostatic hyperplasia [17 20]."
  },
  {
    "chunk_file": "data/chunks/pone.0047133_chunk92.txt",
    "text": "In this report we have applied an understanding of capillary wave phenomena in liquid jets to reveal the biophysics behind the characteristic shape of the urine flow stream and how this can be used as a simple non invasive means of measuring urethral opening and urine flow rate."
  },
  {
    "chunk_file": "data/chunks/1-s2.0-S1350453324001371-main_chunk18.txt",
    "text": "In their study to investigate the effect of haptic feedback on suturing accuracy and performance, Ehrampoosh et al. [8] presented a new force-sensing and semi-automated robotic needle driver for teleoperated MIS suturing activities."
  },
  {
    "chunk_file": "data/chunks/pone.0047133_chunk79.txt",
    "text": "(a) Selected video images from which the wavelength was measured by calibrating against a rule held alongside the flow stream. (b) Representative plot for an individual void showing the temporal change in instantaneous flow rate, Q, and wavelength, L. The wavelength is a function of both the flow rate and the shape and size of the meatus."
  },
  {
    "chunk_file": "data/chunks/JMRR-D-20-00004_R2_chunk103.txt",
    "text": "Range of Movement and Working Envelope The vertebral cavity (VC) containing the spinal column (Fig. 11) of a typical prone adult patient (P) has a cross-sectional area of very approximately 60mm width and 80mm height, and an average length of approximately 700mm. However, with reference to Fig."
  },
  {
    "chunk_file": "data/chunks/JMRR-D-20-00004_R2_chunk117.txt",
    "text": "For the main lengths of the actuator portions that extend/retract, brass was chosen as it has a relatively low tendency to  gall  when used in sliding contact with other metals. In addition, the ions in copper alloys, such as brass, are both antiviral and antibacterial."
  },
  {
    "chunk_file": "data/chunks/pone.0047133_chunk45.txt",
    "text": "This deviation from Rayleigh is because the assumption of small amplitude capillary waves is not valid when the orifice aspect ratios are substantially larger than unity, as in the case of the urethral meatus."
  },
  {
    "chunk_file": "data/chunks/pone.0047133_chunk51.txt",
    "text": "4(b)), with values ranging from 2{4mm:s=mL. We will see later, from the in-vivo trials similar values for dilation parameter."
  },
  {
    "chunk_file": "data/chunks/286_chunk68.txt",
    "text": "V. EXPERIMENTAL TESTING AND RESULTS A model of a human lumbar spine was used to test the position and the degree of angulation of the flexible system. The flexible drill/water jet was inserted between L2 and L3 of the lumber spine model."
  },
  {
    "chunk_file": "data/chunks/286_chunk40.txt",
    "text": "This helped to simplify the mechanism, and prioritized end effector accuracy within a smaller working envelope. Taking the spinal column as being very approximately cylindrical in form, and based on the dimensions as above, the end-effector working envelope was established as an approximate sphere (S) of  120mm. Based on the ability of Fig."
  },
  {
    "chunk_file": "data/chunks/JMRR-D-20-00004_R2_chunk26.txt",
    "text": "The angular displacement (AS) between all the struts does not change; therefore, the struts can be connected at the vertices (or nodes) via simple rigid joints at the convergence points (CP), which are often spherical in form (JS). Figure 3 shows a simplified, detailed view of the same fixed spherical joint (JS)."
  },
  {
    "chunk_file": "data/chunks/JMRR-D-20-00004_R2_chunk32.txt",
    "text": "Form-Changing Space Frames A distinctive type of form-changing space frame structure has emerged in engineering design since the 1940s; these can act as both a rigid structure in a variety of fixed forms, or continuously vary their form, depending on the requirements of a wide variety of applications."
  },
  {
    "chunk_file": "data/chunks/286_chunk54.txt",
    "text": "In this case, the orientation and position of the flexible probe in 6DOF is specified by the user. It is then necessary to calculate the required leg lengths of each of the six platform legs in order for the robot platform to impose the desired orientation of its end-effector. This backwards calculation is known as inverse kinematics."
  },
  {
    "chunk_file": "data/chunks/pone.0047133_chunk4.txt",
    "text": "The results show that self measurement of the shape of the urine stream can be a useful diagnostic tool for medical practitioners since it provides a non-invasive method of measuring urine flow rate and urethral dilation. Citation: Wheeler APS, Morad S, Buchholz N, Knight MM (2012) The Shape of the Urine Stream   From Biophysics to Diagnostics."
  },
  {
    "chunk_file": "data/chunks/1-s2.0-S1350453324001371-main_chunk138.txt",
    "text": "S. Morad et al. Medical Engineering and Physics 132 (2024) 104236 8 Fig. 11."
  },
  {
    "chunk_file": "data/chunks/286_chunk83.txt",
    "text": "The trajectory control is obtained by limiting the input velocity within a certain threshold, in order to allow sufficient time for the system to catch up with the input signals. The slow leg extensions made the threshold value very small, which meant that the velocity of the input signals was limited to a very low value as well."
  },
  {
    "chunk_file": "data/chunks/1-s2.0-S1350453324001371-main_chunk110.txt",
    "text": "The software receives inputs of force vectors and magnitudes in the form of a 3 by 1 array (e.g. [Fx Fy Fz]) and applies its proprietary calculations to generate the appropriate actuation of the 3 motors to generate the desired force. This is felt by the user as a pushing/pulling force."
  },
  {
    "chunk_file": "data/chunks/1-s2.0-S1350453324001371-main_chunk104.txt",
    "text": "By reducing the input velocity,  t will increase, and the robot s trajectory will closely follow the input signal. Since the input signals are constantly changing, the robot s path cannot correspond to them. Consequently, the system will always have an error as long as the inputs change, since the system requires time to react."
  },
  {
    "chunk_file": "data/chunks/286_chunk97.txt",
    "text": ". J Bone Joint Surg, 1996. 78(B): p. 357-362."
  },
  {
    "chunk_file": "data/chunks/1-s2.0-S1350453324001371-main_chunk112.txt",
    "text": "As the user approaches the boundary the force de  creases gradually since the magnitude of error decreases as well, until the user is on the boundary and the error is reduced to 0 where the force vector also becomes 0 and the controller ceases to exert a force."
  },
  {
    "chunk_file": "data/chunks/286_chunk81.txt",
    "text": "Implementing the  T  junction modified the pattern of the outlet jet and greatly improved its effectiveness; at 25 bar it could remove 15mm depth of meat off the bone of a lamb femur (Fig.17). Fig. 17."
  },
  {
    "chunk_file": "data/chunks/286_chunk95.txt",
    "text": "J Neurosurg Pediatr, 2010. 5(3): p. 243-9. [7] P. Hreha, J. Valicek, D. Kozak, M. Harnicarova, M. Rakin, Water jet technology used in medicine."
  },
  {
    "chunk_file": "data/chunks/1-s2.0-S1350453324001371-main_chunk106.txt",
    "text": "The NF Fig. 8. Illustrative diagram showing the effects of input signal velocity."
  },
  {
    "chunk_file": "data/chunks/pone.0047133_chunk6.txt",
    "text": "This is an open-access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited."
  },
  {
    "chunk_file": "data/chunks/JMRR-D-20-00004_R2_chunk24.txt",
    "text": "Space Frames Space frame structures emerged in the 1890s from work by A. G. Bell [13] related to structures for kites that were lightweight, but also strong. They are comprised from rigid struts joined together at their ends, configured as 3-dimensional trusses."
  },
  {
    "chunk_file": "data/chunks/286_chunk42.txt",
    "text": "For the variable-length linear actuators, or legs, a relatively simple single-portion extension configuration was used; with reference to Fig. 8, this comprises only two main groups of components: an outer, cylindrical  barrel  (B) and a corresponding inner  piston  (P)."
  },
  {
    "chunk_file": "data/chunks/286_chunk56.txt",
    "text": "The figure clearly illustrates how each electronic component is connected, powered electrically and controlled electronically from the input side through to the output side. Fig. 11."
  },
  {
    "chunk_file": "data/chunks/JMRR-D-20-00004_R2_chunk30.txt",
    "text": "Fig. 3. Space frame node   rigid joint detail It will be seen that there are at least 3 struts converging at any of the nodes within a space frame, and this can increase to 8 in a pyramidal/tetrahedral arrangement of the frame, or 9 struts in the tetrahedral/octahedral frame, both shown in Figure 2-A and 2-B."
  },
  {
    "chunk_file": "data/chunks/JMRR-D-20-00004_R2_chunk18.txt",
    "text": "An alternative configuration is the parallel manipulator configuration, where multiple struts form closed kinematic chains. The most common configuration is in the form of an octahedron, where two opposing rigid faces/plates are connected by six struts. These struts vary their length (telescope), and are connected via passive, free-rotation joints."
  },
  {
    "chunk_file": "data/chunks/pone.0047133_chunk47.txt",
    "text": "Considering the analogy with the 2-d droplet oscillating with frequency f , and traveling with a velocity V, we see that the wavelength is given by Equation 8."
  },
  {
    "chunk_file": "data/chunks/pone.0047133_chunk53.txt",
    "text": "Results and Discussion In-vivo trials Having developed the theory explaining the flow pattern associated with an elliptical orifice, we now examine the real flow pattern for urine exiting the meatus and the changes which occur during a single void."
  },
  {
    "chunk_file": "data/chunks/JMRR-D-20-00004_R2_chunk129.txt",
    "text": "15) consist of a number of sub-assemblies (SA), which each connect to the ends of the LA and the mobile base (MB). A flexible, slightly elastic cord (C) passes through each subassembly. The cord is precisely adjusted via a threaded mechanism (TM) to pre-tension it."
  },
  {
    "chunk_file": "data/chunks/JMRR-D-20-00004_R2_chunk101.txt",
    "text": "The FE is comprised of steel, with the cables routed within the R. When the cables are tightened, via a threaded mechanism connected to the TC, the tip bends to form an approximate arc or J-shape, with the radius of the arc diminishing as the tension increases."
  },
  {
    "chunk_file": "data/chunks/1-s2.0-S1350453324001371-main_chunk8.txt",
    "text": "It has been found that surgeons using robotic surgical probes find that the lack of feedback eliminates tactile cues, masks force cues, and in some cases increases intraoperative injury [3,4]."
  },
  {
    "chunk_file": "data/chunks/JMRR-D-20-00004_R2_chunk115.txt",
    "text": "The  stroke  of a linear actuator is the variation in length of the whole assembly as it goes from maximum retraction to maximum extension, whilst accounting for any portions of the design that are either fixed in length/do not fully retract, and/or any overlap at maximum extension."
  },
  {
    "chunk_file": "data/chunks/pone.0047133_chunk84.txt",
    "text": "The green region represents the 95% confidence envelope for Lmax=Qmax values based on data from the normal group. Individuals with Lmax and Qmax values within the yellow region have a normal flow rate but reduced urethral dilation."
  },
  {
    "chunk_file": "data/chunks/286_chunk104.txt",
    "text": "Mechanism and Machine Theory, 2001. 36: p. 1-13. [15] P K. Kundu, D R. Dowling, Fluid Mechanics."
  },
  {
    "chunk_file": "data/chunks/pone.0047133_chunk90.txt",
    "text": "This is demonstrated in Fig. 7, which shows the predicted versus measured flow-rate for an individual, where the individual s dilation parameter has been calculated at one point, and used to predict the peak flow-rate at several other voiding events, using the individual s self measurement of Lmax."
  },
  {
    "chunk_file": "data/chunks/1-s2.0-S1350453324001371-main_chunk32.txt",
    "text": "Guidance constraints are used to guide the user through a path. This technique has many limitations when used to guide robotic surgical probes along convoluted pathways inside the human body. The probe can only operate in a specific active space."
  },
  {
    "chunk_file": "data/chunks/1-s2.0-S1350453324001371-main_chunk26.txt",
    "text": "Offline and online testing are carried out to determine the practicality of the created algorithm. The authors demonstrated that the devised approach shows promise in allowing for a live estimate of tool-tissue force, potentially enabling haptic feedback in robotic surgery."
  },
  {
    "chunk_file": "data/chunks/Concentric joint connectors for form-changing space frames AM_chunk29.txt",
    "text": "3.2 Ball and socket joints   inherent disadvantages Figure 7 shows a joint assembly of 3 DOF ball- and-socket joints (JBS). The non-concentric pivot points (PP) of the joints are separated by distance D. The separation is necessary as this mechanism is not able to be transposed into the same volume as anoth- er."
  },
  {
    "chunk_file": "data/chunks/CASE15_0460_MS_chunk45.txt",
    "text": "This is done by incorporating a velocity limit constraint that generates a haptic force that slows the user down if the critical velocity is exceeded. The mathematical equations governing the role of velocity limit constraint controller is represents below: Where f is force magnitude, V is velocity, ft is threshold force, and i is x, y, z."
  },
  {
    "chunk_file": "data/chunks/CASE15_0460_MS_chunk51.txt",
    "text": "The flow rate and pressure were expected to vary based on the discharge flow valve opening. This was done by measuring both variables at every 0.25 revolution of the discharge flow valve knob from fully close to three revolutions. Fig."
  },
  {
    "chunk_file": "data/chunks/Concentric joint connectors for form-changing space frames AM_chunk15.txt",
    "text": "These have struts that can change their length (or  telescope ) in a controlled manner (i.e. they are linear actuators), connected to- gether pivotally at their ends, and arranged in the same geometrically-stable forms as rigid space frames. By varying the length of the struts, the frame can assume a wide variety of forms."
  },
  {
    "chunk_file": "data/chunks/CASE15_0460_MS_chunk79.txt",
    "text": "The data shows that an interval of 5 s increase in time results in an interval 3 mm cutting depth. Therefore, controlling the depth of water jet cut can be done by controlling the time."
  },
  {
    "chunk_file": "data/chunks/CASE15_0460_MS_chunk86.txt",
    "text": "[4] D.N. Papachristou, R.Barters, Resection of the liver with a waterjet. British Journal Of Surgery, 1982."
  },
  {
    "chunk_file": "data/chunks/CASE15_0460_MS_chunk92.txt",
    "text": "Journal of Neurosurgery, 2002. 96: p. 690-696. [9] J. Hubert, E. Mourey, J. M. Suty, A. Coissard, J. Floquet, and P. Mangin, Water-jet dissection in renal surgery: experimental study of a new device in the pig."
  },
  {
    "chunk_file": "data/chunks/CASE15_0460_MS_chunk93.txt",
    "text": "Urol Res, 1996. 24: p. 355-359. [10] M. Shoham, M.Burman, E. Zehavi, L.Joskowicz, E.Batkilin, and Y. Kunicher, Bone-Mounted Miniature Robot for Surgical Procedures: Concept and Clinical Applications."
  },
  {
    "chunk_file": "data/chunks/CASE15_0460_MS_chunk87.txt",
    "text": "69: p. 93-94. [5] B.G. Persson, B.Jeppson, K. Tranberg, K. Roslund, S. Bengmark Transection of the liver with a water jet."
  },
  {
    "chunk_file": "data/chunks/Concentric joint connectors for form-changing space frames AM_chunk14.txt",
    "text": "2 FORM-CHANGING SPACE FRAMES 2.1 Overview A distinctive type of form-changing space frame structure has emerged in engineering design since the 1940s; these can act as both a rigid structure in a variety of fixed forms, or continuously vary their form, depending on the requirements of a wide vari- ety of applications."
  },
  {
    "chunk_file": "data/chunks/CASE15_0460_MS_chunk78.txt",
    "text": "The most consistent parameter that affects the depth of water jet cutting depth is the time of applied water. The experimental data (Fig. 13) shows that a constant increase of applied time gives a constant increase in the depth of cut."
  },
  {
    "chunk_file": "data/chunks/CASE15_0460_MS_chunk50.txt",
    "text": "The values obtained are compared with the predicted values gained from the calculation and flow analysis simulation (Fig. 9). Hence, the flow rate (Q) and pressure of the water jet (P) was measured."
  },
  {
    "chunk_file": "data/chunks/Concentric joint connectors for form-changing space frames AM_chunk28.txt",
    "text": "Initial prototype frame and joints Single piece joints were moulded in silicone rub- ber to avoid the need to bond the sections together, which were less prone to failure, but their strength was limited by the moulded material. For both ex- amples, the pivoting of the struts was imprecise and not concentric around the frame s node points."
  },
  {
    "chunk_file": "data/chunks/CASE15_0460_MS_chunk44.txt",
    "text": "The resultant trajectory, shown in red, shows the path of the robot s end-effector crossing the inadmissible region. To avoid this, the input velocity must be limited to be below the critical value at all times."
  },
  {
    "chunk_file": "data/chunks/1-s2.0-S1350453324001371-main_chunk27.txt",
    "text": "Wearable Haptic Devices (WHDs) such as Hand Exoskeletons (HE) have emerged as the future focus for haptic devices. WHDs such as wearable Fingertip Haptic Device (FHD) [14 16] can provide more freedom of movement, mimic the hand movements of the operator and potentially remove the cognitive gap in tele-operation."
  },
  {
    "chunk_file": "data/chunks/1-s2.0-S1350453324001371-main_chunk33.txt",
    "text": "It is important to keep the probe s degree of motion within the surgical environment. The paper is intended to set out the initial results of this control system, to set the scene for further analysis, simulation and testing. 1.3."
  },
  {
    "chunk_file": "data/chunks/pone.0047133_chunk91.txt",
    "text": "The figure shows the uncertainty in the estimate of Qmax was improved to +2% (2 standard deviations)."
  },
  {
    "chunk_file": "data/chunks/286_chunk105.txt",
    "text": "5th ed2012, UK: Elsevier Inc."
  },
  {
    "chunk_file": "data/chunks/pone.0047133_chunk85.txt",
    "text": "(b) Frequency distributions for the dilation parameter, Lmax=Qmax, for the healthy and patient groups showing a statistically significant difference suggesting that the latter have reduced urethral opening."
  },
  {
    "chunk_file": "data/chunks/JMRR-D-20-00004_R2_chunk114.txt",
    "text": "seals/collars, or fixed-length connecting joints), and the need to prevent the piston from fully emerging out of the cylinder, as there must always be a certain overlap of the lengths of the two components at the point of maximum extension."
  },
  {
    "chunk_file": "data/chunks/JMRR-D-20-00004_R2_chunk100.txt",
    "text": "It is primarily formed from a 5mm diameter hollow round shaft (R) of SAE grade 304) steel 18% chromium and 8% nickel. A handle (H) near the proximal end is formed from polyphenylsulfone (PPSU) plastic material. A revolving nut/tensioning screw (TC) is located beyond the handle at the proximal end."
  },
  {
    "chunk_file": "data/chunks/1-s2.0-S1350453324001371-main_chunk9.txt",
    "text": "Widespread adoption of surgical robots is therefore unlikely unless a way is found to address arguably the biggest problem in surgical robotics, the lack of touch. 1.2. Haptic technology In general, haptics refers to the simulated interactions of humans, robots, and simulated or remote environments [5]."
  },
  {
    "chunk_file": "data/chunks/pone.0047133_chunk52.txt",
    "text": "The computational and experimental modelling has therefore shown us that we would expect the urine stream wavelength L to be directly proportional to the flow-rate Q for a fixed meatal geometry and that the ratio L=Q can be used as a measure of meatal dilation."
  },
  {
    "chunk_file": "data/chunks/JMRR-D-20-00004_R2_chunk128.txt",
    "text": "A concentric connector joint as part a prototype surgical platform (A, B) and Tapering Cord Joints as part of a prototype octahedral-frame (C, D). Samir Morad, Christian Ulbricht, Paul Harkin, Justin Chan, Kim Parker, Ravi Vaidyanathan 10 The joints (Fig."
  },
  {
    "chunk_file": "data/chunks/pone.0047133_chunk46.txt",
    "text": "The computational and experimental modeling highlight the dependence of wavelength on orifice aspect-ratio ratio (Dmax=Dmin) and cross sectional area (A). Thus variation in orifice size or urethral dilation between individuals or during the course of a single void will influence the flow pattern and the wavelength."
  },
  {
    "chunk_file": "data/chunks/JMRR-D-20-00004_R2_chunk19.txt",
    "text": "This configuration is commonly known as a  Stewart Platform  (or  Gough-Stewart platform ) [5] [6]. It has been adapted and used for several diverse applications, such as flight simulators [7], industrial process robots [8], and surgical platforms [9]. The term  hexapod  is also used to mean an octahedral parallel manipulator."
  },
  {
    "chunk_file": "data/chunks/286_chunk57.txt",
    "text": "Component layout of the system. IV. MODELLING AND SIMULATION A. Modelling The robot was modelled as six leg subsystems attached to the top and base plates to form the plant block of the model."
  },
  {
    "chunk_file": "data/chunks/JMRR-D-20-00004_R2_chunk31.txt",
    "text": "If the frame is double-layered, up to 12 struts converge at the nodes for either arrangement. 1.4."
  },
  {
    "chunk_file": "data/chunks/JMRR-D-20-00004_R2_chunk25.txt",
    "text": "Figure 2-A, B shows examples based on struts in square pyramidal/tetrahedral and octahedral/tetrahedral arrangements. Historically, these frames have used struts of fixed lengths to create rigid structures. Figure 2-C shows a close-up view of a rigid space frame, comprised of fixed-length struts (S)."
  },
  {
    "chunk_file": "data/chunks/286_chunk43.txt",
    "text": "The lengths when fully retracted/ fully-extended are approximately 270mm and 450mm respectively, i.e. a ratio of approximately 1:1.7. A single lead screw mechanism, powered by a DC motor (M) via a gear assembly (G), produces the linear movement."
  },
  {
    "chunk_file": "data/chunks/pone.0047133_chunk7.txt",
    "text": "Funding: This research was unfunded, and so no funder had a role in study design, data collection and analysis, decision to publish, or preparation of the manuscript. Competing Interests: The authors have declared that no competing interests exist."
  },
  {
    "chunk_file": "data/chunks/286_chunk94.txt",
    "text": "[6] C.A. Tschan, W. Wagner, J.K. Krauss, J.M. Oertel, Waterjet dissection in pediatric cranioplasty."
  },
  {
    "chunk_file": "data/chunks/1-s2.0-S1350453324001371-main_chunk107.txt",
    "text": "(For interpretation of the references to color in this figure legend, the reader is referred to the web version of this article.) Fig. 9."
  },
  {
    "chunk_file": "data/chunks/1-s2.0-S1350453324001371-main_chunk113.txt",
    "text": "This ensures an optimal balance between the allowable speed and precision of the end effector. 4. Motor-Encoder testing and results Rotary encoders are notoriously susceptible to signal noise."
  },
  {
    "chunk_file": "data/chunks/286_chunk80.txt",
    "text": "This formed a 90   T  branch arm, and the pressure at the nozzle was reduced by discharging a set amount of water from the second valve, leading to a solid stream output jet."
  }
]